[
  {
    "roll": "1",
    "name": "BLASTING GALE",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The Stormseer calls up a screaming windstorm to assail the foe. It is all his victims can do to stand their ground without being torn from their feet, let alone press forwards into battle.",
    "type": "Stormspeaking Discipline",
    "description": "Malediction: Blasting Gale has a warp charge value of 7. If manifested, select one enemy unit within 18\" of and visible to this psyker. Until the start of your next Psychic phase, that unit cannot Advance, and when a charge roll is made for it, roll one fewer D6, to a minimum of one D6 (typically, this will mean one D6 is rolled instead of 2D6).",
    "id": "000003612002"
  },
  {
    "roll": "2",
    "name": "LIGHTNING CALL",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "Raising his arms to the roiling storm-clouds overhead, the Stormseer calls down lightning strikes upon his foes.",
    "type": "Stormspeaking Discipline",
    "description": "Witchfire: Lightning Call has a warp charge value of 7. If manifested, the closest enemy unit within 18\" of this psyker suffers D3 mortal wounds. If that unit is not destroyed, roll one D6; on a 4+ that unit suffers 1 mortal wound. Then, if that unit is still not destroyed, roll one D6; on a 5+ that unit suffers 1 mortal wound. Then, if that unit is still not destroyed, roll one D6; on a 6 that unit suffers 1 mortal wound.",
    "id": "000003612003"
  },
  {
    "roll": "3",
    "name": "RIDE THE WINDS",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "Invoking the power of the winds with a gravelly-voiced chant, the Stormseer sends rushing currents of invisible energy to speed his comrades into battle.",
    "type": "Stormspeaking Discipline",
    "description": "Blessing: Ride the Winds has a warp charge value of 6. If manifested, select one friendly WHITE SCARS unit within 12\" of this psyker. Until the start of your next Psychic phase, when an Advance roll or charge roll is made for that unit, add 2 to the result.",
    "id": "000003612004"
  },
  {
    "roll": "4",
    "name": "STORM-WREATHED",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "At the Stormseer’s behest the roiling clouds funnel into a furious vortex that swirls down to surround his advancing brothers. Lightning crackles around the White Scars and leaps from their bodies to strike down the foe.",
    "type": "Stormspeaking Discipline",
    "description": "Blessing: Storm-wreathed has a warp charge value of 6. If manifested, select one friendly WHITE SCARS unit within 12\" of this psyker. Until the start of your next Psychic phase, enemy units cannot fire Overwatch at that unit, and after that unit finishes a charge move, for each model in that unit, you can select one enemy unit within 1\" of that model and roll one D6; on a 6, that enemy unit suffers 1 mortal wound.",
    "id": "000003612005"
  },
  {
    "roll": "5",
    "name": "SPIRITS OF CHOGORIS",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "Many and terrible are the spirits and ghouls of Chogorian tribal folklore, and it is warpwrought simulacra of these ancient terrors that the Stormseer now unleashes on the foe.",
    "type": "Stormspeaking Discipline",
    "description": "Malediction: Spirits of Chogoris has a warp charge value of 6. If manifested, select one enemy unit within 18\" of and visible to this psyker. Until the start of your next Psychic phase, subtract 1 from the Leadership characteristic of models in that unit, and when resolving an attack made by a model in that unit, subtract 1 from the hit roll.",
    "id": "000003612006"
  },
  {
    "roll": "6",
    "name": "EYE OF THE STORM",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "Summoning a hurricane, the Stormseer becomes the heart of a screaming cyclone. Wherever he strides, the enemy are plucked from their feet and dashed to ruin by its elemental fury.",
    "type": "Stormspeaking Discipline",
    "description": "Witchfire: Eye of the Storm has a warp charge value of 6. If manifested, roll one D6 for each enemy unit within 12\" of this psyker, adding 1 to the result if that unit can FLY; on a 4+ that unit suffers 1 mortal wound.",
    "id": "000003612007"
  },
  {
    "roll": "1",
    "name": "UMBRAL FORM",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The psyker summons a veil of darkness, slipping into its folds to evade the fury and firepower of the foe.",
    "type": "Umbramancy Discipline",
    "description": "Blessing: Umbral Form has a warp charge value of 5. If manifested, until the start of your next Psychic phase this psyker has a 4+ invulnerable save.",
    "id": "000003660002"
  },
  {
    "roll": "2",
    "name": "ENVELOPING DARKNESS",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "At the psyker’s command, the shadows cast by his enemies rise up and engulf them like a dense flock of ravens, leaving them disorientated and vulnerable to attack.",
    "type": "Umbramancy Discipline",
    "description": "Malediction: Enveloping Darkness has a warp charge value of 7. If manifested, select one enemy unit within 18\" of and visible to this psyker. Until the start of your next Psychic phase, that unit cannot fire Overwatch, and when resolving an attack made by that unit, subtract 1 from the hit roll.",
    "id": "000003660003"
  },
  {
    "roll": "3",
    "name": "SPECTRAL BLADE",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The psyker implants his foe with the psychosomatic suggestion that his weapon is irresistibly sharp, striking them down with the psychic feedback of their own warped perceptions.",
    "type": "Umbramancy Discipline",
    "description": "Blessing: Spectral Blade has a warp charge value of 5. If manifested, until the start of your next Psychic phase this psyker’s Strength characteristic is equal to their Leadership characteristic. In addition, until the start of your next Psychic phase, when resolving an attack made with a melee weapon by this psyker against a unit whose highest Leadership characteristic is lower than this psyker’s, that weapon has an Armour Penetration characteristic of -4 for that attack.",
    "id": "000003660004"
  },
  {
    "roll": "4",
    "name": "SHADOWSTEP",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The gloom of the battlefield coalesces into a dark passageway that allows those who use it to stalk amongst shadows and re-emerge where the foe least expects them.",
    "type": "Umbramancy Discipline",
    "description": "Blessing: Shadowstep has a warp charge value of 7. If manifested, select one RAVEN GUARD CHARACTER unit from your army within 18\" of this psyker. Remove that unit from the battlefield and set it up anywhere on the battlefield that is more than 9\" from any enemy models.",
    "id": "000003660005"
  },
  {
    "roll": "5",
    "name": "THE ABYSS",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "A shadowy whirlpool opens in the enemy’s midst, snatching away unfortunate warriors as it gathers terrifying momentum.",
    "type": "Umbramancy Discipline",
    "description": "Witchfire: The Abyss has a warp charge value of 6. If manifested, select one enemy unit within 18\" of and visible to this psyker. Roll three D6; for each roll of 4+ that unit suffers 1 mortal wound. If any models in that unit are destroyed as a result of this psychic power, subtract 1 from the Leadership characteristic of models in that unit until the end of this turn.",
    "id": "000003660006"
  },
  {
    "roll": "6",
    "name": "THE DARKNESS WITHIN",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The psyker sends his mind forth, calling not to the visible shadows surrounding his enemies but rather to the fears and doubts that shadow their souls. These he draws out as weeping umbral ectoplasm, until only ghost-pale corpses remain.",
    "type": "Umbramancy Discipline",
    "description": "Witchfire: The Darkness Within has a warp charge value of 6. If manifested, select up to three enemy units within 18\" of this psyker. Roll one D6 for each of those units, adding 1 to the result if the result of the Psychic test was more than 10; on a 4+ that unit suffers 1 mortal wound.",
    "id": "000003660007"
  },
  {
    "roll": "1",
    "name": "BLESSING OF THE MACHINE GOD",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The Librarian reaches out with his mind and binharically amplifies the anger of a nearby machine spirit, driving it to lash out at the enemy with renewed purpose.",
    "type": "Technomancy Discipline",
    "description": "Blessing: Blessing of the Machine God has a warp charge value of 5. If manifested, select one friendly IRON HANDS VEHICLE model within 12\" of this psyker (you can only select a TITANIC model if the result of the Psychic test to manifest this power was 8 or more). Until the start of your next Psychic phase, when resolving an attack made by that model, add 1 to the hit roll.",
    "id": "000003673002"
  },
  {
    "roll": "2",
    "name": "OBJURATION MECHANICUM",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "Extending their hand, the Librarian compels the enemy’s equipment to betray them. Grenades spontaneously detonate, weapons backfire, and power cells overheat in a deadly fashion.",
    "type": "Technomancy Discipline",
    "description": "Malediction: Objuration Mechanicum has a warp charge value of 7. If manifested, select one enemy unit within 18\" of and visible to this psyker. Until the start of your next Psychic phase, when resolving an attack made with a ranged weapon by a model in that unit, on an unmodified hit roll of 1 that unit suffers 1 mortal wound after resolving that attack.",
    "id": "000003673003"
  },
  {
    "roll": "3",
    "name": "FURY OF MEDUSA",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The psyker channels the might of Medusa’s furious electrical storms, unleashing a leaping psychic gheist that surges through the enemy.",
    "type": "Technomancy Discipline",
    "description": "Witchfire: Fury of Medusa has a warp charge value of 6. If manifested, select one enemy model within 18\" of and visible to this psyker. Draw the shortest possible imaginary straight line, 1mm wide, between this psyker’s base and that model’s base. Roll one D6 for the selected model’s unit and each other enemy unit that this line passes across, adding 2 to the result if the unit being rolled for is a VEHICLE. On a 4-5 the unit being rolled for suffers 1 mortal wound; on a 6+ the unit being rolled for suffers D3 mortal wounds.",
    "id": "000003673004"
  },
  {
    "roll": "4",
    "name": "PSYSTEEL ARMOUR",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "At the Librarian’s command, warp energy flows in streamers from thin air and winds itself around his allies, glowing like forge-hot steel. The flowing psysteel coats the armour of nearby tanks or Dreadnoughts, or else wraps fellow warriors in a second skin capable of turning aside bullet and blade alike.",
    "type": "Technomancy Discipline",
    "description": "Blessing: Psysteel Armour has a warp charge value of 6. If manifested, select one friendly IRON HANDS unit within 12\" of this psyker. Until the start of your next Psychic phase, when resolving an attack made against that unit, add 1 to the saving throw. Invulnerable saves are not affected.",
    "id": "000003673005"
  },
  {
    "roll": "5",
    "name": "REFORGE",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "Pressing his hand against rent vehicle armour, the psyker chants binharic incantations that urge the machine to repair itself. Wiring reknits, damaged energy cells are sealed and buckled armour flattens and reforms.",
    "type": "Technomancy Discipline",
    "description": "Blessing: Reforge has a warp charge value of 5. If manifested, select one friendly IRON HANDS VEHICLE model within 3\" of and visible to that psyker (you cannot select a model that has already regained lost wounds this turn). That model regains up to D3 lost wounds.",
    "id": "000003673006"
  },
  {
    "roll": "6",
    "name": "MACHINE FLENSE",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The psyker lashes out with his mind at an enemy war machine to shred its armoured hull. The strips of razor-edged shrapnel torn from the vehicle’s iron flesh are hurled like daggers at a nearby foe.",
    "type": "Technomancy Discipline",
    "description": "Witchfire: Machine Flense has a warp charge value of 6. If manifested, select one enemy VEHICLE unit that is within 18\" of and visible to this psyker. That unit suffers D3 mortal wounds. You can then select one other enemy unit that was within 6\" of and visible to that VEHICLE unit when this power was manifested. Roll one D6 for each mortal wound that VEHICLE unit suffered; for each 3+ the other selected unit suffers 1 mortal wound.",
    "id": "000003673007"
  },
  {
    "roll": "1",
    "name": "TERRIFY",
    "faction_id": "INQ",
    "faction_name": "Inquisition",
    "legend": "",
    "type": "Telethesia Discipline",
    "description": "Malediction: Terrify has a warp charge value of 6. If manifested, select one enemy unit within 18\" of, and visible to, this PSYKER. Until the start of your next Psychic phase:Subtract 1 from the Leadership characteristic of models in that unit.That unit cannot fire Overwatch.",
    "id": "000003853002"
  },
  {
    "roll": "2",
    "name": "PSYCHIC FORTITUDE",
    "faction_id": "INQ",
    "faction_name": "Inquisition",
    "legend": "",
    "type": "Telethesia Discipline",
    "description": "Blessing: Psychic Fortitude has a warp charge value of 4. If manifested, select one friendly IMPERIUM unit within 12\" of this PSYKER. Until the start of your next Psychic phase, when a Morale test is taken for that unit, do not roll the dice; it is automatically passed.",
    "id": "000003853003"
  },
  {
    "roll": "3",
    "name": "DOMINATE",
    "faction_id": "INQ",
    "faction_name": "Inquisition",
    "legend": "",
    "type": "Telethesia Discipline",
    "description": "Malediction: Dominate has a warp charge value of 6. If manifested, select one enemy model within 12\" of this PSYKER that is not a VEHICLE and roll 3D6. If the total is equal to or greater than that enemy model’s Leadership characteristic, that enemy model can immediately shoot with one weapon as if it were your Shooting phase, or make one attack as if it were the Fight phase. In either case, treat that enemy model as if it is a separate unit that is part of your army whilst shooting or making that close combat attack.",
    "id": "000003853004"
  },
  {
    "roll": "4",
    "name": "MENTAL INTERROGATION",
    "faction_id": "INQ",
    "faction_name": "Inquisition",
    "legend": "",
    "type": "Telethesia Discipline",
    "description": "Malediction: Mental Interrogation has a warp charge value of 6. If manifested, select one enemy CHARACTER model within 12\" of, and visible to, this PSYKER.Until the start of your next Psychic phase, when resolving an attack made by that enemy model, subtract 1 from the hit roll.If your army is Battle-forged roll 3D6; if the result is equal to or greater than that enemy model’s Leadership characteristic, you gain 1 Command point.",
    "id": "000003853005"
  },
  {
    "roll": "5",
    "name": "PSYCHIC PURSUIT",
    "faction_id": "INQ",
    "faction_name": "Inquisition",
    "legend": "",
    "type": "Telethesia Discipline",
    "description": "Blessing: Psychic Pursuit has a warp charge value of 7. If manifested, select one enemy CHARACTER unit that only contains models with a Wounds characteristic of 9 or less and is within 18\" of, and visible to, this PSYKER. Then, select one friendly &lt;ORDO&gt; INFANTRY unit within 6\" of this PSYKER. Until the end of your next Shooting phase, each time you select a target for a ranged weapon a model in that friendly &lt;ORDO&gt; INFANTRY unit is making an attack with, you can ignore the Look Out, Sir rule if you select that enemy CHARACTER unit as the target.",
    "id": "000003853006"
  },
  {
    "roll": "6",
    "name": "CASTIGATION",
    "faction_id": "INQ",
    "faction_name": "Inquisition",
    "legend": "",
    "type": "Telethesia Discipline",
    "description": "Witchfire: Castigation has a warp charge value of 6. If manifested, select one enemy unit within 18\" of, and visible to, this PSYKER and roll 3D6; if the total exceeds the lowest Leadership characteristic in that enemy unit, that enemy unit suffers D3 mortal wounds.",
    "id": "000003853007"
  },
  {
    "roll": "1",
    "name": "TECTONIC PURGE (AURA)",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The Librarian interlocks his fingers, raises his hands high and brings them down in a clubbing blow upon the ground. Psychic energies pour from the impact site, causing the ground to convulse and shudder violently and enemies to be flung from their feet.",
    "type": "Geokinesis Discipline",
    "description": "Blessing: Tectonic Purge has a warp charge value of 6. If manifested, then until the start of your next Psychic phase, when a charge roll is made for an enemy unit within 12\" of this psyker, subtract 2 from the result.",
    "id": "000003694002"
  },
  {
    "roll": "2",
    "name": "WRACK AND RUIN",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "Reaching out with his mind, the Librarian senses every fault, hairline crack and structural weakness in an enemy fortification, then builds empyric resonance within them until the stronghold shakes itself violently apart.",
    "type": "Geokinesis Discipline",
    "description": "Witchfire: Wrack and Ruin has a warp charge value of 6. If manifested, select one BUILDING unit, or one enemy unit that is wholly on or within an Area Terrain feature and is within 18\" of and visible to this PSYKER. Roll nine D6, adding 1 to the result if the unit you selected was a BUILDING; for each roll of 5+ that unit suffers 1 mortal wound.",
    "id": "000003694003"
  },
  {
    "roll": "3",
    "name": "IRON INFERNO",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The Librarian sends his mind questing outward to locate seams of metal, the iron spars of girders and foundations, and any other metallic deposit he can sense. Then, with a furious mental blast, he superheats them all to trigger a devastating pyrometallic eruption.",
    "type": "Geokinesis Discipline",
    "description": "Witchfire: Iron Inferno has a warp charge value of 6. If manifested, select one point on the battlefield within 18\" of and visible to this psyker. Roll one D6 for each enemy unit within 6\" of that point; on a 4+ that unit suffers 1 mortal wound.",
    "id": "000003694004"
  },
  {
    "roll": "4",
    "name": "FORTIFY",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The Librarian envisions a mighty citadel, ravaged by battle but under swift repair. As he does so he lets his powers wash out across his battle-brothers, compelling their flesh to knit and their bones to set just as the mental fortress is restored to its original magnificence.",
    "type": "Geokinesis Discipline",
    "description": "Blessing: Fortify has a warp charge value of 4. If manifested, select one friendly IMPERIAL FISTS INFANTRY or IMPERIAL FISTS BIKER model within 12\" of the psyker; that model regains up to D3 lost wounds.",
    "id": "000003694005"
  },
  {
    "roll": "5",
    "name": "ASPECT OF STONE",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "Thrumming geokinetic energies wreath the Librarian’s fists. Iron strengthens his sinews while his flesh becomes unyielding as ferrocrete – in such a state, he becomes all but unstoppable.",
    "type": "Geokinesis Discipline",
    "description": "Blessing: Aspect of Stone has a warp charge value of 5. If manifested, then until the start of your next Psychic phase, add 2 to this psyker’s Strength and Toughness characteristics.",
    "id": "000003694006"
  },
  {
    "roll": "6",
    "name": "CHASM",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The psyker slams his palms together, and then pulls them slowly apart. As he does, a wide chasm opens beneath the feet of his enemy and they plunge screaming to their doom in the darkness below.",
    "type": "Geokinesis Discipline",
    "description": "Witchfire: Chasm has a warp charge value of 6. If manifested, select one enemy unit that cannot FLY and is within 18\" of and visible to this psyker. Roll 2D6: if the result is less than the lowest Move characteristic in that unit it suffers 1 mortal wound; if the result equals the lowest Move characteristic in that unit it suffers D3 mortal wounds; if the result is greater than the lowest Move characteristic in that unit it suffers 3 mortal wounds.",
    "id": "000003694007"
  },
  {
    "roll": "1",
    "name": "FLAMING BLAST",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The Librarian condenses the roiling energy of the warp into a great ball of raging fire before casting it at the foe.",
    "type": "Promethean Discipline",
    "description": "Witchfire: Flaming Blast has a warp charge value of 6. If manifested, select one point on the battlefield within 24\" of and visible to this psyker. Roll one D6 for each enemy unit within 3\" of that point; on a 4+ that unit suffers 1 mortal wound.",
    "id": "000003700002"
  },
  {
    "roll": "2",
    "name": "FIRE SHIELD",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "Extending his hand, a great sheet of flame bursts from the Librarian’s palm. With a sweep of his arms, he creates a towering wall of flame to protect his battle-brothers.",
    "type": "Promethean Discipline",
    "description": "Blessing: Fire Shield has a warp charge value of 6. If manifested, select one friendly SALAMANDERS unit within 18\" of this psyker. Until the start of your next Psychic phase, when resolving an attack made with a ranged weapon against that unit, subtract 1 from the hit roll. In addition, when a charge roll is made for a charge that unit is a target of, subtract 1 from the result.",
    "id": "000003700003"
  },
  {
    "roll": "3",
    "name": "BURNING HANDS",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The Librarian’s gauntlets glow bright before bursting into flames. Each strike from these armoured fists blasts the unfortunate victim into ashes.",
    "type": "Promethean Discipline",
    "description": "Blessing: Burning Hands has a warp charge value of 6. If manifested, then until the start of your next Psychic phase, each time this PSYKER makes a melee attack, you can select for it to use the close combat weapon profile instead of a melee weapon it is equipped with. Each time this PSYKER makes an attack with the close combat weapon profile, if a hit is scored, the target suffers 1 mortal wound and the attack sequence ends.",
    "id": "000003700004"
  },
  {
    "roll": "4",
    "name": "DRAKESKIN",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The Librarian summons a shimmering layer of translucent scales around his allies, harder even than the impervious hides of the great drakes of Nocturne.",
    "type": "Promethean Discipline",
    "description": "Blessing: Drakeskin has a warp charge value of 6. If manifested, select one friendly SALAMANDERS unit within 12\" of this psyker. Until the start of your next Psychic phase, add 1 to the Toughness characteristic of models in that unit.",
    "id": "000003700005"
  },
  {
    "roll": "5",
    "name": "FURY OF NOCTURNE",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The Librarian channels his powers into the ground around him to create a microcosm of Nocturne around his foes. The earth darkens and begins to split, before towering flames and boiling magma spew forth to burn the enemies of the Salamanders to cinders.",
    "type": "Promethean Discipline",
    "description": "Witchfire: Fury of Nocturne has a warp charge value of 6. If manifested, select one enemy unit within 18\" of and visible to this psyker. Roll 2D6; if the result is greater than the highest Toughness characteristic of models in that unit, that unit suffers D3 mortal wounds.",
    "id": "000003700006"
  },
  {
    "roll": "6",
    "name": "DRACONIC ASPECT",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "Summoning the wrath of the indigenous creatures of Nocturne, the Librarian takes on the appearance of a great fire-breathing drake. With burning eyes and flame streaming from his nostrils, the Salamander sends his enemies fleeing in panic.",
    "type": "Promethean Discipline",
    "description": "Blessing: Draconic Aspect has a warp charge value of 6. If manifested, then until the start of your next Psychic phase, subtract 2 from the Leadership characteristic of models in enemy units whilst their unit is within 12\" of this psyker.",
    "id": "000003700007"
  },
  {
    "roll": "1",
    "name": "MIASMA OF PESTILENCE",
    "faction_id": "DG",
    "faction_name": "Death Guard",
    "legend": "As the psyker chants in a phlegm-choked drone, a dark cloud of filth and rot flies shrouds his allies from view.",
    "type": "Contagion Discipline",
    "description": "Blessing: Miasma of Pestilence has a warp charge value of 6. If manifested, select one friendly DEATH GUARD unit within 18\" of this PSYKER. Until the start of your next Psychic phase, each time an attack is made against that unit, subtract 1 from that attacks hit roll.",
    "id": "000002328002"
  },
  {
    "roll": "2",
    "name": "GIFT OF CONTAGION",
    "faction_id": "DG",
    "faction_name": "Death Guard",
    "legend": "With a gesture the psyker gathers a foul fog of contagion about his enemies, granting them a blessing from Grandfather Nurgle.",
    "type": "Contagion Discipline",
    "description": "Malediction: Gift of Contagion has a warp charge value of 5. If manifested, select one enemy unit within 18\" of this PSYKER. Until the start of your next Psychic phase, subtract 1 from the Strength characteristic of models in that unit. If the result of the Psychic test was 8+, subtract 1 from the Strength and Attacks characteristics of models in that unit instead.",
    "id": "000002328003"
  },
  {
    "roll": "3",
    "name": "PLAGUE WIND",
    "faction_id": "DG",
    "faction_name": "Death Guard",
    "legend": "The psyker belches forth a wind of plague that blows through his foes, choking them and leaving only diseased, maggot-bloated corpses in its wake.",
    "type": "Contagion Discipline",
    "description": "Witchfire: Plague Wind has a warp charge value of 6. If manifested, select one enemy unit within 18\" of and visible to this PSYKER. Roll one D6 for each model in that unit. For each 6, that unit suffers 1 mortal wound. If the result of the Psychic test was 9+, that unit suffers 1 mortal wound for each 5+ instead.",
    "id": "000002328004"
  },
  {
    "roll": "4",
    "name": "PUTRESCENT VITALITY",
    "faction_id": "DG",
    "faction_name": "Death Guard",
    "legend": "Rancorous energies surge through Nurgle’s followers, bloating their distended bodies further with fresh infections and granting them new strength.",
    "type": "Contagion Discipline",
    "description": "Blessing: Putrescent Vitality has a warp charge value of 7. If manifested, select one friendly DEATH GUARD INFANTRY unit within 18\" of this PSYKER. Until the start of your next Psychic phase, add 1 to the Strength and Toughness characteristics of models in that unit.",
    "id": "000002328005"
  },
  {
    "roll": "5",
    "name": "CURSE OF THE LEPER",
    "faction_id": "DG",
    "faction_name": "Death Guard",
    "legend": "The victims touched by this enervating curse find themselves weakened and drained of life within moments.",
    "type": "Contagion Discipline",
    "description": "Witchfire: Curse of the Leper has a warp charge value of 6. If manifested, select the closest enemy unit that is within 18\" of and visible to this PSYKER. Roll seven D6s: for each dice result that exceeds that enemy unit’s Toughness characteristic, it suffers 1 mortal wound.",
    "id": "000002328006"
  },
  {
    "roll": "6",
    "name": "GIFT OF PLAGUES",
    "faction_id": "DG",
    "faction_name": "Death Guard",
    "legend": "Channelling Nurgle’s blessings and power, the psyker enhances the contagions bestowed on the Death Guard of his army.",
    "type": "Contagion Discipline",
    "description": "Blessing: Gift of Plagues has a warp charge value of 6. If manifested, select one friendly DEATH GUARD unit within 18\" of this PSYKER. Until the start of your next Psychic phase, add 6” to the range of any Contagion abilities that unit has (to a maximum of 12\").",
    "id": "000002328007"
  },
  {
    "roll": "1",
    "name": "SHROUDING",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The psyker uses his mastery of the warp to fog the minds of his enemies, clouding their senses so that his allies appear as nothing more than indistinct shadows.",
    "type": "Obscuration Discipline",
    "description": "Blessing: Shrouding has a warp charge value of 6. If manifested, select one friendly &lt;CHAPTER&gt; PHOBOS unit within 18\" of this PSYKER. Until the start of your next Psychic phase, unless that unit is the closest eligible target, enemy models cannot target that unit with ranged attacks.",
    "id": "000003379002"
  },
  {
    "roll": "2",
    "name": "SOUL SIGHT",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The psyker shares his warp-sight with his brethren, causing their eyes to glow with an ethereal light. So empowered, no foe can escape their omniscient gaze; the souls of their targets flare like flaming beacons in the dark.",
    "type": "Obscuration Discipline",
    "description": "Blessing: Soul Sight has a warp charge value of 6. If manifested, select one friendly &lt;CHAPTER&gt; PHOBOS unit within 18\" of this PSYKER. Until the start of your next Psychic phase, each time a model in that unit makes a ranged attack, you can re-roll the hit roll and the target does not receive the benefits of cover against that attack.",
    "id": "000003379003"
  },
  {
    "roll": "3",
    "name": "MIND RAID",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The psyker peers into the mind of the foe, raiding their thoughts for secret codes, battle plans, the location of hidden forces and any other tactical information that might be useful. Such brute psychic interrogation doubtless inflicts severe cerebral trauma on its victim.",
    "type": "Obscuration Discipline",
    "description": "Witchfire: Mind Raid has a warp charge value of 6. If manifested, select one enemy model within 18\" of and visible to this PSYKER.That model’s unit suffers 1 mortal wound.If that model is a CHARACTER, roll 3D6: if the result is equal to or greater than that model’s Leadership characteristic, you gain 1 Command point.",
    "id": "000003379004"
  },
  {
    "roll": "4",
    "name": "HALLUCINATION",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The psyker instils terror and panic within his foes by conjuring images out of their memories - from past allies seemingly returned from the dead, to apparitions wrought from nightmares.",
    "type": "Obscuration Discipline",
    "description": "Malediction: Hallucination has a warp charge value of 6. If manifested, select one enemy unit within 18\" of and visible to this PSYKER.Until the start of your next Psychic phase, subtract 1 from the Leadership characteristic of models in that unit.Until the start of your next Psychic phase, each time a model in that unit makes an attack, subtract 1 from that attack’s hit roll.",
    "id": "000003379005"
  },
  {
    "roll": "5",
    "name": "TENEBROUS CURSE",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "As the psyker twists his hand, a psychic bolt lances through the minds of his enemies. As they reel from the assault, their own shadows seemingly come to life, pulling their casters to the ground with frenzied determination.",
    "type": "Obscuration Discipline",
    "description": "Malediction: Tenebrous Curse has a warp charge value of 7. If manifested, select one enemy unit that cannot FLY and is within 18\" of and visible to this PSYKER.That unit suffers 1 mortal wound.Until the start of your next Psychic phase, halve that unit’s Move characteristic and subtract 2 from Advance rolls and charge rolls made for it.",
    "id": "000003379006"
  },
  {
    "roll": "6",
    "name": "TEMPORAL CORRIDOR",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The psyker creates an invisible corridor in which the passage of time is altered, allowing his allies to traverse the battlefield with supernatural swiftness.",
    "type": "Obscuration Discipline",
    "description": "Blessing: Temporal Corridor has a warp charge value of 5. If manifested, select one friendly &lt;CHAPTER&gt; PHOBOS unit within 6\" of this PSYKER.That unit cannot shoot or fight this turn.If that unit is not within Engagement Range of any enemy models, it can either make a Normal Move or it can Advance as if it were your Movement phase (if it Advances, do not make an Advance roll; instead, until the end of the phase, add 6\" to the Move characteristic of models in that unit).",
    "id": "000003379007"
  },
  {
    "roll": "1",
    "name": "CONCEAL/REVEAL",
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "legend": "The psyker takes command of the darkness around them, using it to conceal their kin or reveal any opponents who skulk in the shadows.",
    "type": "Psychic Disciplines",
    "description": "Conceal/Reveal has a warp charge value of 6. If manifested, select one of the following effects:Conceal (Blessing): Select one friendly &lt;CRAFTWORLD&gt; ASURYANI CORE unit within 18\" of this PSYKER. Until the start of your next Psychic phase, that unit receives the benefits of Light Cover.Reveal (Malediction): Select one enemy unit within 18\" of this PSYKER. Until the start of your next Psychic phase, each time an ASURYANI model from your army makes an attack, that enemy unit does not receive the benefits of cover against that attack.",
    "id": "000000956002"
  },
  {
    "roll": "2",
    "name": "EMBOLDEN/HORRIFY",
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "legend": "The psyker reaches into the minds of the battlefields combatants, instilling their allies with valour or sapping courage from their enemies.",
    "type": "Psychic Disciplines",
    "description": "Embolden/Horrify has a warp charge value of 7. If manifested, select one of the following effects:Embolden (Blessing): Select one friendly &lt;CRAFTWORLD&gt; ASURYANI CORE or &lt;CRAFTWORLD&gt; ASURYANI CHARACTER unit within 18\" of this PSYKER. Until the start of your next Psychic phase:Add 2 to that unit’s Leadership characteristic.At the start of the Fight phase, if that unit is within Engagement Range of any enemy units, it can fight first that phase.Horrify (Malediction): Select one enemy unit within 18\" of this PSYKER. Until the start of your next Psychic phase:Subtract 2 from the Leadership characteristic of that unit.At the start of the Fight phase, if that unit is within Engagement Range of any units from your army, that unit is not eligible to fight this phase until after all eligible units from your army have done so.",
    "id": "000000956003"
  },
  {
    "roll": "3",
    "name": "ENHANCE/DRAIN",
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "legend": "Calling upon Khaines immortal favour, the psyker enhances the combat skills of their allies or weakens those of their foes.",
    "type": "Psychic Disciplines",
    "description": "Enhance/Drain has a warp charge value of 6. If manifested, select one of the following effects:Enhance (Blessing): Select one friendly &lt;CRAFTWORLD&gt; ASURYANI CORE unit within 18\" of this PSYKER. Until the start of your next Psychic phase, each time a model in that unit makes a melee attack, add 1 to that attack’s hit roll.Drain (Malediction): Select one enemy unit within 18\" of this PSYKER. Until the start of your next Psychic phase, each time a model in that unit makes a melee attack, subtract 1 from that attack’s hit roll.",
    "id": "000000956004"
  },
  {
    "roll": "4",
    "name": "PROTECT/JINX",
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "legend": "Chained by runes of power, fate itself is bound to the will of the psyker. Such power is the difference between life and death.",
    "type": "Psychic Disciplines",
    "description": "Protect/Jinx has a warp charge value of 7. If manifested, select one of the following effects:Protect (Blessing): Select one friendly &lt;CRAFTWORLD&gt; ASURYANI CORE unit within 18\" of this PSYKER. Until the start of your next Psychic phase, improve the Save characteristic of models in that unit by 1 (to a maximum of 2+).Jinx (Malediction): Select one enemy unit within 18\" of this PSYKER. Until the start of your next Psychic phase, worsen the Save characteristic of models in that unit by 1 (to a maximum of 6+).",
    "id": "000000956005"
  },
  {
    "roll": "5",
    "name": "QUICKEN/RESTRAIN",
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "legend": "The psyker twists time, their outline blurring as they and their fellows move like phantoms across the field. Those cursed by such temporal manipulations find themselves moving as if through deep water.",
    "type": "Psychic Disciplines",
    "description": "Quicken/Restrain has a warp charge value of 6. If manifested, select one of the following effects:Quicken (Blessing): Select one friendly &lt;CRAFTWORLD&gt; ASURYANI CORE or &lt;CRAFTWORLD&gt; ASURYANI CHARACTER unit within 18\" of this PSYKER. That unit can immediately make a Normal Move, Advance or Fall Back as if it were the Movement phase. If it does so, that unit is not eligible to shoot or declare a charge with this turn.Restrain (Malediction): Select one enemy unit within 18\" of this PSYKER. Until the start of your next Psychic phase:Halve the Move characteristic of models in that unit.That unit cannot perform actions (if that unit is currently performing an action, it immediately fails).",
    "id": "000000956006"
  },
  {
    "roll": "6",
    "name": "EMPOWER/ENERVATE",
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "legend": "The psyker helps their comrades to strike at their full potential, imbuing them with the strength of the Aeldari heroes of old whilst diminishing the powers of their foes.",
    "type": "Psychic Disciplines",
    "description": "Empower/Enervate has a warp charge value of 7. If manifested, select one of the following effects:Empower (Blessing): Select one friendly &lt;CRAFTWORLD&gt; ASURYANI CORE unit within 18\" of this PSYKER. Until the start of your next Psychic phase, each time a model in that unit makes a melee attack, add 1 to that attack’s wound roll.Enervate (Malediction): Select one enemy unit within 18\" of this PSYKER. Until the start of your next Psychic phase, each time a model in that unit makes a melee attack, subtract 1 from that attack’s wound roll.",
    "id": "000000956007"
  },
  {
    "roll": "1",
    "name": "GUIDE",
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "legend": "The psyker twists the strands of destiny to their will, picking out targets from amidst the swirling chaos of battle and guiding the shots of their allies to where they might do the most harm.",
    "type": "Psychic Disciplines",
    "description": "Blessing: Guide has a warp charge value of 6. If manifested, select one friendly &lt;CRAFTWORLD&gt; ASURYANI CORE or &lt;CRAFTWORLD&gt; ASURYANI CHARACTER unit within 18\" of this PSYKER. Until the start of your next Psychic phase, each time a model in that unit makes an attack, you can re-roll the hit roll. If the result of the Psychic test was 10 or more, you can select one friendly &lt;CRAFTWORLD&gt; ASURYANI CORE or &lt;CRAFTWORLD&gt; ASURYANI CHARACTER unit within 24\" of this PSYKER instead.",
    "id": "000000957002"
  },
  {
    "roll": "2",
    "name": "DOOM",
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "legend": "With a simple manipulation of that which is to come, the psyker grants a darkened fate to a chosen foe. While this shadow rests upon the enemys soul, death seeks them out above all others, each blow or shot that comes their way rendered inescapably lethal.",
    "type": "Psychic Disciplines",
    "description": "Malediction: Doom has a warp charge value of 7. If manifested, select one enemy unit within 18\" of this PSYKER. Until the start of your next Psychic phase, each time a &lt;CRAFTWORLD&gt; ASURYANI CORE or &lt;CRAFTWORLD&gt; ASURYANI CHARACTER unit from your army makes an attack that targets that enemy unit, you can re-roll the wound roll. If the result of the Psychic test was 10 or more, you can select one enemy unit within 24\" of this PSYKER instead.",
    "id": "000000957003"
  },
  {
    "roll": "3",
    "name": "FORTUNE",
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "legend": "The psyker series possible futures to foresee imminent danger, then aids their allies in avoiding it. The terrors of the warp recoil from the psykers mind, while shots pass through thin air where Asuryani warriors stood but a moment before.",
    "type": "Psychic Disciplines",
    "description": "Blessing: Fortune has a warp charge value of 6. If manifested, select one friendly &lt;CRAFTWORLD&gt; ASURYANI CORE or &lt;CRAFTWORLD&gt; ASURYANI CHARACTER unit within 18\" of this PSYKER. Until the start of your next Psychic phase, each time a model in that unit would lose a wound, roll one D6: on a 5+, that wound is not lost. If the result of the Psychic test was 10 or more, you can select one friendly &lt;CRAFTWORLD&gt; ASURYANI CORE or &lt;CRAFTWORLD&gt; ASURYANI CHARACTER unit within 24\" of this PSYKER instead.",
    "id": "000000957004"
  },
  {
    "roll": "4",
    "name": "EXECUTIONER",
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "legend": "The psyker summons an astral doppelganger and unleashes it upon the foe. This vengeful apparition carves a path through the enemys ranks, each kill spurring it on as it rips apart flesh in a blaze of psychic energy.",
    "type": "Psychic Disciplines",
    "description": "Witchfire: Executioner has a warp charge value of 7. If manifested, select one enemy unit (excluding CHARACTER units with a Wounds characteristic of 9 or less) within 18\" of this PSYKER. That enemy unit suffers D3 mortal wounds. If any enemy models are destroyed as a result of these mortal wounds, that enemy unit suffers an additional D3 mortal wounds. If the result of the Psychic test was 10 or more, you can select one enemy unit (excluding CHARACTER units with a Wounds characteristic of 9 or less) within 24\" of this PSYKER instead.",
    "id": "000000957005"
  },
  {
    "roll": "5",
    "name": "WILL OF ASURYAN",
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "legend": "Sensing an approaching crux of destiny, the psyker summons the certainty and confidence of ancient days. Doubt and fear are washed from their mind, and those nearby gain grim resolve from the psykers indomitable aura.",
    "type": "Psychic Disciplines",
    "description": "Blessing: Will of Asuryan has a warp charge value of 6. If manifested, select one friendly &lt;CRAFTWORLD&gt; ASURYANI CORE or &lt;CRAFTWORLD&gt; ASURYANI CHARACTER unit within 18\" of this PSYKER. Until the start of your next Psychic phase:That unit gains the Objective Secured ability.Each time a Morale test is taken for that unit, it is automatically passed.If that unit is performing an action, it can still make attacks with ranged weapons without that action failing.If the result of the Psychic test was 8 or more, you can select one friendly &lt;CRAFTWORLD&gt; ASURYANI CORE or &lt;CRAFTWORLD&gt; ASURYANI CHARACTER unit within 24\" of this PSYKER instead.",
    "id": "000000957006"
  },
  {
    "roll": "6",
    "name": "MIND WAR",
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "legend": "The psyker reaches out to attack the mind of an enemy in a desperate mental duel. Foes find their thoughts invaded by the crushing presence of the invader, whose ancient and inscrutable will triggers a cascade of psychosomatic trauma, extinguishing the victims personality with horrific ease.",
    "type": "Psychic Disciplines",
    "description": "Witchfire: Mind War has a warp charge value of 7. If manifested, select one enemy CHARACTER model within 18\" of this PSYKER. Roll one D6 and add this PSYKER’s Leadership characteristic to the result of your roll. Your opponent then rolls one D6 and adds the Leadership characteristic of that enemy CHARACTER model to the result of their roll. If your total result is greater than your opponent’s total result, that enemy CHARACTER model suffers a number of mortal wounds equal to the difference. If the result of the Psychic test was 10 or more, you can roll 2D3 instead of one D6, and add the result to the Leadership characteristic of this PSYKER.",
    "id": "000000957007"
  },
  {
    "roll": "1",
    "name": "MASS HYPNOSIS",
    "faction_id": "GC",
    "faction_name": "Genestealer Cults",
    "legend": "The psyker exerts their mental dominion over their foes, placing them into a trance-like state so that the cult can take them apart at leisure.",
    "type": "Broodmind Discipline",
    "description": "Malediction: Mass Hypnosis has a warp charge value of 7. If manifested, select one enemy unit within 18\" of and visible to this PSYKER. Until the start of your next Psychic phase:Subtract 1 from the Attacks characteristic of models in that unit.In the Fight phase, that unit is not eligible to fight until after all eligible units from your army have done so.",
    "id": "000003158002"
  },
  {
    "roll": "2",
    "name": "MIND CONTROL",
    "faction_id": "GC",
    "faction_name": "Genestealer Cults",
    "legend": "The psyker stabs at the minds of their victims, stoking their doubts and assailing them with contrary directives.",
    "type": "Broodmind Discipline",
    "description": "Malediction: Mind Control has a warp charge value of 6. If manifested, select one enemy unit within 18\" of and visible to this PSYKER. Until the start of your next Psychic phase:Each time a model in that unit makes an attack, subtract 1 from that attack’s hit roll.If the result of the Psychic test was equal to or greater than that unit’s Leadership characteristic, subtract 1 from that unit’s Leadership characteristic and subtract 1 from Combat Attrition tests taken for that unit.",
    "id": "000003158003"
  },
  {
    "roll": "3",
    "name": "PSIONIC BLAST",
    "faction_id": "GC",
    "faction_name": "Genestealer Cults",
    "legend": "With a screech of triumph, the psyker focuses the alien hatred of their kind into a blaze of pallid energies that consumes their enemies.",
    "type": "Broodmind Discipline",
    "description": "Witchfire: Psionic Blast has a warp charge value of 5. If manifested, select one enemy unit within 18\" of and visible to this PSYKER. For the purposes of selecting that enemy unit, unless that enemy unit is within Engagement Range of this PSYKER, the Look Out, Sir rule applies as if this psychic power was a ranged weapon with a Range characteristic of 18\".That unit suffers D3 mortal wounds.If the result of the Psychic test was equal to or greater than that unit’s Leadership characteristic, that unit suffers 3 mortal wounds instead of D3.",
    "id": "000003158004"
  },
  {
    "roll": "4",
    "name": "MENTAL ONSLAUGHT",
    "faction_id": "GC",
    "faction_name": "Genestealer Cults",
    "legend": "The psyker intensifies their hypnotic power to such a degree that it can cause their victims’ brains to swell to bursting point inside their skulls.",
    "type": "Broodmind Discipline",
    "description": "Witchfire: Mental Onslaught has a warp charge value of 5. If manifested, select one enemy unit within 24\" of and visible to this PSYKER and roll four D6: for each result of 5+, that unit suffers 1 mortal wound. If any models in that unit are destroyed as a result of those mortal wounds but that unit is not destroyed, keep repeating this process, reducing the number of dice rolled by 1 each time (e g. three D6 on the first repeat, two D6 on the second repeat) until any of the following conditions are met during that repeat:The number of dice to roll is 0.You roll no results of 5+.No enemy models are destroyed.",
    "id": "000003158005"
  },
  {
    "roll": "5",
    "name": "PSYCHIC STIMULUS",
    "faction_id": "GC",
    "faction_name": "Genestealer Cults",
    "legend": "The unknowable power of the cult’s gestalt soul flows into the psykers chosen instruments, spurring them into a religious frenzy that sees them attack with hyperactive speed.",
    "type": "Broodmind Discipline",
    "description": "Blessing: Psychic Stimulus has a warp charge value of 6. If manifested, select one friendly &lt;CULT&gt; unit within 18\" of and visible to this PSYKER. Until the start of your next Psychic phase:That unit is eligible to shoot and/or declare a charge with in a turn in which it Advanced or Fell Back.Models in that unit do not suffer the penalty incurred to their hit rolls for firing Assault weapons in the same turn in which their unit Advanced.",
    "id": "000003158006"
  },
  {
    "roll": "6",
    "name": "MIGHT FROM BEYOND",
    "faction_id": "GC",
    "faction_name": "Genestealer Cults",
    "legend": "With a low whisper that rises to a scream, the psyker amplifies the alien might hidden within every cultist, swelling their bodies with empowering energy born of the void itself.",
    "type": "Broodmind Discipline",
    "description": "Blessing: Might From Beyond has a warp charge value of 6. If manifested, select one friendly &lt;CULT&gt; unit within 18\" of and visible to this PSYKER. Until the start of your next Psychic phase, add 1 to the Attacks characteristic of models in that unit.",
    "id": "000003158007"
  },
  {
    "roll": "1",
    "name": "GATE OF INFINITY",
    "faction_id": "GK",
    "faction_name": "Grey Knights",
    "legend": "The psyker punches a corridor through the roiling immaterium, allowing him to cross great distances in the blink of an eye.",
    "type": "Dominus Discipline",
    "description": "Blessing: Gate of Infinity has a warp charge value of 7. If manifested, select one friendly GREY KNIGHTS PSYKER unit within 18\" of this PSYKER Remove that unit from the battlefield and then set it back up on the battlefield, anywhere that is more than 9\" away from any enemy models.",
    "id": "000003988002"
  },
  {
    "roll": "2",
    "name": "EMPYRIC AMPLIFICATION",
    "faction_id": "GK",
    "faction_name": "Grey Knights",
    "legend": "In ritualistic patterns, the psyker overlays a complex web of blessed, psychic amplification around the doomed foe. Matching the intricate martial methods of his brother knights, each strike with their psychically empowered weapons through this field drives more of their manifested power into the enemy.",
    "type": "Dominus Discipline",
    "description": "Malediction: Empyric Amplification has a warp charge value of 7. If manifested, select one enemy unit within 12\" of and visible to this PSYKER. Until the start of your next Psychic phase, each time an attack made with a Nemesis or psi weapon is allocated to a model in that unit, add 1 to the Damage characteristic of that attack.",
    "id": "000003988003"
  },
  {
    "roll": "3",
    "name": "SANCTUARY",
    "faction_id": "GK",
    "faction_name": "Grey Knights",
    "legend": "Chanting words of warding, the psyker creates a zone of light around him that can both protect him from harm and repel daemonic creatures.",
    "type": "Dominus Discipline",
    "description": "Blessing: Sanctuary has a warp charge value of 6. If manifested, select one friendly GREY KNIGHTS unit within 18\" of this PSYKER. Until the start of your next Psychic phase, models in that unit have a 4+ invulnerable save.",
    "id": "000003988004"
  },
  {
    "roll": "4",
    "name": "VORTEX OF DOOM",
    "faction_id": "GK",
    "faction_name": "Grey Knights",
    "legend": "The psyker tears a rift between realspace and the warp, condemning his foes to total oblivion.",
    "type": "Dominus Discipline",
    "description": "Witchfire: Vortex of Doom has a warp charge value of 7. If manifested, select the closest enemy unit within 12\" of and visible to this PSYKER: each other enemy unit within 3\" of the selected unit suffers 1 mortal wound, and then the selected unit suffers 2D3 mortal wounds. If the model manifesting this power has been selected this phase for the Psychic Epitome Warlord Trait, only the unit you selected suffers the additional mortal wound from that trait, not those other enemy units within 3\" of it.",
    "id": "000003988005"
  },
  {
    "roll": "5",
    "name": "WARP SHAPING",
    "faction_id": "GK",
    "faction_name": "Grey Knights",
    "legend": "The psyker draws deep from the very fabric of the warp, moulding it to serve his will and the needs of his battle-brothers.",
    "type": "Dominus Discipline",
    "description": "Blessing: Warp Shaping has a warp charge value of 4. If manifested, select one Tide of the Warp that has not been dominant for your army during this battle. Your army’s currently dominant Tide of the Warp is changed to the selected Tide of the Warp.",
    "id": "000003988006"
  },
  {
    "roll": "6",
    "name": "GHOSTLY BONDS",
    "faction_id": "GK",
    "faction_name": "Grey Knights",
    "legend": "Subtly manipulating the invisible barrier separating the immaterium from the material realm, the psyker causes imperfect wrinkles and bulges within its fabric to gather around his opponents, pushing back against their advance and dragging at their momentum like a spiritual halter.",
    "type": "Dominus Discipline",
    "description": "Malediction: Ghostly Bonds has a warp charge value of 5. If manifested, select one enemy unit within 18\" of and visible to this PSYKER. Until the start of your next Psychic phase, halve that unit’s Move characteristic.",
    "id": "000003988007"
  },
  {
    "roll": "1",
    "name": "Incursion",
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "legend": "The psyker opens a portal to the Realm of Chaos, allowing the warp’s daemonic denizens to spill forth into reality.",
    "type": "Malefic Discipline",
    "description": "Incursion has a warp charge value of 7. If manifested, the psyker can immediately attempt to summon a unit of DAEMONS to the battlefield using the Daemonic Ritual ability as if it were the Movement phase. When doing so, roll up to 4 dice instead of up to 3. The psyker will not suffer any mortal wounds as a result of doubles or triples being rolled for this Daemonic Ritual.",
    "id": "000003236002"
  },
  {
    "roll": "2",
    "name": "Sacrifice",
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "legend": "The psyker uses a sacrificial soul to remould and repair an unholy Daemon-form. The tainted spirits of Warpsmiths are particularly invigorating offerings to those Daemon Engines that are in their charge.",
    "type": "Malefic Discipline",
    "description": "Sacrifice has a warp charge value of 4. If manifested, choose any model within 2\" of the psyker; that model suffers 1 mortal wound. Then, choose a friendly &lt;LEGION&gt; DAEMON model within 18\" of the psyker. That model regains D3 lost wounds. If that  DAEMON model is a DAEMON ENGINE and the model you chose to inflict the mortal wound on was a friendly &lt;LEGION&gt; WARPSMITH, the model regains 3 lost wounds instead.",
    "id": "000003236003"
  },
  {
    "roll": "3",
    "name": "Mutated Invigoration",
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "legend": "A wave of insanity and mutation flows from the psyker’s fingers, enveloping their Daemonkin allies with bountiful gifts.",
    "type": "Malefic Discipline",
    "description": "Mutated Invigoration has a warp charge value of 7. If manifested, select a friendly CHAOS SPAWN , &lt;LEGION&gt; POSSESSED or &lt;LEGION&gt; CULT OF DESTRUCTION unit within 18\" of the psyker. Until the start of your next Psychic phase, that unit will gain a bonus depending on what unit it is, as follows:You can re-roll the dice when rolling for that Chaos Spawn’s Mutated Beyond Reason ability.You can re-roll the dice when rolling for the Attacks characteristic of that unit of Possessed due to its Writhing Tentacles ability.You can re-roll one of the dice when rolling for the Strength, AP and Damage characteristics of that Cult of Destruction unit’s weapons due to its Fleshmetal Guns or Fleshmetal Weapons ability.",
    "id": "000003236004"
  },
  {
    "roll": "4",
    "name": "Possession",
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "legend": "The psyker blasts away their enemy’s soul so that the spiritless shell left behind can be possessed by a Daemon, who quickly transforms it into a more pleasing form. Vehicles so possessed are typically unable to contain the Daemon within, and explode in a scream of empyric energy.",
    "type": "Malefic Discipline",
    "description": "Possession has a warp charge value of 5. If manifested, then until the start of your next Psychic phase, the Armour Penetration characteristic of the psyker’s melee weapons is improved by 2 (e.g. an AP of -1 becomes -3). Furthermore, until the start of your next Psychic phase, each time the psyker destroys an enemy INFANTRY CHARACTER in the Fight phase, you can add a Chaos Spawn model to your army. If the destroyed model was ADEPTUS ASTARTES or HERETIC ASTARTES, you can instead add a Greater Possessed model to your army. If a new model is added to your army, set it up within 6\" of the psyker and more than 1\" from any enemy models. In addition, each time the psyker destroys an enemy VEHICLE model in the Fight phase that could explode, it automatically explodes; no dice roll is made and any mortal wounds suffered by the psyker in the resulting explosion are ignored.",
    "id": "000003236005"
  },
  {
    "roll": "5",
    "name": "Cursed Earth",
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "legend": "The psyker becomes a conduit through which the energies of the warp flow, tainting the very ground and sustaining the Daemonkin that walk upon it.",
    "type": "Malefic Discipline",
    "description": "Cursed Earth has a warp charge value of 7. If manifested, then until the start of your next Psychic phase, the invulnerable save of friendly &lt;LEGION&gt; DAEMON units is improved by 1 (to a maximum of 3+) while they are within 6\" of this psyker.",
    "id": "000003236006"
  },
  {
    "roll": "6",
    "name": "Infernal Power",
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "legend": "The fell power of the immaterium flows from the psyker, imbuing the Daemons that reside within his followers’ bodies with even greater ferocity.",
    "type": "Malefic Discipline",
    "description": "Infernal Power has a warp charge value of 6. If manifested, then until the start of your next Psychic phase re-roll hit and wound rolls of 1 for attacks made by friendly &lt;LEGION&gt; DAEMON units while they are within 6\" of this psyker.",
    "id": "000003236007"
  },
  {
    "roll": "1",
    "name": "GAZE OF YNNEAD",
    "faction_id": "YNN",
    "faction_name": "Ynnari",
    "legend": "The psyker’s eyes blaze with fire as they channel the power of Ynnead.",
    "type": "Revenant Discipline",
    "description": "Gaze of Ynnead has a warp charge value of 6. If manifested, select one enemy unit that is within 18\" of and visible to this psyker and roll one D6: on a 1, that unit suffers 1 mortal wound; on a 2-5 that unit suffers D3 mortal wounds; on a 6, that unit suffers D6 mortal wounds.",
    "id": "000003516002"
  },
  {
    "roll": "2",
    "name": "STORM OF WHISPERS",
    "faction_id": "YNN",
    "faction_name": "Ynnari",
    "legend": "The psyker’s voice joins with those of the dead to drive the foe insane.",
    "type": "Revenant Discipline",
    "description": "Storm of Whispers has a warp charge value of 6. If manifested, roll three D6 for each enemy unit within 6\" of this psyker; for each result of 6, the unit being rolled for suffers 1 mortal wound.",
    "id": "000003516003"
  },
  {
    "roll": "3",
    "name": "WORD OF THE PHOENIX",
    "faction_id": "YNN",
    "faction_name": "Ynnari",
    "legend": "The psyker calls upon the rebirthing energies of the mythical phoenix.",
    "type": "Revenant Discipline",
    "description": "Word of the Phoenix has a warp charge value of 5. If manifested, select one friendly YNNARI INFANTRY or YNNARI BIKER unit within 18\" of this psyker. If that unit contains a model that has lost any wounds, that model regains up to D3 lost wounds. Otherwise, if any models from that unit have been destroyed, roll one D6; on a 4+ you can return one destroyed model from that unit to the battlefield with 1 wound remaining, placing it in unit coherency (if the model cannot be placed in this way, it is not returned to the battlefield).",
    "id": "000003516004"
  },
  {
    "roll": "4",
    "name": "UNBIND SOULS",
    "faction_id": "YNN",
    "faction_name": "Ynnari",
    "legend": "The psyker reaches out with their powers to weaken the bond between soul and body.",
    "type": "Revenant Discipline",
    "description": "Unbind Souls has a warp charge value of 6. If manifested, select one enemy unit within 18\" of this psyker. Until the start of your next Psychic phase, when resolving an attack made with a melee weapon by a friendly YNNARI model against that enemy unit, you can re-roll the wound roll.",
    "id": "000003516005"
  },
  {
    "roll": "5",
    "name": "SHIELD OF YNNEAD",
    "faction_id": "YNN",
    "faction_name": "Ynnari",
    "legend": "The psyker manifests a shield of spiritual energy around their allies.",
    "type": "Revenant Discipline",
    "description": "Shield of Ynnead has a warp charge value of 7. If manifested, until the start of your next Psychic phase, friendly YNNARI units have a 5+ invulnerable save whilst they are within 6\" of this psyker.",
    "id": "000003516006"
  },
  {
    "roll": "6",
    "name": "ANCESTOR’S GRACE",
    "faction_id": "YNN",
    "faction_name": "Ynnari",
    "legend": "Drawing upon the greatness that is the genetic legacy of all Aeldari, the psyker bolsters their fellows.",
    "type": "Revenant Discipline",
    "description": "Ancestor’s Grace has a warp charge value of 5. If manifested, select one friendly YNNARI unit within 18\" of this psyker. Until the start of your next Psychic phase, when resolving an attack made by a model in that unit, re-roll a hit roll of 1.",
    "id": "000003516007"
  },
  {
    "roll": "1",
    "name": "MIND WORM",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The Librarian burrows his consciousness into the screaming victim’s brain, ripping free their secrets in a spray of gore.",
    "type": "Interromancy Discipline",
    "description": "Malediction: Mind Worm has a warp charge value of 6. If manifested, select one enemy unit within 18\" of this PSYKER.That unit suffers 1 mortal wound.Until the start of your next Psychic phase, in the Fight phase, that unit is not eligible to fight until all other eligible units from your army have done so.",
    "id": "000005272002"
  },
  {
    "roll": "2",
    "name": "AVERSION",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The Librarian sends waves of cold fear washing outwards. The foe find themselves unable to focus upon the psyker, their subconscious screaming at them to look away for fear of what they will see.",
    "type": "Interromancy Discipline",
    "description": "Malediction: Aversion has a warp charge value of 6. If manifested, select one enemy unit within 24\" of this PSYKER. Until the start of your next Psychic phase:While that unit is within 6\" of this PSYKER, subtract 1 from the Attacks characteristic of models in that unit.Each time a model in that unit makes an attack, subtract 1 from that attacks hit roll.",
    "id": "000005272003"
  },
  {
    "roll": "3",
    "name": "RIGHTEOUS REPUGNANCE",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "Reaching into the minds of his brothers, the Librarian stokes the fires of their hate, and the Dark Angels respond with a surge of cold, furious violence.",
    "type": "Interromancy Discipline",
    "description": "Blessing: Righteous Repugnance has a warp charge value of 7. If manifested, select one friendly DARK ANGELS unit within 12\" of this PSYKER. Until the start of your next Psychic phase, each time a model in that unit makes a melee attack, you can re-roll the hit roll and you can re-roll the wound roll.",
    "id": "000005272004"
  },
  {
    "roll": "4",
    "name": "TREPHINATION",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The Librarian gathers his thoughts into a white-hot spike to plunge straight into his victim’s mind, leaving the foe’s brain matter dribbling from their ears.",
    "type": "Interromancy Discipline",
    "description": "Witchfire: Trephination has a warp charge value of 5. If manifested, the closest enemy unit within 18\" of and visible to this PSYKER suffers D3 mortal wounds. If the result of the Psychic test was greater than the Leadership characteristic of the enemy unit, that enemy unit suffers 3 mortal wounds instead.",
    "id": "000005272005"
  },
  {
    "roll": "5",
    "name": "ENGULFING FEAR",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The Librarian inveigles his way into the minds of his foes. Subtly, he twists and heightens their fears.",
    "type": "Interromancy Discipline",
    "description": "Malediction: Engulfing Fear has a warp charge value of 7. If manifested, select one enemy unit within 24\" of this PSYKER. Until the start of your next psychic phase:Subtract 1 from Leadership characteristic of models in that unit.That unit cannot use the Objective Secured ability or any similar abilities that allow them to control an objective marker regardless of the number of enemy models within range of an objective marker.If the result of the Psychic test was equal to or greater than that units Leadership characteristic, that unit cannot perform actions (if that unit is currently performing an action, it immediately fails).",
    "id": "000005272006"
  },
  {
    "roll": "6",
    "name": "MIND WIPE",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The Librarian scourges the minds of his foes, dragging out every memory that makes them who they are and reducing them to hollow shells of what they once were.",
    "type": "Interromancy Discipline",
    "description": "Malediction: Mind Wipe has a warp charge value of 7. If manifested, select one enemy unit within 18\" of this PSYKER, then select one aura ability that unit has. Until the start of your next psychic phase, that unit loses that aura ability.",
    "id": "000005272007"
  },
  {
    "roll": "1",
    "name": "QUICKENING",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The Librarian channels his psychic might, and the deadly powers of the immaterium flow through him, raising his speed to deadly heights.",
    "type": "Sanguinary Discipline",
    "description": "Blessing: Quickening has a warp charge value of 6. If manifested, until the start of your next Psychic phase:You can re-roll Advance and charge rolls made for this PSYKER.Add D3 to this PSYKER’s Attacks characteristic.",
    "id": "000005323002"
  },
  {
    "roll": "2",
    "name": "UNLEASH RAGE",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The Librarian reaches into the minds of his fellows and stokes the fires of anger lurking in their psyches, pushing them into a frenzied rage.",
    "type": "Sanguinary Discipline",
    "description": "Blessing: Unleash Rage has a warp charge value of 6. If manifested, select one friendly BLOOD ANGELS CORE unit within 12\" of this PSYKER. Until the start of your next Psychic phase, each time a model in that unit makes a melee attack, an unmodified hit roll of 6 scores 1 additional hit.",
    "id": "000005323003"
  },
  {
    "roll": "3",
    "name": "SHIELD OF SANGUINIUS",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The Librarian wills a shimmering golden barrier into existence, shielding his brothers from harm.",
    "type": "Sanguinary Discipline",
    "description": "Blessing: Shield of Sanguinius has a warp charge value of 6. If manifested, select one friendly BLOOD ANGELS unit within 18\" of this PSYKER. Until the start of your next Psychic phase, models in that unit have a 5+ invulnerable save.",
    "id": "000005323004"
  },
  {
    "roll": "4",
    "name": "BLOOD BOIL",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The Librarian drives his enemy’s lifeblood into a seething frenzy, causing it to boil in the victims veins a split second before bursting from every pore with explosive finality.",
    "type": "Sanguinary Discipline",
    "description": "Witchfire: Blood Boil has a warp charge value of 6. If manifested, select one enemy unit that is within 18\" of and visible to this PSYKER and roll 2D6:If the total is more than the highest Toughness characteristic of models in that unit, it suffers D3 mortal wounds.If the total is more than double the highest Toughness characteristic of models in that unit, it suffers 3 mortal wounds instead.",
    "id": "000005323005"
  },
  {
    "roll": "5",
    "name": "BLOOD LANCE",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The Librarian conjures a mighty lance, infused with his innermost rage. Hefting this empyric projectile, the Librarian hurls it with all of his psychokinetic might, sending it hurtling through the enemy ranks to maim and impale.",
    "type": "Sanguinary Discipline",
    "description": "Witchfire: Blood Lance has a warp charge value of 6. If manifested, select one enemy model that is within 18\" of and visible to this PSYKER. Draw the shortest possible line between this PSYKER’s base and the selected enemy model’s base (or hull), then roll one D6 for each model the centre of the line passes over: on a 5+, that model’s unit suffers 1 mortal wound.",
    "id": "000005323006"
  },
  {
    "roll": "6",
    "name": "WINGS OF SANGUINIUS",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "Blood-red wings of psychic energy spring from the back of the Librarian, allowing him to soar across the battlefield like an avenging angel.",
    "type": "Sanguinary Discipline",
    "description": "Blessing: Wings of Sanguinius has a warp charge value of 6. If manifested, this PSYKER can make a Normal Move or Fall Back as if it were your Movement phase. In addition, until the end of the phase, this PSYKER has a Move characteristic of 12\" and the FLY keyword.",
    "id": "000005323007"
  },
  {
    "roll": "1",
    "name": "GIFT OF INFECTION",
    "faction_id": "DG",
    "faction_name": "Death Guard",
    "legend": "The Insidious Blight is one of Nurgle’s favoured gifts, and with a deep exhalation of warp-tainted breath this selfless psyker bestows such a boon on those who would try to deny such a blessing by keeping their distance.",
    "type": "Army of Renown: Terminus Est Assault Force",
    "description": "Malediction: Gift of Infection has a warp charge value of 7. If manifested, select one enemy unit within 18\" of this PSYKER. Until the start of your next Psychic phase, subtract 1 from the Toughness characteristic of models in that unit (this is not cumulative with any Toughness penalties incurred from any Contagion of Nurgle abilities).",
    "id": "000005449002"
  },
  {
    "roll": "2",
    "name": "LUNGROT",
    "faction_id": "DG",
    "faction_name": "Death Guard",
    "legend": "The psykers daubs his helmet with a warp rune and immediately expels a deep, hacking cough. As he does, his foes are wracked by a paroxysm, causing them to stumble and double over while their lungs rapidly rot.",
    "type": "Army of Renown: Terminus Est Assault Force",
    "description": "Malediction: Lungrot has a warp charge value of 7. If manifested, select one enemy unit within 18\" of this PSYKER. Until the start of your next Psychic phase:That unit cannot Advance.Each time that unit is selected to charge, only eligible units within 6\" can be selected as the target of its charge.Each time a charge roll is made for that unit, it cannot be re-rolled.",
    "id": "000005449003"
  },
  {
    "roll": "3",
    "name": "PERNICIOUS DOSE",
    "faction_id": "DG",
    "faction_name": "Death Guard",
    "legend": "Reciting the forty-nine contagions of Rottigor’s opus, the psyker can infuse the plagues coating his allies weapons with greater potency and fresh new maladies.",
    "type": "Army of Renown: Terminus Est Assault Force",
    "description": "Blessing: Pernicious Dose has a warp charge value of 7. If manifested, select one friendly unit within 6\" of this PSYKER. Until the start of your next Psychic phase, each time a model in that unit makes an attack with a plague weapon, you can re-roll the hit roll.",
    "id": "000005449004"
  },
  {
    "roll": "4",
    "name": "NOXIOUS DISCHARGE",
    "faction_id": "DG",
    "faction_name": "Death Guard",
    "legend": "The psyker conjures a broiling gobbet of ectoplasmic disease in his palm before hurling it at his foes, infecting all caught in the splash and rotting their very souls.",
    "type": "Army of Renown: Terminus Est Assault Force",
    "description": "Witchfire: Noxious Discharge has a warp charge value of 6. If manifested, select one enemy unit that is within 12\" of and visible to this PSYKER:That unit suffers 1 mortal woundAll units within 3\" of that unit suffer 1 mortal wound (excluding NURGLE units).",
    "id": "000005449005"
  },
  {
    "roll": "5",
    "name": "ROTWIND",
    "faction_id": "DG",
    "faction_name": "Death Guard",
    "legend": "The psyker summons a foetid wind from the Garden of Nurgle itself - a gale of ages that blasts across the battlefield and buffets his foes, rusting their weapons, corroding ammunition casings and dulling the edges of cutting blades.",
    "type": "Army of Renown: Terminus Est Assault Force",
    "description": "Malediction: Rotwind has a warp charge value of 7. If manifested, select one enemy unit within 18\" of this PSYKER. Until the start of your next Psychic phase, each time a model in that unit makes an attack, reduce the Armour Penetration characteristic of that attack by 2 (to a minimum of AP 0).",
    "id": "000005449006"
  },
  {
    "roll": "6",
    "name": "ACCELERATED ENTROPY",
    "faction_id": "DG",
    "faction_name": "Death Guard",
    "legend": "The psyker draws in a deep breath of warp power before locking eyes with his victim. As he exhales, his victim ages decades, then centuries.",
    "type": "Army of Renown: Terminus Est Assault Force",
    "description": "Witchfire: Accelerated Entropy has a warp charge value of 7. If manifested, select one enemy model within 12\" of and visible to this PSYKER. Both players then roll one D6 and add their model’s Toughness characteristic. If your result is higher than your opponent’s, that enemy model’s unit suffers 3 mortal wounds. If your result is double your opponent’s, or more than double your opponent’s, that enemy model’s unit suffers D3+3 mortal wounds instead.",
    "id": "000005449007"
  },
  {
    "roll": "1",
    "name": "FATEFUL DIVERGENCE",
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "legend": "Exerting their will upon destiny, the psyker shifts the paths of fate to aid the fortunes of their people.",
    "type": "Psychic Disciplines",
    "description": "Blessing: Fateful Divergence has a warp charge value of 6. If manifested, you gain 1 Command point.",
    "id": "000003725002"
  },
  {
    "roll": "2",
    "name": "WITCH STRIKE",
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "legend": "Focusing a still greater portion of their power into their weapon, each strike from the psyker blasts foes with potent aetheric energies.",
    "type": "Psychic Disciplines",
    "description": "Blessing: Witch Strike has a warp charge value of 5. If manifested, select one model in this PSYKER unit (if this PSYKER unit is an ANHRATHE unit, you must select its Way Seeker model). Until the start of your next Psychic phase, each time the selected model makes a melee attack, if that attack successfully wounds the target, it inflicts 1 mortal wound on the target and the attack sequence ends.",
    "id": "000003725003"
  },
  {
    "roll": "3",
    "name": "GHOSTWALK",
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "legend": "Channelling energies from their runic armour, the psyker imbues their allies with ethereal speed.",
    "type": "Psychic Disciplines",
    "description": "Blessing: Ghostwalk has a warp charge value of 5. If manifested, select one friendly &lt;CRAFTWORLD&gt; ASURYANI CORE or &lt;CRAFTWORLD&gt; ASURYANI CHARACTER unit within 12\" of this PSYKER. Until the start of your next Psychic phase, add 2 to charge rolls made for that unit.",
    "id": "000003725004"
  },
  {
    "roll": "4",
    "name": "CRUSHING ORB",
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "legend": "The psyker captures their foe in a sphere of kinetic energy, then crushes it inwards with a gesture.",
    "type": "Psychic Disciplines",
    "description": "Witchfire: Crushing Orb has a warp charge value of 6. If manifested, select one enemy unit within 18\" of and visible to this PSYKER and roll three D6, adding 2 to each result if that enemy unit is a VEHICLE or MONSTER unit, or it contains 6 or more models. For each 4+, that enemy unit suffers 1 mortal wound.",
    "id": "000003725005"
  },
  {
    "roll": "5",
    "name": "FOCUS WILL",
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "legend": "The psyker channels their mind to aid a fellow seer in wielding their mental might and resisting the efforts of enemy sorcerers.",
    "type": "Psychic Disciplines",
    "description": "Blessing: Focus Will has a warp charge value of 6. If manifested, select one friendly &lt;CRAFTWORLD&gt; ASURYANI PSYKER unit within 24\" of this PSYKER. Until the start of your next Psychic phase, add 2 to Psychic tests and Deny the Witch tests taken for that unit.",
    "id": "000003725006"
  },
  {
    "roll": "6",
    "name": "IMPAIR SENSES",
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "legend": "The psyker dims the foes senses, dazzling their minds with strange images and patterns.",
    "type": "Psychic Disciplines",
    "description": "Malediction: Impair Senses has a warp charge value of 6. If manifested, select one enemy unit within 18\" of and visible to this PSYKER. Until the start of your next Psychic phase, that enemy unit cannot be affected by the aura abilities of units from your opponent’s army.",
    "id": "000003725007"
  },
  {
    "roll": "1",
    "name": "VEIL OF TIME",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The psyker projects his will beyond the regular passage of time, altering the temporal flow to sway the tide of battle.",
    "type": "Librarius Discipline",
    "description": "Blessing: Veil of Time has a warp charge value of 6. If manifested, select one friendly &lt;CHAPTER&gt; unit within 18\" of this PSYKER.Until the start of your next Psychic phase, you can re-roll Advance rolls and charge rolls made for that unit.Until the start of your next Psychic phase, if that unit starts the Fight phase within Engagement Range of an enemy unit, it fights first that phase.",
    "id": "000002682002"
  },
  {
    "roll": "2",
    "name": "MIGHT OF HEROES",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The psyker cages the immense power of the immaterium within the physical form of one of his brothers, making the blessed warrior the Emperor’s vengeance made manifest.",
    "type": "Librarius Discipline",
    "description": "Blessing: Might of Heroes has a warp charge value of 6. If manifested, select one friendly &lt;CHAPTER&gt; CORE or &lt;CHAPTER&gt; CHARACTER model within 12\" of this PSYKER. Until the start of your next Psychic phase, add 1 to that models Strength, Toughness and Attacks characteristics (if a unit has more than one Toughness characteristic, use the lowest Toughness characteristic in that unit when resolving any rules).",
    "id": "000002682003"
  },
  {
    "roll": "3",
    "name": "NULL ZONE",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The psyker unleashes the full might of his mind to cast down his opponents defences, both technological and mystical, rendering them vulnerable to the retribution of the Adeptus Astartes.",
    "type": "Librarius Discipline",
    "description": "Blessing (Aura): Null Zone has a warp charge value of 7. If manifested, then:Until the start of your next Psychic phase, while a unit is within 6” of this PSYKER, each time an attack is made against that unit, invulnerable saving throws cannot be made against that attack.Until the start of your next Psychic phase, while an enemy PSYKER unit is within 6\" of this PSYKER, halve the total of Psychic tests taken for that unit.",
    "id": "000002682004"
  },
  {
    "roll": "4",
    "name": "PSYCHIC SCOURGE",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The psyker pits his superhuman willpower against that of his enemies in a battle of mental fortitude, seeking to destroy their minds in a burst of psychic fury.",
    "type": "Librarius Discipline",
    "description": "Witchfire: Psychic Scourge has a warp charge value of 6. If manifested, select one enemy unit within 18\" of and visible to this PSYKER. Then, roll one D6 and add this PSYKER’s Leadership characteristic to the result. Your opponent then rolls one D6 and adds that unit’s Leadership characteristic to the result. If your total is higher than your opponents, the selected unit suffers D3 mortal wounds; if it is equal to your opponents total, the selected unit suffers 1 mortal wound; if it is less than your opponent’s total, nothing happens.",
    "id": "000002682005"
  },
  {
    "roll": "5",
    "name": "FURY OF THE ANCIENTS",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "Calling upon the myths of his Chapters home world, the psyker sends forth a terrifying monstrosity wrought from psychic energy.",
    "type": "Librarius Discipline",
    "description": "Witchfire: Fury of the Ancients has a warp charge value of 6. If manifested, select one enemy model that is within 18\" of and visible to this PSYKER. Draw a line between any part this PSYKER’s base and any part of the selected model’s base (or hull); the selected models unit, and every other enemy unit that this line passes over or through, suffers 1 mortal wound.",
    "id": "000002682006"
  },
  {
    "roll": "6",
    "name": "PSYCHIC FORTRESS",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "Drawing on boundless reserves of inner strength, the psyker constructs a powerful field of shimmering psychic energy around himself as well as any nearby battle brothers, protecting them from harm.",
    "type": "Librarius Discipline",
    "description": "Blessing (Aura): Psychic Fortress has a warp charge value of 6. If manifested, then until the start of your next Psychic phase, while a friendly &lt;CHAPTER&gt; unit is within 6\" of this PSYKER, models in that unit have a 5+ invulnerable save.",
    "id": "000002682007"
  },
  {
    "roll": "1",
    "name": "TWILIGHT PATHWAYS",
    "faction_id": "HAR",
    "faction_name": "Harlequins",
    "legend": "Eerie half-lit tunnels blink into existence, opening new paths of manoeuvre and attack.",
    "type": "Phantasmancy Discipline",
    "description": "Twilight Pathways has a warp charge value of 6. If manifested, select a friendly HARLEQUINS unit within 3\" of the psyker and visible to it. That unit can immediately move as if it were its Movement phase. You cannot use Twilight Pathways on a unit more than once in each Psychic phase.",
    "id": "000002797002"
  },
  {
    "roll": "2",
    "name": "FOG OF DREAMS",
    "faction_id": "HAR",
    "faction_name": "Harlequins",
    "legend": "The Shadowseer sends forth her consciousness like a creeping mist, baffling the senses of the enemy.",
    "type": "Phantasmancy Discipline",
    "description": "Fog of Dreams has a warp charge value of 6. If manifested, select an enemy unit within 18\" of the psyker and visible to it. Until the start of your next Psychic phase, your opponent must subtract 1 from hit rolls for that unit that target HARLEQUINS INFANTRY units.",
    "id": "000002797003"
  },
  {
    "roll": "3",
    "name": "MIRROR OF MINDS",
    "faction_id": "HAR",
    "faction_name": "Harlequins",
    "legend": "A maddening clash of wills consumes the victim’s mind as reality falls away.",
    "type": "Phantasmancy Discipline",
    "description": "Mirror of Minds has a warp charge value of 7. If manifested, select an enemy unit within 24\" of the psyker. Then, both players roll a D6. If the Harlequin player’s roll is equal to or higher than their opponent’s, then the target unit suffers 1 mortal wound. Repeat this process until the target is destroyed, or the enemy player rolls a result that is higher than the Harlequin player’s roll.",
    "id": "000002797004"
  },
  {
    "roll": "4",
    "name": "VEIL OF TEARS",
    "faction_id": "HAR",
    "faction_name": "Harlequins",
    "legend": "Sketching a gesture in the air, the Shadowseer snatches the image of the Harlequins from the minds of their foes, hiding them from sight.",
    "type": "Phantasmancy Discipline",
    "description": "Veil of Tears has a warp charge value of 7. If manifested, select a friendly HARLEQUINS INFANTRY unit within 18\" of the psyker. Until the start of your next Psychic phase, subtract 1 from hit rolls for attacks made against that unit.",
    "id": "000002797005"
  },
  {
    "roll": "5",
    "name": "SHARDS OF LIGHT",
    "faction_id": "HAR",
    "faction_name": "Harlequins",
    "legend": "Blades of polychrome energy dazzle the foe, inflicting horrific and disorientating psychosomatic wounds.",
    "type": "Phantasmancy Discipline",
    "description": "Shards of Light has a warp charge value of 7. If manifested, select an enemy unit within 18\" of the psyker and visible to it. That unit suffers D3 mortal wounds and must subtract 1 from its Leadership characteristic until the start of your next Psychic phase.",
    "id": "000002797006"
  },
  {
    "roll": "6",
    "name": "WEBWAY DANCE",
    "faction_id": "HAR",
    "faction_name": "Harlequins",
    "legend": "The veils between realspace and the webway grow thin, allowing the Harlequins to jink away from danger with quicksilver speed, only to reappear unharmed moments later.",
    "type": "Phantasmancy Discipline",
    "description": "Webway Dance has a warp charge value of 7. If manifested, then until the start of your next Psychic phase, roll a D6 whenever a friendly HARLEQUINS unit within 6\" of the psyker loses a wound; on a 6 that wound is not lost.",
    "id": "000002797007"
  },
  {
    "roll": "1",
    "name": "LIVING LIGHTNING",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "Sentient electricity crackles amid the brooding skies above as the Rune Priest calls forth the elements to smite his foes. At the psykers command, lightning arcs into the ranks of the enemy, leaving a trail of blackened corpses in its wake.",
    "type": "Tempestas Discipline",
    "description": "Witchfire: Living Lightning has a warp charge value of 6. If manifested, the closest enemy unit within 18\" of and visible to this PSYKER suffers D3 mortal wounds. Then roll one D6: on a 2-4, the closest other enemy unit within 6\" of and visible to that unit suffers 1 mortal wound; on a 5+, it suffers D3 mortal wounds.",
    "id": "000005222002"
  },
  {
    "roll": "2",
    "name": "MURDEROUS HURRICANE",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The Rune Priest bellows an ancient curse, and within moments his foes are all but consumed in a hurricane of freezing shards, a thousand blades of psychically formed ice plunging into their flesh.",
    "type": "Tempestas Discipline",
    "description": "Malediction: Murderous Hurricane has a warp charge value of 6. If manifested, select one enemy unit within 18\" of this PSYKER. Until the start of your next Psychic phase:If that unit is not wholly on or within a terrain feature, that unit cannot fire Overwatch.In the Fight phase, that unit is not eligible to fight until after all eligible SPACE WOLVES units from your army have done so.",
    "id": "000005222003"
  },
  {
    "roll": "3",
    "name": "TEMPEST’S WRATH",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The Rune Priest brings the rage of the storm to a roaring crescendo, frost-fingered wind spirits whipping at his enemies, tearing at their eyes and snatching weapons from their hands.",
    "type": "Tempestas Discipline",
    "description": "Malediction: Tempest’s Wrath has a warp charge value of 6. If manifested, select one enemy unit within 24\" of this PSYKER. Until the start of your next Psychic phase, each time a model in that unit makes an attack, subtract 1 from that attacks hit roll.",
    "id": "000005222004"
  },
  {
    "roll": "4",
    "name": "INSTINCTS AWOKEN",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "Maintaining the balance between the controlled aggression of his brothers and the roaring beast at their hearts, the Rune Priest awakens the savage spirit within them.",
    "type": "Tempestas Discipline",
    "description": "Blessing: Instincts Awoken has a warp charge value of 6. If manifested, select one friendly SPACE WOLVES unit within 18\" of this PSYKER. Until the start of your next Psychic phase, each time a model in that unit makes an attack, the Assault Doctrine is considered to be active for that attack instead of the currently active doctrine. If the Assault Doctrine is already active for your army, then on an unmodified wound roll of 6 improve the Armour Penetration characteristic of that attack by 1. This is cumulative with the bonus from the Assault doctrine.",
    "id": "000005222005"
  },
  {
    "roll": "5",
    "name": "STORM CALLER",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The Rune Priest chants an ancient rite that builds into a terrifying howl. Roaring winds and furious blizzards rage about him in a vortex of ice and snow that obscures him from sight.",
    "type": "Tempestas Discipline",
    "description": "Blessing (Aura): Storm Caller has a warp charge value of 6. If manifested, until the start of your next Psychic phase, while their unit is within 6\" of this PSYKER, friendly SPACE WOLVES models receive the benefits of light cover.",
    "id": "000005222006"
  },
  {
    "roll": "6",
    "name": "JAWS OF THE WORLD WOLF",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The Rune Priest implores the spirit of the world upon which he hunts to open its rock-fanged maw, and a chasm cracks open under the feet of his chosen enemy, sending them tumbling to their death below.",
    "type": "Tempestas Discipline",
    "description": "Witchfire: Jaws of the World Wolf has a warp charge value of 7. If manifested, select one enemy unit within 18\" of and visible to this PSYKER. Roll one D6 for each model in that unit, adding 1 to the result if the result of the Psychic test was 9 or more. For each roll of a 6+, that unit suffers 1 mortal wound.",
    "id": "000005222007"
  },
  {
    "roll": "1",
    "name": "Infernal Gaze",
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "legend": "Unholy power streams from the psyker’s eyes, charring and melting everything caught in its path.",
    "type": "Dark Hereticus Discipline",
    "description": "Infernal Gaze has a warp charge value of 5. If manifested, select a visible enemy unit within 18\" of the psyker and roll 3 dice. The target suffers 1 mortal wound for each roll of 4+.",
    "id": "000002240002"
  },
  {
    "roll": "2",
    "name": "Death Hex",
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "legend": "The Sorcerer places a dire hex upon his enemies. Wards and energised shields flicker and fail, leaving the foe exposed.",
    "type": "Dark Hereticus Discipline",
    "description": "Death Hex has a warp charge value of 8. If manifested, select a visible enemy unit within 12\" of the psyker. Until the start of your next Psychic phase, that unit cannot take invulnerable saves.",
    "id": "000002240003"
  },
  {
    "roll": "3",
    "name": "Gift of Chaos",
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "legend": "As the power of the warp surges through the psyker’s victim, bones snap and flesh rips as a new form takes shape.",
    "type": "Dark Hereticus Discipline",
    "description": "Gift of Chaos has a warp charge of 6. If manifested, select an enemy unit that is within 6\" of the psyker and visible to him and roll a D6. If the result is greater than the target’s Toughness, it suffers D3+3 mortal wounds. If a CHARACTER is destroyed by this power, you can add a Chaos Spawn to your army within 6\" of the character and not within Engagement Range of any enemy units before they are removed as a casualty.",
    "id": "000002240004"
  },
  {
    "roll": "4",
    "name": "Prescience",
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "legend": "By focusing his warp-sight the psyker can guide the aim of his allies, bringing a swift and merciless death to their foes.",
    "type": "Dark Hereticus Discipline",
    "description": "Prescience has a warp charge value of 7. If manifested, select a &LT;LEGION&GT; unit within 18\" of the psyker. You can add 1 to all hit rolls made for that unit until the start of your next Psychic phase.",
    "id": "000002240005"
  },
  {
    "roll": "5",
    "name": "Diabolic Strength",
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "legend": "The unholy energies of Chaos course through the recipient, swelling his frame with the strength to tear a tank in two.",
    "type": "Dark Hereticus Discipline",
    "description": "Diabolic Strength has a warp charge value of 6. If manifested, select a &LT;LEGION&GT; model within 12\" of the psyker. Until the start of your next Psychic phase, add 2 to that model’s Strength characteristic and 1 to its Attacks characteristic.",
    "id": "000002240006"
  },
  {
    "roll": "6",
    "name": "Warptime",
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "legend": "The power of the immaterium bursts from the psyker, warping time and heightening the speed of his allies.",
    "type": "Dark Hereticus Discipline",
    "description": "Warptime has a warp charge value of 6. If manifested, pick a &LT;LEGION&GT; unit (excluding AIRCRAFT) within 3\" of the psyker. That unit can immediately move as if it were its Movement phase. You cannot use Warptime on a unit more than once per Psychic phase.",
    "id": "000002240007"
  },
  {
    "roll": "",
    "name": "C’TAN SHARD OF THE DECEIVER - COSMIC INSANITY",
    "faction_id": "NEC",
    "faction_name": "Necrons",
    "legend": "The Ctan Shard of the Deceiver uses it powers to flood his victims' minds with vast and terrible cosmic truths, overwhelming even the most ironclad minds and driving them instantly and irrevocably insane.",
    "type": "Powers of the C’tan",
    "description": "Select one enemy unit within 12\" of and visible to this CTAN SHARD. Roll one D6 and add this C'TAN SHARD's Leadership characteristic to the result. Your opponent then rolls one D6 and adds the Leadership characteristic of the selected unit to the result. That enemy unit suffers 1 mortal wound for each point by which your total exceeds your opponent's.",
    "id": "000004703002"
  },
  {
    "roll": "",
    "name": "C’TAN SHARD OF THE NIGHTBRINGER - GAZE OF DEATH",
    "faction_id": "NEC",
    "faction_name": "Necrons",
    "legend": "Dark energies leap from the Shards eyes and its distended maw, reducing foes to blackened bones crawling with frost.",
    "type": "Powers of the C’tan",
    "description": "Select one enemy unit within 9\" of and visible to this CTAN SHARD. Roll three D6s: for each 4+, that unit suffers D3 mortal wounds.",
    "id": "000004703003"
  },
  {
    "roll": "",
    "name": "C’TAN SHARD OF THE VOID DRAGON - VOLTAIC STORM",
    "faction_id": "NEC",
    "faction_name": "Necrons",
    "legend": "When this Ctan points one imperious hand, foes reel as the air sings with a monstrous whine. The awful sound builds, then erupts into a sudden and ferocious storm of emerald lightning to annihilate all it touches.",
    "type": "Powers of the C’tan",
    "description": "Select one enemy unit within 18\" of and visible to this Ctan Shard (an enemy CHARACTER unit with a Wounds characteristic of 9 or less cannot be selected for this power while it is within 3\" of another enemy unit, unless that CHARACTER unit is the closest visible enemy unit). Roll one D6: on a 2+, that unit suffers D3 mortal wounds (it suffers D6 mortal wounds instead if it has the VEHICLE keyword) and, until the start of your next turn, if that unit is a VEHICLE whose characteristics change as it loses wounds, then it halves the number of wounds it has remaining when determining what characteristics to use.",
    "id": "000004703004"
  },
  {
    "roll": "1",
    "name": "PREMORPHIC RESONANCE",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The psyker peers into the timeless eddies of the warp, seeing future echoes of whatever sinuous, scuttling or bounding movements the enemy will make before imprinting this foreknowledge into the minds of his brothers to guide their aim.",
    "type": "Xenopurge Discipline",
    "description": "Blessing: Premorphic Resonance has a warp charge value of 6. If manifested, select one friendly DEATHWATCH unit within 18\" of this PSYKER. Until the start of your next Psychic phase:Any Overwatch attacks made by that unit score hits on rolls of 5+.If that unit starts the Fight phase within Engagement Range of any enemy models, it can fight first that phase.Each time a melee attack is made by a model in that unit, add 1 to that attacks hit roll.",
    "id": "000004851002"
  },
  {
    "roll": "2",
    "name": "FORTIFIED WITH CONTEMPT",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "Fanning the fires of the Deathwatchs hatred into an inferno of contempt, the psyker instils a feeling of such vehement disgust in his brothers that they shrug off the direst of injuries in their determination to exact their vigil’s vow.",
    "type": "Xenopurge Discipline",
    "description": "Blessing: Fortified With Contempt has a warp charge value of 6. If manifested, select one friendly DEATHWATCH INFANTRY or DEATHWATCH BIKER unit within 18\" of this PSYKER. Until the start of your next Psychic phase, each time a model in that unit would lose a wound, roll one D6: on a 5+, that wound is not lost.",
    "id": "000004851003"
  },
  {
    "roll": "3",
    "name": "NEURAL VOID",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The psyker assails the target with a voidblack darkness upon their minds, woven from psychomantic shadow. Mental cohesion and coordination begin to break down, orders become garbled and impetus blunted.",
    "type": "Xenopurge Discipline",
    "description": "Malediction: Neural Void has a warp charge value of 7. If manifested, select one enemy unit within 18\" of this PSYKER. Until the start of your next Psychic phase:Subtract 1 from the Attacks characteristic of models in that unit.Each time a charge is declared for that unit, only the closest unit from your army can be selected as the target of that charge.",
    "id": "000004851004"
  },
  {
    "roll": "4",
    "name": "PSYCHIC CLEANSE",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "Before the empyric might of the psyker, teeming throngs of lesser minds are swept aside in a purgation that purifies the unclean.",
    "type": "Xenopurge Discipline",
    "description": "Witchfire: Psychic Cleanse has a warp charge value of 6. If manifested, roll one D6 for each enemy model within 9\" of this PSYKER: on a 6, that model’s unit suffers 1 mortal wound.",
    "id": "000004851005"
  },
  {
    "roll": "5",
    "name": "MANTLE OF SHADOW",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The psyker draws a shadow over his allies, shrouding their presence from enemy senses and assuring the completion of priority missions without detection.",
    "type": "Xenopurge Discipline",
    "description": "Blessing: Mantle of Shadow has a warp charge value of 6. If manifested, select one friendly DEATHWATCH INFANTRY unit within 12\" of this Psyker. Until the start of your next Psychic phase, if that unit does not shoot or declare a charge, enemy models cannot target that unit with ranged attacks unless they are within 12\" of it or it is the closest eligible unit.",
    "id": "000004851006"
  },
  {
    "roll": "6",
    "name": "SEVERANCE",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The psyker has trained his powerful mind to single out entities from which his foes gain their strength, snipping their influence with his razored thoughts. In an instant, commanding screeches fade to whimpers, inspiring presences falter and communications vomit babbling nonsense.",
    "type": "Xenopurge Discipline",
    "description": "Malediction: Severance has a warp charge value of 7. If manifested, select one enemy CHARACTER unit within 18\" of this PSYKER.That unit suffers 1 mortal wound.Until the start of your next Psychic phase, reduce the range of that units aura abilities by 3\" (if the result of the Psychic test was greater than that Character unit’s Leadership characteristic, then until the start of your next Psychic phase, enemy units cannot benefit from that unit’s aura abilities).",
    "id": "000004851007"
  },
  {
    "roll": "1",
    "name": "TERRIFYING VISIONS",
    "faction_id": "AM",
    "faction_name": "Astra Militarum",
    "legend": "The psyker fills his enemies’ minds with nightmarish images and visions of torment, seeking to send them fleeing in terror.",
    "type": "Psykana Discipline",
    "description": "Terrifying Visions has a warp charge value of 7. If manifested, choose an enemy unit within 18\" of the psyker. That unit subtracts 2 from its Leadership until the start of your next turn.",
    "id": "000002384002"
  },
  {
    "roll": "2",
    "name": "GAZE OF THE EMPEROR",
    "faction_id": "AM",
    "faction_name": "Astra Militarum",
    "legend": "The psyker cages the immense power of the immaterium within his physical form, and his eyes blaze with the Emperor’s vengeful fury.",
    "type": "Psykana Discipline",
    "description": "Gaze of the Emperor has a warp charge value of 6. If manifested, draw a straight line 2D6\" long directly away from the psyker. Roll a dice for each model the centre of the line passes over. On a 4+ that model’s unit suffers a mortal wound.",
    "id": "000002384003"
  },
  {
    "roll": "3",
    "name": "PSYCHIC BARRIER",
    "faction_id": "AM",
    "faction_name": "Astra Militarum",
    "legend": "The psyker weaves an aegis of pure psychic energy around his allies, against which enemy fire sparks and spatters harmlessly.",
    "type": "Psykana Discipline",
    "description": "Psychic Barrier has a warp charge value of 6. If manifested, select a friendly ASTRA MILITARUM unit within 12\" of the psyker. Until the start of your next Psychic phase, add 1 to that unit’s saving throws.",
    "id": "000002384004"
  },
  {
    "roll": "4",
    "name": "NIGHTSHROUD",
    "faction_id": "AM",
    "faction_name": "Astra Militarum",
    "legend": "Calling upon the power of the empyrean, the psyker cloaks his allies in a flowing curtain of shadow, concealing them from the enemy.",
    "type": "Psykana Discipline",
    "description": "Nightshroud has a warp charge value of 6. If manifested, choose a friendly ASTRA MILITARUM unit within 12\" of the psyker. Until the start of your next turn, any enemy unit that targets the chosen unit with a ranged weapon suffers a -1 penalty to its hit rolls.",
    "id": "000002384005"
  },
  {
    "roll": "5",
    "name": "MENTAL FORTITUDE",
    "faction_id": "AM",
    "faction_name": "Astra Militarum",
    "legend": "Drawing on boundless reserves of inner strength, the psyker shields his allies’ minds from mortal fears and the threat of sorcerous assault.",
    "type": "Psykana Discipline",
    "description": "Mental Fortitude has a warp charge value of 4. If manifested, select a friendly ASTRA MILITARUM unit within 12\" of the psyker. Until the start of your next Psychic phase, that unit automatically passes Morale tests.",
    "id": "000002384006"
  },
  {
    "roll": "6",
    "name": "PSYCHIC MAELSTROM",
    "faction_id": "AM",
    "faction_name": "Astra Militarum",
    "legend": "The psyker unleashes the full might of his mind, summoning a roiling psychic tempest that envelops his enemy, lifting them from the ground and wrenching them about like a rag doll.",
    "type": "Psykana Discipline",
    "description": "Psychic Maelstrom has a warp charge value of 7. If manifested, select an enemy unit within 18\" of the psyker. Roll a D6. On a 2+, that unit suffers a mortal wound. Unless this mortal wound is negated, you can then roll another dice. On a 3+ that enemy unit suffers another mortal wound. Continue this process, adding 1 to the dice roll required each time (so the next roll would need 4+, then 5+, etc.) until you fail to cause a mortal wound, or the enemy unit is destroyed.",
    "id": "000002384007"
  },
  {
    "roll": "1",
    "name": "TWILIGHT PATHWAYS",
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "legend": "Eerie half-lit tunnels blink into existence, opening new paths of manoeuvre and attack.",
    "type": "Psychic Disciplines",
    "description": "Blessing: Twilight Pathways has a warp charge value of 6. If manifested, select one friendly &lt;SAEDATH&gt; CORE or &lt;SAEDATH&gt; CHARACTER unit within 6\" of this PSYKER. That unit can immediately make a normal Move, Advance or Fall Back as if it were your Movement phase. If it does so, that unit is not eligible to declare a charge this turn.",
    "id": "000006717002"
  },
  {
    "roll": "2",
    "name": "FOG OF DREAMS",
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "legend": "The Shadowseer sends forth their consciousness like a creeping mist, baffling the senses of the enemy.",
    "type": "Psychic Disciplines",
    "description": "Blessing: Fog of Dreams has a warp charge value of 6. If manifested, select one friendly &lt;SAEDATH&gt; CORE or &lt;SAEDATH&gt; CHARACTER unit within 12\" of this PSYKER. Until the start of your next Psychic phase, that unit can only be selected as the target of a ranged attack if it is the closest eligible target for that attack or is within 12\" of the shooting model.",
    "id": "000006717003"
  },
  {
    "roll": "3",
    "name": "MIRROR OF MINDS",
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "legend": "A maddening clash of wills consumes the victims mind as reality falls away.",
    "type": "Psychic Disciplines",
    "description": "Witchfire: Mirror of Minds has a warp charge value of 7. If manifested, select one enemy unit within 18\" of this PSYKER. That enemy unit suffers D3 mortal wounds, then roll off with your opponent. If you win or draw that roll off, that enemy unit suffers 1 mortal wound. Repeat this roll off process until either that enemy unit has suffered 6 mortal wounds, that enemy unit is destroyed, or your opponent wins the roll off.",
    "id": "000006717004"
  },
  {
    "roll": "4",
    "name": "VEIL OF TEARS",
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "legend": "Sketching a gesture in the air, the Shadowseer snatches the image of the Harlequins from the minds of their foes, hiding them from sight.",
    "type": "Psychic Disciplines",
    "description": "Malediction: Veil of Tears has a warp charge value of 7. If manifested, select one enemy unit within 18\" of and visible to this PSYKER. Until the start of your next Psychic phase, models in that enemy unit cannot target &lt;SAEDATH&gt; units from your army that are more than 18\" away with ranged attacks.",
    "id": "000006717005"
  },
  {
    "roll": "5",
    "name": "SHARDS OF LIGHT",
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "legend": "Blades of polychrome energy dazzle the foe, inflicting horrific and disorientating psychosomatic wounds.",
    "type": "Psychic Disciplines",
    "description": "Witchfire: Shards of Light has a warp charge value of 6. If manifested, select one enemy unit within 18\" of and visible to this PSYKER.That enemy unit suffers 1 mortal wound. If it is a VEHICLE or MONSTER unit, or a unit that contains 6 or more models, it suffers D3 mortal wounds instead.Until the start of your next Psychic phase, subtract 2 from the Leadership characteristic of models in that enemy unit.",
    "id": "000006717006"
  },
  {
    "roll": "6",
    "name": "WEBWAY DANCE (AURA)",
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "legend": "The veils between realspace and the webway grow thin, allowing the Harlequins to jink away from danger with quicksilver speed, only to reappear unharmed moments later.",
    "type": "Psychic Disciplines",
    "description": "Blessing: Webway Dance has a warp charge value of 7. If manifested, until the start of your next Psychic phase, this PSYKER gains the following ability:Webway Dance (Aura): While a friendly &lt;SAEDATH&gt; unit is within 6\" of this PSYKER, each time a model in that unit would lose a wound, roll one D6: on a 6, that wound is not lost.",
    "id": "000006717007"
  },
  {
    "roll": "1",
    "name": "ASTRAL AIM",
    "faction_id": "GK",
    "faction_name": "Grey Knights",
    "legend": "The psyker reaches out to the minds of his fellow battle-brothers, mystically guiding their aim to the chosen target.",
    "type": "Sanctic Discipline",
    "description": "Blessing: Astral Aim has a warp charge value of 6. If manifested, until the start of your next Psychic phase:Each time this PSYKER’s unit is selected to shoot, you can re-roll one hit roll when resolving that unit’s attacks.Each time a model in this PSYKER’s unit makes a ranged attack, the target does not receive the benefits of cover against that attack.",
    "id": "000002272002"
  },
  {
    "roll": "2",
    "name": "PURGE SOUL",
    "faction_id": "GK",
    "faction_name": "Grey Knights",
    "legend": "The psyker draws upon every ounce of willpower he possesses to purge the evil from his foes’ souls, scouring every trace of corruption.",
    "type": "Sanctic Discipline",
    "description": "Witchfire: Purge Soul has a warp charge value of 6. If manifested, select one enemy unit within 12\" of and visible to this PSYKER that has not already been selected for this power this phase, Then, roll one D6 and add this PSYKER’s Leadership characteristic to the result. Your opponent then rolls one D6 and adds that unit’s Leadership characteristic to the result.If your total is higher than your opponent’s, the selected unit suffers D3 mortal wounds.If your total is equal to your opponent’s, the selected unit suffers 1 mortal wound.If your total is less than your opponent’s, nothing happens.",
    "id": "000002272003"
  },
  {
    "roll": "3",
    "name": "HAMMERHAND",
    "faction_id": "GK",
    "faction_name": "Grey Knights",
    "legend": "Focusing the raging power of his mind, the psyker augments the strength of his comrades to the point where they can crush flesh and bone with a single blow.",
    "type": "Sanctic Discipline",
    "description": "Blessing: Hammerhand has a warp charge value of 5. If manifested, until the start of your next Psychic phase, each time a model in this PSYKER’s unit makes a melee attack, you can re-roll the wound roll.",
    "id": "000002272004"
  },
  {
    "roll": "4",
    "name": "PURIFYING FLAME",
    "faction_id": "GK",
    "faction_name": "Grey Knights",
    "legend": "The pellucid fire of the psyker’s soul is released in a wave of empyric flame, burning the essences of the unworthy.",
    "type": "Sanctic Discipline",
    "description": "Witchfire: Purifying Flame has a warp charge value of 5. If manifested, the closest enemy unit within 9\" of and visible to this PSYKER suffers 3 mortal wounds. If the result of the Psychic test was 11+, that unit suffers D3+3 mortal wounds instead.",
    "id": "000002272005"
  },
  {
    "roll": "5",
    "name": "ARMOURED RESILIENCE",
    "faction_id": "GK",
    "faction_name": "Grey Knights",
    "legend": "The psyker channels the primordial energies of the empyrean through himself, infusing the armour of his allies with its power, hardening the ceramite beyond what could be achieved by Human artifice.",
    "type": "Sanctic Discipline",
    "description": "Blessing: Armoured Resilience has a warp charge value of 6. If manifested, until the start of your next Psychic phase, add 1 to armour saving throws made for models in this PSYKER’s unit.",
    "id": "000002272006"
  },
  {
    "roll": "6",
    "name": "ETHEREAL CASTIGATION",
    "faction_id": "GK",
    "faction_name": "Grey Knights",
    "legend": "Hardening his soul, the psyker directs his brothers’ lethal fire before spiriting them away so quickly that any witnessing the ruin of their weapons blessed verdict would swear it came from thin air.",
    "type": "Sanctic Discipline",
    "description": "Blessing: Ethereal Castigation has a warp charge value of 6. If manifested, this PSYKER’s unit can shoot as if were your Shooting phase, and then it can make a Normal Move as if it were your Movement phase. After making this move and/or resolving these shooting attacks, until the end of the turn, this PSYKER’s unit cannot make a Normal Move, Advance, charge, or shoot.",
    "id": "000002272007"
  },
  {
    "roll": "1",
    "name": "’EADBANGER",
    "faction_id": "ORK",
    "faction_name": "Orks",
    "legend": "A bolt of raw power erupts from the Weirdboy’s sloping forehead and rockets across the battlefield, causing the head of the first unfortunate victim caught in its path to explode in a shower of brains and gore.",
    "type": "Power of the Waaagh! Discipline",
    "description": "Witchfire: ’Eadbanger has a warp charge value of 5. If manifested, select one enemy unit within 18\" of this PSYKER and roll one D6; if the result is higher than the selected unit’s Toughness characteristic, that unit suffers D6 mortal wounds. No more than one model can be destroyed as a result of these mortal wounds (any excess damage is lost).",
    "id": "000002975002"
  },
  {
    "roll": "2",
    "name": "WARPATH",
    "faction_id": "ORK",
    "faction_name": "Orks",
    "legend": "The Weirdboy disperses the Waaagh! energy coursing through his frame into the Ork warriors around him, stoking their already bellicose nature to a roaring fever pitch.",
    "type": "Power of the Waaagh! Discipline",
    "description": "Blessing: Warpath has a warp charge value of 6. If manifested, select one friendly &lt;CLAN&gt; CORE or &lt;CLAN&gt; CHARACTER unit that is within 18\" of this PSYKER. Until the start of your next Psychic phase, add 1 to the Attacks characteristic of models in that unit.",
    "id": "000002975003"
  },
  {
    "roll": "3",
    "name": "DA JUMP",
    "faction_id": "ORK",
    "faction_name": "Orks",
    "legend": "The Weirdboy closes his eyes tight and, in a storm of flashing green light, teleports a mass of confused greenskins to another part of the battlefield.",
    "type": "Power of the Waaagh! Discipline",
    "description": "Blessing: Da Jump has a warp charge value of 7. If manifested, select one friendly &lt;CLAN&gt; CORE unit that is within 12\" of this PSYKER. Remove that unit from the battlefield and set them up anywhere on the battlefield more than 9\" from any enemy models.",
    "id": "000002975004"
  },
  {
    "roll": "4",
    "name": "FISTS OF GORK",
    "faction_id": "ORK",
    "faction_name": "Orks",
    "legend": "The Weirdboy channels Waaagh! energy into his own fists or those of a nearby Ork, providing strength enough to punch through tank hulls.",
    "type": "Power of the Waaagh! Discipline",
    "description": "Blessing: Fists of Gork has a warp charge value of 6. If manifested, select one friendly ORKS CHARACTER model that is within 12\" of this PSYKER and visible to them. Until the start of your next Psychic phase, add 2 to that model’s Strength and Attacks characteristics. If the result of the Psychic test was 11 or more, add 3 to that model’s Strength and Attacks characteristics instead.",
    "id": "000002975005"
  },
  {
    "roll": "5",
    "name": "DA KRUNCH",
    "faction_id": "ORK",
    "faction_name": "Orks",
    "legend": "Green energies erupt from the Weirdboy’s eyes and coalesce in a roiling cloud above the enemy. That cloud then solidifies into the vast green foot of Gork (or Mork) himself, which commences to repeatedly stamp down on the foe.",
    "type": "Power of the Waaagh! Discipline",
    "description": "Witchfire: Da Krunch has a warp charge value of 6. If manifested, select one enemy unit that is within 18\" of this PSYKER. Roll one D6 for each model in that unit; for each roll of 6, that enemy unit suffers 1 mortal wound. If the result of the Psychic test was 9 or more, add 1 to rolls when resolving this psychic power.",
    "id": "000002975006"
  },
  {
    "roll": "6",
    "name": "JABBIN’ FINGERZ",
    "faction_id": "ORK",
    "faction_name": "Orks",
    "legend": "The Weirdboy focuses his attention on a nearby enemy before jabbing his fingers into his own eyes. The unfortunate foe experiences an agonising pain before finding themselves temporarily blinded.",
    "type": "Power of the Waaagh! Discipline",
    "description": "Malediction: Jabbin’ Fingerz has a warp charge value of 6. If manifested, select one enemy unit that is within 18\" of this PSYKER and visible to them. Until the start of your next Psychic phase, each time a model in that unit makes an attack, subtract 1 from that attack’s hit roll.",
    "id": "000002975007"
  },
  {
    "roll": "1",
    "name": "CATALYST",
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "legend": "Through its synaptic conduits, the Hive Mind reaches out to infuse the organisms under its control, invigorating their metabolisms with such unnatural vitality that they can ignore the most grievous of wounds.",
    "type": "Hive Mind Discipline",
    "description": "Blessing: Catalyst has a warp charge value of 6. If manifested, select one friendly &lt;HIVE FLEET&gt; unit within Synaptic Link range of this PSYKER. Until the start of your next Psychic phase:Each time a model in that unit (excluding TITANIC models) would lose a wound, roll one D6: on a 5+, that wound is not lost.Each time a TITANIC model in that unit would lose a wound, roll one D6: on a 6, that wound is not lost.",
    "id": "000002449002"
  },
  {
    "roll": "2",
    "name": "THE HORROR",
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "legend": "The terrifying psychic presence of the Hive Mind radiates from the synapse creature, flooding the minds of the Tyranids’ enemies and causing them to quail and panic.",
    "type": "Hive Mind Discipline",
    "description": "Malediction: The Horror has a warp charge value of 5. If manifested, select one enemy unit within Synaptic Link range of this PSYKER or one enemy unit within 24\" of this Psyker. Until the start of your next Psychic phase:Subtract 2 from the Leadership characteristic of models in that unit.Subtract 1 from Combat Attrition tests taken for that unit.",
    "id": "000002449003"
  },
  {
    "roll": "3",
    "name": "NEUROPARASITE",
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "legend": "Channelling psionic energies into the mind of the prey organism, the synapse creature triggers encephalitic mutation. Raw grey matter gains rudimentary synaptic sentience and sprouts microscopic chitinous talons and fangs before attempting to chew its way out of its cranial prison.",
    "type": "Hive Mind Discipline",
    "description": "Witchfire: Neuroparasite has a warp charge value of 7. If manifested, select one enemy unit within Synaptic Link range of this PSYKER or one enemy unit within 18\" of this PSYKER. Roll one D6 for each model in that unit: for each roll that exceeds that model’s Toughness characteristic, that model’s unit suffers 1 mortal wound (to a maximum of 6 mortal wounds).",
    "id": "000002449004"
  },
  {
    "roll": "4",
    "name": "ONSLAUGHT",
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "legend": "The synapse creature reaches out with its mind and seizes control of the lesser creatures’ weapon symbiotes, guiding their fire whilst simultaneously driving the swarms toward the enemy at a breakneck pace.",
    "type": "Hive Mind Discipline",
    "description": "Blessing: Onslaught has a warp charge value of 6. If manifested, select one friendly &lt;HIVE FLEET&gt; unit within Synaptic Link range of this PSYKER. Until the start of your next Psychic phase:Models in that unit do not suffer the penalty to hit rolls incurred for firing Assault weapons in the same turn that their unit has Advanced.Models in that unit do not suffer the penalty to hit rolls incurred for firing Heavy weapons in the same turn that their unit has moved.That unit is eligible to declare a charge in a turn in which it Advanced.",
    "id": "000002449005"
  },
  {
    "roll": "5",
    "name": "PAROXYSM",
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "legend": "The Hive Mind debilitates its enemies by triggering every nerve and pain receptor in their bodies, overwhelming their senses with wracking fits of agony.",
    "type": "Hive Mind Discipline",
    "description": "Malediction: Paroxysm has a warp charge value of 7. If manifested, select one enemy unit within Synaptic Link range of this PSYKER or one enemy unit within 18\" of this PSYKER. Until the start of your next Psychic phase:That unit cannot fire Overwatch or Set to Defend.Each time a model in that unit makes a melee attack, subtract 1 from that attack’s wound roll.",
    "id": "000002449006"
  },
  {
    "roll": "6",
    "name": "PSYCHIC SCREAM",
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "legend": "Through its vassal, the Hive Mind unleashes a piercing shriek of undiluted psychic energy that shreds the minds of those caught in its shock wave.",
    "type": "Hive Mind Discipline",
    "description": "Witchfire: Psychic Scream has a warp charge value of 5. If manifested, select the closest enemy unit within 18\" of this PSYKER. That unit suffers D3 mortal wounds. If that unit has the PSYKER keyword and the result of the Psychic test is higher than the Leadership characteristic of that unit, randomly select one psychic power that unit knows. Until the end of the battle, that unit no longer knows that psychic power.",
    "id": "000002449007"
  },
  {
    "roll": "1",
    "name": "BOON OF CHANGE",
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "legend": "As the Daemon chants, its minions begin to twist and new forms take shape as the will of Tzeentch demands.",
    "type": "Psychic Powers",
    "description": "Boon of Change has a warp charge value of 7. If manifested, select a friendly TZEENTCH DAEMON unit within 18\" of the psyker and roll a D3. Consult the table below to discover what characteristic bonus all models in that unit receive until the start of your next Psychic phase.D3Effect1Extra Limb: +1 Attack2Mystic Strength: +1 Strength3Iron Skin: +1 Toughness",
    "id": "000002582002"
  },
  {
    "roll": "2",
    "name": "BOLT OF CHANGE",
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "legend": "The Daemon unleashes a bolt of roiling warp energy that wracks the foe with sickening and uncontrollable mutations.",
    "type": "Psychic Powers",
    "description": "Bolt of Change has a warp charge value of 8. If manifested, select an enemy unit that is within 18\" of the psyker and visible to it. That unit suffers D3 mortal wounds. If a CHARACTER is slain by this power, you can add a Chaos Spawn to your army within 6” of the character and not within Engagement Range of any enemy models before they are removed as a casualty.",
    "id": "000002582003"
  },
  {
    "roll": "3",
    "name": "GAZE OF FATE",
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "legend": "The Daemon uses its powers of precognition to unravel the strands of destiny, and in doing so discovers the one true path to victory.",
    "type": "Psychic Powers",
    "description": "Gaze of Fate has a warp charge value of 6. If manifested, you can re-roll a single dice roll later during your turn.",
    "id": "000002582004"
  },
  {
    "roll": "4",
    "name": "TREASON OF TZEENTCH",
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "legend": "The psyker reaches into the mind of its victim, subverting their will and turning them upon their own allies.",
    "type": "Psychic Powers",
    "description": "Treason of Tzeentch has a warp charge value of 8. If manifested, select an enemy CHARACTER that is within 18\" of the psyker and visible to it (excluding the opponent’s Warlord) and roll 2D6. If the result is greater than the character’s Leadership characteristic, until the end of the following Fight phase treat that character as if it were a friendly model from your army in your Shooting, Charge and Fight phases.",
    "id": "000002582005"
  },
  {
    "roll": "5",
    "name": "FLICKERING FLAMES",
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "legend": "Cackling madly, the psyker’s minions are wreathed in pink and blue flames that leap forth to consume their foes.",
    "type": "Psychic Powers",
    "description": "Flickering Flames has a warp charge value of 5. If manifested, pick a friendly TZEENTCH DAEMON unit within 18\" of the psyker. Until your next Psychic phase, add 1 to any wound rolls made for that unit’s shooting weapons.",
    "id": "000002582006"
  },
  {
    "roll": "6",
    "name": "INFERNAL GATEWAY",
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "legend": "The psyker opens a portal to the warp, a tear in the fabric of the mortal plane that sucks foes into certain oblivion.",
    "type": "Psychic Powers",
    "description": "Infernal Gateway has a warp charge value of 8. If manifested, identify the nearest enemy model that is within 12\" of the psyker and visible to it; that model’s unit, and every other unit (friend and foe) within 3\" of that model, suffers D3 mortal wounds. The number of mortal wounds inflicted is D6 instead if the power is manifested with a Psychic test of 12+.",
    "id": "000002582007"
  },
  {
    "roll": "1",
    "name": "STREAM OF CORRUPTION",
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "legend": "The psyker spews forth a stream of disease on its enemies.",
    "type": "Psychic Powers",
    "description": "Stream of Corruption has a warp charge value of 5. If manifested, the closest enemy unit within 7\" of the psyker and visible to it suffers D3 mortal wounds if it has fewer than 10 models, or D6 mortal wounds if it has 10 or more models.",
    "id": "000002583002"
  },
  {
    "roll": "2",
    "name": "FLESHY ABUNDANCE",
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "legend": "Nurgle’s bountiful energies surge through the target, healing their wounds beneath new growths of swollen flesh.",
    "type": "Psychic Powers",
    "description": "Fleshy Abundance has a warp charge value of 5. If manifested, select a friendly NURGLE DAEMON unit within 18\" of the psyker. One model in that unit regains D3 lost wounds.",
    "id": "000002583003"
  },
  {
    "roll": "3",
    "name": "NURGLE’S ROT",
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "legend": "Gurgling praise to its god, the psyker exudes a wave of soul-pox that rapidly kills those who lack Nurgle’s blessings.",
    "type": "Psychic Powers",
    "description": "Nurgle’s Rot has a warp charge value of 7. If manifested, roll a D6 for every unit (excluding NURGLE units) within 7\" of the psyker. On a 4+ the unit being rolled for suffers D3 mortal wounds.",
    "id": "000002583004"
  },
  {
    "roll": "4",
    "name": "SHRIVELLING POX",
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "legend": "Muttering an unholy chant in a blighted tongue, the psyker calls down poxed blessings on a chosen foe.",
    "type": "Psychic Powers",
    "description": "Shrivelling Pox has a warp charge value of 6. If manifested, select an enemy unit that is within 18\" of the psyker and visible to it. Until the start of your next Psychic phase, subtract one from the target unit’s Toughness characteristic.",
    "id": "000002583005"
  },
  {
    "roll": "5",
    "name": "VIRULENT BLESSING",
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "legend": "The psyker blesses its allies with a bounty of fresh diseases with which to infect their enemies.",
    "type": "Psychic Powers",
    "description": "Virulent Blessing has a warp charge value of 7. If manifested, select a friendly NURGLE DAEMON unit within 18\" of the psyker. Until the start of your next Psychic phase:Add 1 to wound rolls made for that unit in the Fight phase.Wound rolls of 7+ made for that unit in the Fight phase inflict double damage.",
    "id": "000002583006"
  },
  {
    "roll": "6",
    "name": "MIASMA OF PESTILENCE",
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "legend": "As the psyker chants in a phlegm-choked drone, a dark cloud of filth and flies shrouds its allies from view.",
    "type": "Psychic Powers",
    "description": "Miasma of Pestilence has a warp charge value of 6. If manifested, select a friendly NURGLE DAEMON unit within 18\" of the psyker. Until the start of your next Psychic phase, your opponent must subtract 1 from all hit rolls that target that unit.",
    "id": "000002583007"
  },
  {
    "roll": "1",
    "name": "CACOPHONIC CHOIR",
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "legend": "The psyker emits an ear-piercing chorus of screams that shatters the sanity of its foes.",
    "type": "Psychic Powers",
    "description": "Cacophonic Choir has a warp charge value of 6. If manifested, roll 2D6 (adding 2 to the result if the Psychic test result was more than 10). The closest enemy unit that is within 18\" of the psyker and visible to it suffers a mortal wound for each point that the total exceeds their highest Leadership characteristic.",
    "id": "000002584002"
  },
  {
    "roll": "2",
    "name": "SYMPHONY OF PAIN",
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "legend": "The psyker’s chants unleash destructive Chaos energy.",
    "type": "Psychic Powers",
    "description": "Symphony of Pain has a warp charge value of 6. If manifested, the nearest enemy unit that is within 18\" of the psyker and visible to it is struck by unbearable pain. Your opponent must subtract 1 from all hit rolls made for this unit until the start of your next Psychic phase.",
    "id": "000002584003"
  },
  {
    "roll": "3",
    "name": "HYSTERICAL FRENZY",
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "legend": "The psyker sends out a psychic lash that goads its allies.",
    "type": "Psychic Powers",
    "description": "Hysterical Frenzy has a warp charge value of 8. If manifested, select a single friendly SLAANESH DAEMON unit within 18\" of the psyker that is within 1\" of an enemy unit. That unit can fight as if it were the Fight phase.",
    "id": "000002584004"
  },
  {
    "roll": "4",
    "name": "DELIGHTFUL AGONIES",
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "legend": "The psyker manipulates the pleasure centres of its allies’ minds, causing even great pain to register as sheer ecstasy.",
    "type": "Psychic Powers",
    "description": "Delightful Agonies has a warp charge value of 5. If manifested, select a single friendly SLAANESH DAEMON unit within 18\" of the psyker. Until the start of your next Psychic phase, roll a D6 each time a model in that unit loses a wound – on a 6 that model does not lose a wound.",
    "id": "000002584005"
  },
  {
    "roll": "5",
    "name": "PAVANE OF SLAANESH",
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "legend": "As the psyker sings, its spasming victims’ flesh tears and bones snap as they dance themselves to death.",
    "type": "Psychic Powers",
    "description": "Pavane of Slaanesh has a warp charge value of 6. If manifested, select an enemy unit that is within 18\" of the psyker and visible to them. Roll a D6 for each model in the unit; the unit suffers a mortal wound for each roll of 6.",
    "id": "000002584006"
  },
  {
    "roll": "6",
    "name": "PHANTASMAGORIA",
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "legend": "The psyker summons illusions to terrify and entice their foes.",
    "type": "Psychic Powers",
    "description": "Phantasmagoria has a warp charge value of 6. If manifested, enemy units must subtract 1 from their Leadership characteristic until the start of your next Psychic phase whilst they are within 12\" of the psyker.",
    "id": "000002584007"
  },
  {
    "roll": "1",
    "name": "INFERNAL GAZE",
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "legend": "Unholy power streams from Be’lakor’s eyes, charring and melting everything caught in its path.",
    "type": "Dark Hereticus Discipline",
    "description": "Infernal Gaze has a warp charge value of 5. If manifested, select an enemy unit that is within 18\" of Be’lakor and is visible to him and roll 3 dice. The target suffers one mortal wound for each roll of 4+.",
    "id": "000002585002"
  },
  {
    "roll": "2",
    "name": "DEATH HEX",
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "legend": "Be’lakor places a dire hex upon his enemies. Wards and energised shields flicker and fail, leaving the foe exposed.",
    "type": "Dark Hereticus Discipline",
    "description": "Death Hex has a warp charge value of 8. If manifested, select an enemy unit that is within 12\" of Be’lakor and is visible to him. Until the start of your next Psychic phase, that unit cannot take invulnerable saves.",
    "id": "000002585003"
  },
  {
    "roll": "3",
    "name": "GIFT OF CHAOS",
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "legend": "As the power of the warp surges through Be’lakor’s victim, bones snap and flesh rips as a new form takes shape.",
    "type": "Dark Hereticus Discipline",
    "description": "Gift of Chaos has a warp charge value of 6. If manifested, select an enemy model that is within 6\" of Be’lakor and is visible to him and roll a D6. If the result is greater than the target’s Toughness characteristic, its unit suffers D3+3 mortal wounds. If a CHARACTER is slain by this power, you can add a Chaos Spawn to your army and set it up within 1\" of the character before it is removed.",
    "id": "000002585004"
  },
  {
    "roll": "1",
    "name": "Infernal Gaze",
    "faction_id": "TS",
    "faction_name": "Thousand Sons",
    "legend": "Unholy power streams from the psyker’s eyes, charring and melting everything caught in its path.",
    "type": "Psychic Powers",
    "description": "Infernal Gaze has a warp charge value of 5. If manifested, select an enemy unit that is within 18\" of the psyker and visible to him and roll 3 dice. The target suffers one mortal wound for each roll of 4+.",
    "id": "000002657002"
  },
  {
    "roll": "2",
    "name": "Death Hex",
    "faction_id": "TS",
    "faction_name": "Thousand Sons",
    "legend": "The Sorcerer places a dire hex upon his enemies. Wards and energised shields flicker and fail, leaving the foe exposed.",
    "type": "Psychic Powers",
    "description": "Death Hex has a warp charge value of 8. If manifested, select an enemy unit that is within 12\" of the psyker and visible to him. Until the start of your next Psychic phase, that unit cannot take invulnerable saves.",
    "id": "000002657003"
  },
  {
    "roll": "3",
    "name": "Gift of Chaos",
    "faction_id": "TS",
    "faction_name": "Thousand Sons",
    "legend": "As the power of the warp surges through the psyker’s victim, bones snap and flesh rips as a new form takes shape.",
    "type": "Psychic Powers",
    "description": "Gift of Chaos has a warp charge value of 6. If manifested, select an enemy unit that is within 6\" of the psyker and visible to him and roll a D6. If the result is greater than the target’s Toughness, it suffers D3+3 mortal wounds. If a CHARACTER is destroyed by this power, you can add one Chaos Spawn to your army within 6\" of the character and not within Engagement Range of any enemy units before they are removed as a casualty.",
    "id": "000002657004"
  },
  {
    "roll": "4",
    "name": "Prescience",
    "faction_id": "TS",
    "faction_name": "Thousand Sons",
    "legend": "By focusing his warp-sight the psyker can guide the aim of his allies, bringing a swift and merciless death to their foes.",
    "type": "Psychic Powers",
    "description": "Prescience has a warp charge value of 7. If manifested, select a HERETIC ASTARTES unit within 18\" of the psyker. You can add 1 to all hit rolls made for that unit until the start of your next Psychic phase.",
    "id": "000002657005"
  },
  {
    "roll": "5",
    "name": "Diabolic Strength",
    "faction_id": "TS",
    "faction_name": "Thousand Sons",
    "legend": "The unholy energies of Chaos course through the recipient, swelling his frame with the strength to tear a tank in two.",
    "type": "Psychic Powers",
    "description": "Diabolic Strength has a warp charge value of 6. If manifested, select a HERETIC ASTARTES model within 12\" of the psyker. Until the start of your next Psychic phase, add 2 to that model’s Strength characteristic and 1 to its Attacks characteristic.",
    "id": "000002657006"
  },
  {
    "roll": "6",
    "name": "Warptime",
    "faction_id": "TS",
    "faction_name": "Thousand Sons",
    "legend": "The power of the immaterium bursts from the psyker, warping time and heightening the speed of his allies.",
    "type": "Psychic Powers",
    "description": "Warptime has a warp charge value of 6. If manifested, pick a THOUSAND SONS unit (excluding AIRCRAFT) within 3\" of the psyker. That unit can immediately move as if it were its Movement phase. You cannot use Warptime on a unit more than once per Psychic phase.",
    "id": "000002657007"
  },
  {
    "roll": "",
    "name": "1. ANTIMATTER METEOR",
    "faction_id": "NEC",
    "faction_name": "Necrons",
    "legend": "This Ctan Shard gathers an orb of roiling antimatter, before hurling the crackling projectile into the midst of the foe.",
    "type": "Powers of the C’tan",
    "description": "Roll one D6, adding 1 to the roll if this CTAN SHARD is a TESSERACT VAULT: on a 3-5, the closest enemy unit that is within 24\" of and visible to this C'TAN SHARD suffers 3 mortal wounds; on a 6+, that enemy unit suffers D3+3 mortal wounds.",
    "id": "000002748002"
  },
  {
    "roll": "",
    "name": "2. TIME’S ARROW",
    "faction_id": "NEC",
    "faction_name": "Necrons",
    "legend": "Twisting the flow of causality and remoulding temporal streams, this Ctan Shard erases its foe's existence from space and time.",
    "type": "Powers of the C’tan",
    "description": "Select one enemy unit within 18\" of and visible to this CTAN SHARD. Roll one D6, adding 1 to the roll if this C'TAN SHARD is a TESSERACT VAULT: if the total equals or exceeds the Wounds characteristic of any models in that enemy unit, your opponent selects one of those models to be destroyed.",
    "id": "000002748003"
  },
  {
    "roll": "",
    "name": "3. SKY OF FALLING STARS",
    "faction_id": "NEC",
    "faction_name": "Necrons",
    "legend": "Savagely beautiful spheres of coruscating light plummet from the cold depths of space, growing to roaring bale-stars as they approach, then impacting with killing force.",
    "type": "Powers of the C’tan",
    "description": "Select up to three enemy units within 24\" of this CTAN SHARD. For each of those units, roll one D6: on a 1-5, if the dice result is less than the number of models in that unit, that unit suffers D3 mortal wounds. If this C'TAN SHARD is a TESSERACT VAULT, that unit suffers 3 mortal wounds from this power, instead of D3.",
    "id": "000002748004"
  },
  {
    "roll": "",
    "name": "4. COSMIC FIRE",
    "faction_id": "NEC",
    "faction_name": "Necrons",
    "legend": "At this Ctan Shard's gestured command, a pillar of black fire streaks down from the heavens to consume the foe.",
    "type": "Powers of the C’tan",
    "description": "Roll one D6 for each enemy unit within 9\" of this CTAN SHARD: on a 4+, that unit suffers D3 mortal wounds. If this C'TAN SHARD is a TESSERACT VAULT, units suffer 3 mortal wounds from this power, instead of D3.",
    "id": "000002748005"
  },
  {
    "roll": "",
    "name": "5. SEISMIC ASSAULT",
    "faction_id": "NEC",
    "faction_name": "Necrons",
    "legend": "Stone fractures and ores melt as the Ctan Shard drags up tides of magma from deep below. Foes are plunged screaming into steamgushing vents as the land shatters beneath them, while tectonic shock waves hurl others from their feet with bone-breaking force.",
    "type": "Powers of the C’tan",
    "description": "Select one enemy unit within 18\" of and visible to this CTAN SHARD. Roll one D6 for each model in that unit, adding 1 to the roll if this C'TAN SHARD is a TESSERACT VAULT: for each 6+, that unit suffers 1 mortal wound, to a maximum of 10 mortal wounds.",
    "id": "000002748006"
  },
  {
    "roll": "",
    "name": "6. TRANSDIMENSIONAL THUNDERBOLT",
    "faction_id": "NEC",
    "faction_name": "Necrons",
    "legend": "The Ctan Shard projects a crackling bolt of energy from its outstretched palm, blasting its foe into oblivion.",
    "type": "Powers of the C’tan",
    "description": "Select one enemy unit within 24\" of and visible to this CTAN SHARD (an enemy CHARACTER unit with a Wounds characteristic of 9 or less cannot be selected for this power while it is within 3\" of another enemy unit, unless that CHARACTER unit is the closest visible enemy unit). Roll one D6: on a 2+, that unit suffers D3 mortal wounds. Then, roll one D6 for each other enemy unit within 3\" of the selected unit: on a 4+, that unit suffers 1 mortal wound. If this C'TAN SHARD is a TESSERACT VAULT, roll for each other enemy unit within 6\" of the selected unit, instead of 3\".",
    "id": "000002748007"
  },
  {
    "roll": "1",
    "name": "PRECOGNITION",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The Librarian sees the trajectory of incoming attacks, allowing him to slip effortlessly around them. To the outside observer, it seems neither bullet nor blade can touch him.",
    "type": "Indomitus Discipline",
    "description": "Blessing: Precognition has a warp charge value of 5. If manifested, then until the start of your next Psychic phase this psyker has a 5+ invulnerable save and, when resolving an attack made against this psyker, subtract 1 from the hit roll.",
    "id": "000003589002"
  },
  {
    "roll": "2",
    "name": "SCRYER’S GAZE",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "Looking into the twisted strands of the warp to divine the future, the Librarian hopes to predict the enemy’s plans and dispositions. With such knowledge, they can devise new strategies, guide their battle-brothers and alter the course of an entire war zone.",
    "type": "Indomitus Discipline",
    "description": "Blessing: Scryer’s Gaze has a warp charge value of 7. If manifested, if your army is Battle-forged you can choose to immediately gain 1 Command Point. If you choose not to then, once this turn, when resolving an attack made by a model from a friendly ULTRAMARINES unit whilst its unit is within 18\" of this psyker, you can re-roll the hit roll, wound roll or damage roll.",
    "id": "000003589003"
  },
  {
    "roll": "3",
    "name": "TELEPATHIC ASSAULT",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "Gathering his mental might into a searing blade of psychic energy, the Librarian unleashes an overwhelming empyric attack upon his enemy’s mind. Foes scream and collapse, blood jetting from their eyes as their brains burst asunder.",
    "type": "Indomitus Discipline",
    "description": "Witchfire: Telepathic Assault has a warp charge value of 7. If manifested, select one enemy unit within 24\" of and visible to this psyker. Roll 2D6 and add 2 to the result; that unit suffers 1 mortal wound for each point by which the total exceeds the highest Leadership characteristic of models in that unit.",
    "id": "000003589004"
  },
  {
    "roll": "4",
    "name": "STORM OF THE EMPEROR’S WRATH",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "Stretching forth one armoured gauntlet, the Librarian unleashes a ravening tempest of psychic blasts. Striking like lightning, these actinic energy bolts burn flesh black and overload the machine spirits of enemy war engines with a crackling roar.",
    "type": "Indomitus Discipline",
    "description": "Witchfire: Storm of the Emperor’s Wrath has a warp charge value of 6. If manifested, select the nearest enemy unit that is within 18\" of and visible to this psyker. Roll one D6 for each model in that unit; for each 6 that unit suffers 1 mortal wound.",
    "id": "000003589005"
  },
  {
    "roll": "5",
    "name": "PSYCHIC SHACKLES",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The Librarian plunges into his foes’ minds, trammelling their souls, crushing their will to fight on and stalling their advance in its tracks.",
    "type": "Indomitus Discipline",
    "description": "Malediction: Psychic Shackles has a warp charge value of 6. If manifested, select one enemy unit within 18\" of and visible to this psyker. Until the start of your next Psychic phase, halve the Move characteristic (rounding up) of models in that unit, and when a charge roll or Advance roll is made for that unit, subtract 1 from that roll. A unit cannot be affected by both this psychic power and the Tenebrous Curse psychic power at the same time.",
    "id": "000003589006"
  },
  {
    "roll": "6",
    "name": "EMPYRIC CHANNELLING",
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "legend": "The Librarian focuses his thoughts to channel warp energies into one of his psychically attuned brothers, achieving a harmonious psychic choristry that magnifies his powers by an order of magnitude.",
    "type": "Indomitus Discipline",
    "description": "Blessing: Empyric Channelling has a warp charge value of 5. If manifested, select one other friendly ULTRAMARINES LIBRARIAN model within 12\" of this psyker. Until the end of this Psychic phase, when a Psychic test is taken for that model, add 2 to the total, and that model does not suffer Perils of the Warp on a roll of double 1 or double 6.",
    "id": "000003589007"
  },
  {
    "roll": "1",
    "name": "SHROUDED STEP",
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "legend": "A black fume envelopes the psyker’s allies. It flows across the battlefield before coalescing into a roiling darkness from which they then emerge.",
    "type": "Army of Renown: Disciples of Be’lakor",
    "description": "Blessing: Shrouded Step has a warp charge value of 6. If manifested, select one friendly DISCIPLES OF BE’LAKOR INFANTRY unit within 18\" of this PSYKER. Remove that unit from the battlefield and set them up anywhere on the battlefield that is more than 9\" from any enemy models. If that unit Remained Stationary this turn, it is instead treated as having made a Normal Move this turn.",
    "id": "000005692002"
  },
  {
    "roll": "2",
    "name": "WREATHED IN SHADES",
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "legend": "The psyker draws from the warp a churning mass of damned shades, abandoned worshippers of Be’lakor now doomed to conceal and protect his current servants.",
    "type": "Army of Renown: Disciples of Be’lakor",
    "description": "Blessing: Wreathed in Shades has a warp charge value of 7. If manifested, select one friendly DISCIPLES OF BE’LAKOR unit (excluding MONSTER and VEHICLE units) within 12\" of this PSYKER. Until the start of your next Psychic phase, enemy models cannot target that unit with ranged weapons unless that unit is the closest eligible target to the firing model or it is within 12\" of the firing model.",
    "id": "000005692003"
  },
  {
    "roll": "3",
    "name": "PALL OF DESPAIR",
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "legend": "The psyker draws forth every bleak imagining and hopeless terror their victims have ever felt, drowning his enemies’ minds in misery until they barely have the will to keep breathing.",
    "type": "Army of Renown: Disciples of Be’lakor",
    "description": "Malediction: Pall of Despair has a warp charge value of 7. If manifested, select one enemy unit that is within 18\" of and visible to this PSYKER: Roll 3D6: if the result is greater than the enemy units Leadership characteristic, select one of the following to apply to that unit until the start of your next Psychic phase:If that unit has any Aura abilities, select one of those abilities. Until the start of your next Psychic phase, that unit loses that ability.Until the start of your next Psychic phase, that unit cannot perform actions (if that unit is currently performing an action, it immediately fails).Until the start of your next Psychic phase, in the Fight phase, that unit is not eligible to fight that phase until after all eligible units from your army have done so.",
    "id": "000005692004"
  },
  {
    "roll": "4",
    "name": "VOIDSLIVERS",
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "legend": "Reaching with their mind into the darkest depths of the void, the psyker draws forth crystallised slivers of terror, misery and loss before hurling them in a storm at the foe. The darts rip through soul-matter, while leaving the enemys corporeal forms lifeless but seemingly unharmed.",
    "type": "Army of Renown: Disciples of Be’lakor",
    "description": "Witchfire: Voidslivers has a warp charge value of 5. If manifested, select one enemy model that is within 12\" of and visible to this PSYKER. Draw a line between any part this PSYKER’s base and any part of the selected models base (or hull):The selected models unit suffers 1 mortal wound (if that unit contains 11 or more models, it suffers D3 mortal wounds instead).Every other enemy unit that this line passes over or through suffers 1 mortal wound (if that unit contains 11 or more models, it suffers D3 mortal wounds instead).",
    "id": "000005692005"
  },
  {
    "roll": "5",
    "name": "PENUMBRAL CURSE",
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "legend": "The psyker curses the blades of the enemy, causing them to become as insubstantial as shadows and to pass harmlessly through the very foes they should have hewn in two.",
    "type": "Army of Renown: Disciples of Be’lakor",
    "description": "Malediction: Penumbral Curse has a warp charge value of 7. If manifested, select one enemy unit within 18\" of this PSYKER. Until the start of your next Psychic phase, each time a model in that unit makes a melee attack, subtract 1 from that attack’s wound roll and reduce the Armour Penetration characteristic of that attack by 1.",
    "id": "000005692006"
  },
  {
    "roll": "6",
    "name": "BETRAYING SHADES",
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "legend": "Falling to the psyker’s whispered blandishments, the enemys very shadows turn upon them, clawing and ripping at the mortal forms that cast them.",
    "type": "Army of Renown: Disciples of Be’lakor",
    "description": "Witchfire: Betraying Shades has a warp charge value of 6. If manifested, select one enemy unit within 18\" of and visible to this Psyker. Select up to 6 models in that unit, and add together the unmodified Attacks characteristics of those models. Roll a number of D6 equal to the total (for example, if five of the selected models had an Attacks characteristic of 2, and one had an Attacks characteristic of 3, you would roll thirteen D6). If the result of the Psychic test was 11 or more, add 1 to each dice result. For each roll of 6+, that unit suffers 1 mortal wound.",
    "id": "000005692007"
  },
  {
    "roll": "1",
    "name": "ROAR OF MORK",
    "faction_id": "ORK",
    "faction_name": "Orks",
    "legend": "The Wurrboy opens his gob impossibly wide and gives vent to a bellowing roar that reverberates through his enemies minds. Coherent thought becomes nigh on impossible, and as the roar thunders on, panic begins to spread.",
    "type": "Beasthead Discipline",
    "description": "Malediction (Aura): Roar of Mork has a warp charge value of 6. If manifested:Select one enemy unit within 18\" and visible to the PSYKER. Until the start of your next Psychic phase, subtract 2 from Advance and charge rolls made for that unit.Until the start of your next Psychic phase, while an enemy unit is within 18\" of this PSYKER, subtract 1 from the Leadership characteristic of models in that unit.",
    "id": "000005730002"
  },
  {
    "roll": "2",
    "name": "FRAZZLE",
    "faction_id": "ORK",
    "faction_name": "Orks",
    "legend": "The Wurrboy concentrates really hard, a sickly green glow emanating around his gnarled cranium as he builds up a store of Waaagh! energy within himself. At the point where the Weirdboy is almost fit to burst, a wave of crackling energy floods out, reducing nearby foes to shrivelled husks in an instant.",
    "type": "Beasthead Discipline",
    "description": "Witchfire: Frazzle has a warp charge value of 6. If manifested, roll one D6 for each enemy unit that is within 9\" of this PSYKER: on a 4+, that unit suffers D3 mortal wounds.",
    "id": "000005730003"
  },
  {
    "roll": "3",
    "name": "BITIN’ JAWS",
    "faction_id": "ORK",
    "faction_name": "Orks",
    "legend": "The Wurrboy conjures a set of enormous green jaws in front of him. their teeth clamping open and shut in time with his own twitching movements. As he narrows his eyes, these jaws surge towards the enemy, the Weirdboy gnashing and chomping at anything that gets in their way.",
    "type": "Beasthead Discipline",
    "description": "Witchfire: Bitin’ Jawz has a warp charge value of 6. If manifested, select one enemy model that is within 18\" of and visible to this PSYKER. Draw a line between any part of this PSYKER’s base and any part of the selected model’s base (or hull); the selected model’s unit, and every other enemy unit that this line passes over or through, suffers 1 mortal wound.",
    "id": "000005730004"
  },
  {
    "roll": "4",
    "name": "SPIRIT OF GORK",
    "faction_id": "ORK",
    "faction_name": "Orks",
    "legend": "The Wurrboy stokes the bestial fury of nearby squigs. Eyes aglow with Waaagh! energy, the enraged creatures plunge into enemy lines, tearing the foe apart while their amused riders cling on tightly!",
    "type": "Beasthead Discipline",
    "description": "Blessing: Spirit of Gork has a warp charge value of 6. If manifested, select one friendly SQUIG unit within 12\" of and visible to this PSYKER. Until the start of your next Psychic phase:Each time that unit fights, it can make 1 additional attack with each Big Chompa’s jaws, squighog jaws, smasha squig jaws or squigosaur’s jaws it is equipped with.Each time a model in that unit makes an attack with Big Chompa’s jaws, squighog jaws, smasha squig jaws or squigosaur’s jaws, on an unmodified wound roll of 6, that attack inflicts 1 mortal wound on the target in addition to any normal damage.",
    "id": "000005730005"
  },
  {
    "roll": "5",
    "name": "BEASTSCENT",
    "faction_id": "ORK",
    "faction_name": "Orks",
    "legend": "The Wurrboy turns his nose to the sky, taking exaggerated sniffs. As he does so, a faint green glow begins to emanate from nearby enemies, telling the Weirdboy’s fellow hunters exactly where to find them.",
    "type": "Beasthead Discipline",
    "description": "Malediction: Beastscent has a warp charge value of 5. If manifested, select one enemy unit that is within 18\" of this PSYKER. Until the start of your next Psychic phase, that enemy unit does not receive the benefits of cover against attacks made by BEAST SNAGGA units from your army.",
    "id": "000005730006"
  },
  {
    "roll": "6",
    "name": "SQUIGGLY CURSE",
    "faction_id": "ORK",
    "faction_name": "Orks",
    "legend": "The Wurrboy cackles madly as he transforms the foe into a herd of squigs, the now terrified and confused beasts rampaging through their former comrades before bounding away.",
    "type": "Beasthead Discipline",
    "description": "Witchfire: Squiggly Curse has a warp charge value of 7. If manifested, select one enemy unit within 12\" of this PSYKER and roll one D6 for each model in that unit (to a maximum of 6 dice). For each result of 4+, that unit suffers 1 mortal wound. If any models in that unit are destroyed by this psychic power, every other enemy unit within 6\" of that unit suffers 1 mortal wound.",
    "id": "000005730007"
  },
  {
    "roll": "11",
    "name": "GAZE OF HATE",
    "faction_id": "TS",
    "faction_name": "Thousand Sons",
    "legend": "Pure roiling hatred surges through the psyker, becoming first dark fire in their veins then leaping from their eyes in searing columns of annihilating energy. Those struck by them risk being scoured from existence entirely.",
    "type": "Psychic Powers",
    "description": "Witchfire: Gaze of Hate has a warp charge value of 5. If manifested, select one enemy unit within 18\" of and visible to this PSYKER and roll three D6: for each roll of 4+, that enemy unit suffers 1 mortal wound.",
    "id": "000005891002"
  },
  {
    "roll": "12",
    "name": "TWIST OF FATE",
    "faction_id": "TS",
    "faction_name": "Thousand Sons",
    "legend": "One with sufficient willpower and disregard for their own soul can glean forbidden lore by looking upon the unfettered tides of the warp, plucking silvery skeins of fate from amongst the deadly morass and spinning them into nooses for their luckless foes.",
    "type": "Psychic Powers",
    "description": "Malediction: Twist of Fate has a warp charge value of 8. If manifested, select one enemy unit within 12\" of this PSYKER. Until the start of your next Psychic phase, models in that unit cannot use any invulnerable saves.",
    "id": "000005891003"
  },
  {
    "roll": "13",
    "name": "DARK BLESSING",
    "faction_id": "TS",
    "faction_name": "Thousand Sons",
    "legend": "Offering bloody sacrifice to the Dark Gods, the psyker calls down their unbridled generosity upon his foe. Their bodies are wracked by hideous mutations, their sanity collapsing as their mortal forms become a heaving, thrashing mass of horror.",
    "type": "Psychic Powers",
    "description": "Witchfire: Dark Blessing has a warp charge value of 6. If manifested, select one enemy model within 6\" of and visible to this PSYKER and roll one D6: if the result is greater than the target’s Toughness characteristic, its unit suffers D3+3 mortal wounds.",
    "id": "000005891004"
  },
  {
    "roll": "21",
    "name": "PRESAGE",
    "faction_id": "TS",
    "faction_name": "Thousand Sons",
    "legend": "The psyker reads signs and omens in the ebb and flow of battle, the whirling patterns of smoke, the spatter of blood as blades bite home. These gleaned warnings he passes on to his warriors, the better for them to predict and thus strike down their enemies.",
    "type": "Psychic Powers",
    "description": "Blessing: Presage has a warp charge value of 7. If manifested, select one friendly THOUSAND SONS unit within 18\" of this PSYKER. Until the start of your next Psychic phase, each time a model in that unit makes an attack, add 1 to that attack’s hit roll.",
    "id": "000005891005"
  },
  {
    "roll": "22",
    "name": "SWELLED BY THE WARP",
    "faction_id": "TS",
    "faction_name": "Thousand Sons",
    "legend": "The psyker opens a ragged channel to the roiling energies of the warp and funnels them recklessly into a chosen target. That warrior’s form expands with iron-hard muscle, lashing extra limbs, gnashing fangs and vicious talons that allow them to tear a bloody path through the foe.",
    "type": "Psychic Powers",
    "description": "Blessing: Swelled by the Warp has a warp charge value of 6. If manifested, select one friendly THOUSAND SONS model within 12\" of this PSYKER. Until the start of your next Psychic phase, add 2 to that model’s Strength characteristic and 1 to its Attacks characteristic.",
    "id": "000005891006"
  },
  {
    "roll": "23",
    "name": "TEMPORAL SURGE",
    "faction_id": "TS",
    "faction_name": "Thousand Sons",
    "legend": "With a wrench of mind, body and soul the psyker tears ropey strands of temporal energy through the veil from beyond and hurls them out to wind about his allies. Those so blessed are sped into battle all the faster as their garland of stolen time burns swiftly away.",
    "type": "Psychic Powers",
    "description": "Blessing: Temporal Surge has a warp charge value of 7. If manifested, select one friendly THOUSAND SONS INFANTRY, THOUSAND SONS CAVALRY, or THOUSAND SONS BEASTS unit within 6\" of this PSYKER. That unit can make a Normal Move.",
    "id": "000005891007"
  },
  {
    "roll": "31",
    "name": "EMPYRIC GUIDANCE",
    "faction_id": "TS",
    "faction_name": "Thousand Sons",
    "legend": "The psyker conjures a whirling flock of daemonic imps that bear his comrades’ shells and energy blasts across the battlefield on flickering wings of unholy flame.",
    "type": "Psychic Powers",
    "description": "Blessing: Empyric Guidance has a warp charge value of 4. If manifested, select one friendly THOUSAND SONS unit within 12\" of this PSYKER. Until the start of your next Psychic phase, add 6\" to the Range characteristic of Rapid Fire and Heavy weapons models in that unit are equipped with.",
    "id": "000005891008"
  },
  {
    "roll": "32",
    "name": "PSYCHIC STALK",
    "faction_id": "TS",
    "faction_name": "Thousand Sons",
    "legend": "Astrally projecting a portion of his soul into the warp, the psyker circles the flickering witchfires of his victims’ souls. Should their mental defences drop for even a moment, he strikes with predatory swiftness.",
    "type": "Psychic Powers",
    "description": "Witchfire: Psychic Stalk has a warp charge value of 5. If manifested, select one enemy unit that is not a VEHICLE, MONSTER or CHARACTER within 18\" of and visible to this PSYKER. Roll 2D6: if the result is greater than the unmodified Leadership characteristic of that unit, one model in that unit selected by your opponent is slain.",
    "id": "000005891009"
  },
  {
    "roll": "33",
    "name": "DESECRATION OF WORLDS",
    "faction_id": "TS",
    "faction_name": "Thousand Sons",
    "legend": "The worlds of the galaxy shall tremble and shatter beneath the dolorous tread of the Heretic Astartes, starting with this one! The psyker pours their rage and contempt into the bedrock of the battlefield, tainting it with their warpcraft even as they shatter it apart.",
    "type": "Psychic Powers",
    "description": "Malediction: Desecration of Worlds has a warp charge value of 7. If manifested, select one enemy unit within 24\" of and visible to this PSYKER. Until the start of your next Psychic phase, each time that unit makes a Normal Move, Advances, Falls Back or makes a charge move, roll one D6 for each model in that unit. For each result of 6, that unit suffers 1 mortal wound.",
    "id": "000005891010"
  },
  {
    "roll": "11",
    "name": "TZEENTCH’S FIRESTORM",
    "faction_id": "TS",
    "faction_name": "Thousand Sons",
    "legend": "The psyker conjures a raging storm of pink and blue fire down from the skies, that mutates his foes and leaves capering daemons that claw and bite in its wake.",
    "type": "Psychic Powers",
    "description": "Witchfire: Tzeentch’s Firestorm has a warp charge value of 6. If manifested, select one enemy unit within 18\" of and visible to this PSYKER and roll nine D6. For each roll of 6, that enemy unit suffers 1 mortal wound. If the result of the Psychic test was an unmodified 9+, that enemy unit suffers 1 mortal wound for each roll of 5+ instead.",
    "id": "000002655002"
  },
  {
    "roll": "12",
    "name": "GLAMOUR OF TZEENTCH",
    "faction_id": "TS",
    "faction_name": "Thousand Sons",
    "legend": "The psyker twists and obscures the perceptions of his foes to the point that his allies become all but invisible.",
    "type": "Psychic Powers",
    "description": "Blessing: Glamour of Tzeentch has a warp charge value of 6. If manifested, select one friendly THOUSAND SONS unit within 18\" of this PSYKER. Until the start of your next Psychic phase, each time an attack is made against that unit, subtract 1 from that attack’s hit roll.",
    "id": "000002655003"
  },
  {
    "roll": "13",
    "name": "DOOMBOLT",
    "faction_id": "TS",
    "faction_name": "Thousand Sons",
    "legend": "The psyker hurls a bolt of roiling energy that horribly twists its target into abhorrent and mutated new shapes.",
    "type": "Psychic Powers",
    "description": "Witchfire: Doombolt has a warp charge value of 6. If manifested, the closest enemy unit within 18\" of and visible to this PSYKER suffers 3 mortal wounds.",
    "id": "000002655004"
  },
  {
    "roll": "21",
    "name": "TEMPORAL MANIPULATION",
    "faction_id": "TS",
    "faction_name": "Thousand Sons",
    "legend": "Fashioning a pocket of dilated time around an injured ally, the psyker accelerates the rate at which their flesh reknits.",
    "type": "Psychic Powers",
    "description": "Blessing: Temporal Manipulation has a warp charge value of 5. If manifested, select one friendly THOUSAND SONS model (excluding VEHICLES) within 12\" of this PSYKER. That model is healed and regains up to D3 lost wounds. Each model can only be healed once per turn.",
    "id": "000002655005"
  },
  {
    "roll": "22",
    "name": "WEAVER OF FATES",
    "faction_id": "TS",
    "faction_name": "Thousand Sons",
    "legend": "The skeins of the future are laid bare to the psyker, revealing the fates of battle. Forewarned of imminent danger, his warriors dodge bullets and sword blows with seemingly supernatural reflexes.",
    "type": "Psychic Powers",
    "description": "Blessing: Weaver of Fates has a warp charge value of 7. If manifested, select one friendly THOUSAND SONS unit within 18\" of this PSYKER. Until the start of your next Psychic phase, models in that unit have a 4+ invulnerable save.",
    "id": "000002655006"
  },
  {
    "roll": "23",
    "name": "BALEFUL DEVOLUTION",
    "faction_id": "TS",
    "faction_name": "Thousand Sons",
    "legend": "Transmogrifying energies erupt from the psyker’s eyes, playing across the enemy’s ranks and reducing their proud warriors to mewling beasts.",
    "type": "Psychic Powers",
    "description": "Witchfire: Baleful Devolution has a warp charge value of 8. If manifested, select one enemy unit within 18\" of and visible to this PSYKER that contains 6 or more models. Roll a number of D6 equal to the result of the Psychic test: for each roll of 6, that enemy unit suffers D3 mortal wounds.",
    "id": "000002655007"
  },
  {
    "roll": "31",
    "name": "CACODAEMONIC CURSE",
    "faction_id": "TS",
    "faction_name": "Thousand Sons",
    "legend": "With dark invocations, the psyker summons cackling daemon imps to infest the enemy’s weapons.",
    "type": "Psychic Powers",
    "description": "Malediction: Cacodaemonic Curse has a warp charge value of 6. If manifested, select one enemy unit within 18\" of this PSYKER. Until the start of your next Psychic phase, subtract 1 from the Strength characteristic of ranged weapons models in that unit are equipped with.",
    "id": "000002655008"
  },
  {
    "roll": "32",
    "name": "PYRIC FLUX",
    "faction_id": "TS",
    "faction_name": "Thousand Sons",
    "legend": "The psykers makes themselves into a bounteous font of unholy warpflame.",
    "type": "Psychic Powers",
    "description": "Blessing: Pyric Flux has a warp charge value of 5. If manifested, select one friendly ARCANA ASTARTES unit within 12\" of this PSYKER. Until the end of the turn, add 1 to the Strength characteristic of all warpflamers, warpflame pistols and heavy warpflamers (and any Relics that replace one of these weapons) that models in that unit are equipped with.",
    "id": "000002655009"
  },
  {
    "roll": "33",
    "name": "PERPLEX",
    "faction_id": "TS",
    "faction_name": "Thousand Sons",
    "legend": "With perspective-warping illusions the psyker obfuscates his enemies’ vision, rendering their targets fluid and indistinct.",
    "type": "Psychic Powers",
    "description": "Malediction: Perplex has a warp charge value of 7. If manifested, select one enemy unit within 24\" of this PSYKER. Until the start of your next Psychic phase, each time that unit is selected to shoot, units more than 24\" away cannot be selected as the target of ranged attacks.",
    "id": "000002655010"
  },
  {
    "roll": "1",
    "name": "Synaptic Barrier",
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "legend": "The synapse creature creates a physical barrier of synaptic energy, shielding Tyranid beasts from attack.",
    "type": "Army of Renown: Crusher Stampede",
    "description": "Blessing: Synaptic Barrier has a warp charge value of 6. If manifested, select one friendly CRUSHER STAMPEDE model within 18\" of this PSYKER. Until the start of your next Psychic phase, that model has a 4+ invulnerable save.",
    "id": "000006169002"
  },
  {
    "roll": "2",
    "name": "Aggressive Surge",
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "legend": "The Hive Mind fills select beasts with ferocious energy that drives them to attack with unbounded aggression.",
    "type": "Army of Renown: Crusher Stampede",
    "description": "Blessing: Aggressive Surge has a warp charge value of 6. If manifested, select one friendly CRUSHER STAMPEDE model within 18\" of this PSYKER. Until the start of your next Psychic phase, add D3 to the Attacks characteristic of that model.",
    "id": "000006169003"
  },
  {
    "roll": "3",
    "name": "Infused Energies",
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "legend": "Through synaptic conduits, the Hive Mind imbues creatures of its horde with even greater energy and ferocity",
    "type": "Army of Renown: Crusher Stampede",
    "description": "Blessing: Infused Energies has a warp charge value of 6. If manifested, select one friendly CRUSHER STAMPEDE unit (excluding SYNAPSE units) within 18\" of this PSYKER. Until the start of your next Psychic phase, each time a model in that unit makes a melee attack, you can re-roll the hit roll.",
    "id": "000006169004"
  },
  {
    "roll": "",
    "name": "UNDERMINE",
    "faction_id": "GC",
    "faction_name": "Genestealer Cults",
    "legend": "Just as the dark depths below serve to shelter the Cult of the Four-armed Emperor, so too can they be psychically opened into an abyss that swallows their enemies whole.",
    "type": "Broodmind Discipline",
    "description": "Malediction: Undermine has a warp charge value of 7. If manifested, select one enemy unit (excluding units that can FLY) within 18\" of and visible to this PSYKER. Until the start of your next Psychic phase:Subtract 3\" from the Move characteristic of models in that unit (to a minimum of 0\").Halve Advance rolls made for that unit.Subtract 2 from charge rolls made for that unit.",
    "id": "000006292002"
  },
  {
    "roll": "",
    "name": "SYNAPTIC BLAST",
    "faction_id": "GC",
    "faction_name": "Genestealer Cults",
    "legend": "When the forces of the Hivecult fight, their residual psychic energy is palpable to their psykers, who allow its immense power to flow through them before unleashing it upon the enemy in a devastating blast.",
    "type": "Broodmind Discipline",
    "description": "Witchfire: Synaptic Blast has a warp charge value of 5. If manifested, roll one D6, adding 2 to the result for each friendly HIVECULT CORE unit within 6\" of this PSYKER:If the result is less than the Movement characteristic of the closest enemy unit within 18\" of and visible to this PSYKER, that enemy unit suffers D3 mortal wounds.If the result is equal to or greater than the Movement characteristic of the closest enemy unit within 18\" of and visible to this PSYKER, that enemy unit suffers 3 mortal wounds.",
    "id": "000006295002"
  },
  {
    "roll": "",
    "name": "BROODVOLT SURGE (AURA)",
    "faction_id": "GC",
    "faction_name": "Genestealer Cults",
    "legend": "Syphoning off the merest portion of the Broodmind’s energetic potential, the psyker melds it with the bioelectric fields of nearby faithful and wreathes them in a crackling protective aura.",
    "type": "Broodmind Discipline",
    "description": "Blessing: Broodvolt Surge has a warp charge value of 5. If manifested, until the start of your next Psychic phase, while a friendly BLADED COG unit is within 3\" of this PSYKER, each time an attack with a Damage characteristic of 1 is allocated to a model in that unit, add 1 to any armour saving throw made against that attack.",
    "id": "000006298002"
  },
  {
    "roll": "",
    "name": "ENTROPIC TOUCH",
    "faction_id": "GC",
    "faction_name": "Genestealer Cults",
    "legend": "This warlords very touch is metallophagic, unleashing microscopic organisms that gnaw away at the enemy’s armour and cause it to corrode and fall apart.",
    "type": "Broodmind Discipline",
    "description": "Each time this WARLORD makes a melee attack, an unmodified hit roll of 6 scores 2 additional hits.Improve the Armour Penetration characteristic of melee weapons this WARLORD is equipped with by 1 (excluding Relics).",
    "id": "000006299002"
  },
  {
    "roll": "",
    "name": "INESCAPABLE DECAY",
    "faction_id": "GC",
    "faction_name": "Genestealer Cults",
    "legend": "With but a glance and a hand gesture from a Rusted Claw psyker, the target is seized by swift entropy. Iron rusts, copper is stained with verdigris and fluids desiccate. Weakened in such a way, the enemy is then set upon and ripped apart by the psyker’s cultist brethren.",
    "type": "Broodmind Discipline",
    "description": "Malediction: Inescapable Decay has a warp charge value of 6. If manifested, select one enemy unit within 18\" of and visible to this PSYKER. Until the start of your next Psychic phase, each time a friendly RUSTED CLAW model makes an attack against that enemy unit, improve the Armour Penetration characteristic of that attack by 1.",
    "id": "000006301002"
  },
  {
    "roll": "",
    "name": "LAST GASP",
    "faction_id": "GC",
    "faction_name": "Genestealer Cults",
    "legend": "The psyker sends their powers flowing out to fill the minds of the faithful with visions of ascension and unity. Borne up by fervent rapture, the cultists fight on until - or sometimes even after - the last spark of life has left their bodies.",
    "type": "Broodmind Discipline",
    "description": "Blessing: Last Gasp has a warp charge value of 5. If manifested, select one friendly PAUPER PRINCES CORE unit within 18\" of and visible to this PSYKER. Until the start of your next Psychic phase, each time a model in that unit is destroyed by a melee attack, roll one D6: on a 5+, after the attacking model’s unit has finished making its attacks, it suffers 1 mortal wound (a unit can suffer a maximum of 5 mortal wounds per phase as a result of this psychic power).",
    "id": "000006304002"
  },
  {
    "roll": "",
    "name": "MUTAGENIC DEVIATION",
    "faction_id": "GC",
    "faction_name": "Genestealer Cults",
    "legend": "The psykers of the Twisted Helix have learned to send trigger impulses through the Broodmind, which awaken rampant mutagenic strains within the bodies of the faithful. Those affected sprout chitinous blades, wicked fangs and lashing tendrils with which to bloodily dismember their foes.",
    "type": "Broodmind Discipline",
    "description": "Blessing: Mutagenic Deviation has a warp charge value of 5. If manifested, select one friendly TWISTED HELIX unit within 12\" of and visible to this PSYKER. Until the start of your next Psychic phase, each time a model in that unit makes a melee attack, an unmodified hit roll of 6 automatically wounds the target.",
    "id": "000006307002"
  },
  {
    "roll": "1",
    "name": "RITUAL SHACKLE",
    "faction_id": "INQ",
    "faction_name": "Inquisition",
    "legend": "Through the occult imposition of psychic bonds, this psyker weaves a web of sanctified wards around the foe, sapping their spiritual and physical strength.",
    "type": "Telethesia Discipline",
    "description": "Malediction: Ritual Shackle has a warp charge value of 7. If manifested, select one enemy unit within 18\" of this PSYKER. Until your next Psychic phase:Subtract 1 from Psychic tests made for that enemy unit.Each time a model in that unit makes a melee attack, subtract 1 from that attack’s wound roll.If the result of the Psychic test was 10 or more, you can select one enemy unit within 24\" of this PSYKER, instead of within 18\".",
    "id": "000006551002"
  },
  {
    "roll": "",
    "name": "UNSTOPPABLE ONSLAUGHT",
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "legend": "A surge of mindless aggression flows through Hive Fleet Behemoth driving them forward in a tidal wave of snapping jaws and lashing talons.",
    "type": "Hive Mind Discipline",
    "description": "Blessing: Unstoppable Onslaught has a warp charge value of 7. If manifested, select one friendly BEHEMOTH unit within Synaptic Link range of this PSYKER. Until the start of your next turn, each time a model in that unit makes a melee attack, add 1 to that attack’s wound roll.",
    "id": "000006655002"
  },
  {
    "roll": "",
    "name": "SYNAPTIC LURE",
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "legend": "A psychic lure is placed on a threat; the marked prey is doomed.",
    "type": "Hive Mind Discipline",
    "description": "Malediction: Synaptic Lure has a warp charge value of 5. If manifested, select one enemy unit within Synaptic Link range of this PSYKER or one enemy unit within 18\" of this PSYKER. Until the start of your next Psychic phase, each time a friendly KRAKEN unit declares a charge, if that enemy unit is one of the targets of that charge, you can re-roll the charge roll.",
    "id": "000006663002"
  },
  {
    "roll": "",
    "name": "HIVE NEXUS",
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "legend": "The Hive Mind funnels Leviathan’s sophisticated synaptic network through its conduits, enforcing its gestalt will among the hive fleet’s lesser organisms.",
    "type": "Hive Mind Discipline",
    "description": "Blessing: Hive Nexus has a warp charge value of 7. If manifested, select one friendly LEVIATHAN CORE unit within Synaptic Link range of this PSYKER and select one Synaptic Imperative ability of a friendly LEVIATHAN SYNAPSE model that is also within Synaptic Link range of this PSYKER. Until the start of your next turn, that unit benefits from that SYNAPSE model’s Synaptic Imperative ability as if it was active for your army (in addition to the one that is currently active for your army) and as if they were within 6\" of one another.",
    "id": "000006665002"
  },
  {
    "roll": "",
    "name": "POISONOUS INFLUENCE",
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "legend": "This synapse creature radiates a pulsed imperative that triggers the semi-sentient spores of Gorgons biohorrors, spurring them to secrete venoms laced with a seeping psychic corruption.",
    "type": "Hive Mind Discipline",
    "description": "Blessing: Poisonous Influence has a warp charge value of 7. If manifested, select one friendly GORGON unit within Synaptic Link range of this PSYKER. Until the start of your next Psychic phase, each time a model in that unit makes a melee attack, an unmodified wound roll of 6 inflicts 1 mortal wound on the target in addition to any normal damage (to a maximum of 6 mortal wounds).",
    "id": "000006667002"
  },
  {
    "roll": "",
    "name": "LURKING MAWS",
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "legend": "The Hive Mind extends a psychic summons, and calls upon Jormungandr s embedded and waiting broods. Mindlessly converging via synaptic imperative, their sudden and frenzied attacks spell the foe’s end.",
    "type": "Hive Mind Discipline",
    "description": "Malediction: Lurking Maws has a warp charge value of 7. If manifested, select one enemy unit within Synaptic Link range of this PSYKER or one enemy unit within 18\" of this PSYKER. Until the start of your next Psychic phase, each time a friendly JORMUNGANDR model makes a melee attack against that enemy unit, improve the Armour Penetration characteristic of that attack by 1.",
    "id": "000006669002"
  },
  {
    "roll": "",
    "name": "SYMBIOSTORM",
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "legend": "The synaptic web sings with psionic targeting information, guiding living projectiles to strike at the prey’s identified weak spots.",
    "type": "Hive Mind Discipline",
    "description": "Blessing: Symbiostorm has a warp charge value of 7. If manifested, select one friendly KRONOS unit within Synaptic Link range of this PSYKER. Until the start of your next Psychic phase, each time a model in that unit makes a ranged attack, add 1 to the Strength characteristic of that attack.",
    "id": "000006671002"
  },
  {
    "roll": "",
    "name": "PSYCHIC SHRIEK",
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "legend": "Driven by synaptic imperative, acting as psychic conduits for the Hive Minds power, the warrior organisms of Hive Fleet Hydra open their maws as one and emit a mind-shredding shriek.",
    "type": "Hive Mind Discipline",
    "description": "Witchfire: Psychic Shriek has a warp charge value of 6. If manifested, select one enemy unit within Synaptic Link range of this PSYKER or one enemy unit within 18\" of this PSYKER. Roll one D6 for each friendly HYDRA INFANTRY and HYDRA BEAST model within 3\" of that unit and three D6s for each friendly HYDRA MONSTER model within 3\" of that unit: for each 5+, that enemy unit suffers 1 mortal wound (to a maximum of 6 mortal wounds).",
    "id": "000006673002"
  },
  {
    "roll": "1",
    "name": "GAZE OF YNNEAD",
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "legend": "The psykers eyes blaze with fire as they channel the power of Ynnead, the Whispering God.",
    "type": "Psychic Disciplines",
    "description": "Witchfire: Gaze of Ynnead has a warp charge value of 6. If manifested, select one enemy unit within 18\" of this PSYKER and roll one D6, subtracting 2 from the result if that unit had a Starting Strength of 1. On a 1 or less, that unit suffers 1 mortal wound. On a 2-5, that unit suffers D3 mortal wounds. On a 6, that unit suffers D6 mortal wounds.",
    "id": "000006718002"
  },
  {
    "roll": "2",
    "name": "STORM OF WHISPERS",
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "legend": "The psykers voice joins with those of the dead to drive the foe utterly insane.",
    "type": "Psychic Disciplines",
    "description": "Witchfire: Storm of Whispers has a warp charge value of 6. If manifested, roll three D6 for each enemy unit within 9\" of this PSYKER. For each 4+, the enemy unit being rolled for suffers 1 mortal wound.",
    "id": "000006718003"
  },
  {
    "roll": "3",
    "name": "WORD OF THE PHOENIX",
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "legend": "The psyker calls upon the revenant energies of the mythical phoenix to restore the life force of fallen warriors.",
    "type": "Psychic Disciplines",
    "description": "Blessing: Word of the Phoenix has a warp charge value of 6. If manifested, select one friendly YNNARI INFANTRY unit (excluding WRAITH CONSTRUCT units) within 6\" of this PSYKER. One of that unit’s destroyed models (or D3 of its destroyed models if that unit has the Troops Battlefield Role) can be added back to that unit with full wounds remaining. These models can only be set up within Engagement Range of enemy units that are already within Engagement Range of the unit they are being added back to.",
    "id": "000006718004"
  },
  {
    "roll": "4",
    "name": "UNBIND SOULS",
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "legend": "The psyker reaches out with their mind to weaken the bond between soul and body, debilitating the enemy.",
    "type": "Psychic Disciplines",
    "description": "Malediction: Unbind Souls has a warp charge value of 6. If manifested, select one enemy unit within 18\" of this PSYKER. Each time a YNNARI model from your army makes a melee attack that targets that enemy unit, an unmodified hit roll of 6 automatically wounds the target.",
    "id": "000006718005"
  },
  {
    "roll": "5",
    "name": "SHIELD OF YNNEAD",
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "legend": "The psyker manifests a shield of spiritual energy around their allies, sheltering the devotees of Ynnead.",
    "type": "Psychic Disciplines",
    "description": "Blessing: Shield of Ynnead has a warp charge value of 6. If manifested, select one friendly YNNARI unit (excluding TITANIC units) within 12\" of this PSYKER. Until the start of your next Psychic phase, models in that unit have a 4+ invulnerable save.",
    "id": "000006718006"
  },
  {
    "roll": "6",
    "name": "ANCESTORS’ GRACE",
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "legend": "Drawing upon the greatness that is the genetic legacy of all Aeldari, the psyker bolsters their fellows.",
    "type": "Psychic Disciplines",
    "description": "Blessing: Ancestors’ Grace has a warp charge value of 7. If manifested, select one friendly YNNARI unit within 18\" of this PSYKER. Until the start of your next Psychic phase, each time a model in that unit makes a melee attack, add 1 to that attack’s wound roll.",
    "id": "000006718007"
  }
]