[
  {
    "cardType": "secondary",
    "source": "basic",
    "description": "Score 3 victory points at the end of the battle for each enemy **CHARACTER** unit that is destroyed. At the end of the battle, if the enemy **WARLORD** is destroyed, score 1 extra victory point.",
    "faction": "basic",
    "id": "2cfbcd09-62f3-46e8-98ca-0a47710400a1",
    "name": "ASSASSINATION",
    "type": "End Game Objective",
    "category": "PURGE THE ENEMY"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "BRING IT DOWN",
    "description": "At the end of the battle, score victory points for each enemy **MONSTER** or **VEHICLE** model that is destroyed, as follows:\r * Score 1 victory point for each of those destroyed models with a Wounds characteristic of 9 or less. \r * Score 2 victory points for each of those destroyed models with a Wounds characteristic of 10-14. \r * Score 3 victory points for each of those destroyed models with a Wounds characteristic of 15-19. * Score 4 victory points for each of those destroyed models with a Wounds characteristic of 20 or more.",
    "category": "PURGE THE ENEMY",
    "type": "End Game Objective",
    "faction": "basic",
    "id": "5a9ed34b-bd69-4c6c-80a1-015d8712589c"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "GRIND THEM DOWN",
    "description": "Score 3 victory points at the end of the battle round if more enemy units than friendly units were destroyed this battle round.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "basic",
    "id": "e29a6831-d33a-4b65-8418-b23c54d009cc"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "NO PRISONERS",
    "description": "If you select this objective, keep a Kill Points tally. Each time an enemy model is destroyed (excluding **VEHICLE**, **MONSTER** or **CHARACTER** models), add a number of marks to this tally equal to the Wounds characteristic of the destroyed model. At the end of the battle, divide your Kill Points tally by 10 and round down - the result is the number of victory points you score. In addition, if your Kill Points tally is between 50 and 99, you score 1 additional victory point, and if your tally is 100 or more, you score 2 additional victory points.",
    "category": "NO MERCY, NO RESPITE",
    "type": "End Game Objective",
    "faction": "basic",
    "id": "586aa4e2-25f5-4d00-aa21-8067b115905f"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "ABHOR THE WITCH",
    "description": "You cannot select this secondary objective if your army includes any **PSYKER** units. Score 3 victory points at the end of the battle for each enemy **PSYKER CHARACTER** unit that is destroyed, and 2 victory points for every other enemy **PSYKER** unit that is destroyed.",
    "category": "WARPCRAFT",
    "type": "End Game Objective",
    "faction": "basic",
    "id": "de2a3c50-b9eb-4545-82f3-d49995c5d34d"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "PSYCHIC INTERROGATION",
    "description": "Score 3 victory points each time you successfully complete the following psychic action:\r\r**Psychic Interrogation (Psychic Action - Warp Charge 4):** One **PSYKER CHARACTER** unit from your army can attempt to perform this psychic action in your Psychic phase if it is within 24&quot; of any enemy **CHARACTER** units\r\rIn addition, if the result of the Psychic test is equal to or greater than the Leadership characteristic of any enemy **CHARACTER** models within 24&quot; of the **PSYKER** unit that completed this psychic action, you gain 1 Command point at the end of the phase.",
    "category": "WARPCRAFT",
    "type": "Progressive Objective",
    "faction": "basic",
    "id": "a347a949-2796-428f-9b43-717663f36589"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "WARP RITUAL",
    "description": "If you select this objective, keep a Ritual Points tally; add 1 to that tally each time a unit from your army completes the following psychic action during the battle:\r\r**Warp Ritual (Psychic Action - Warp Charge 3):** One **PSYKER CHARACTER** unit from your army can attempt to perform this psychic action in your Psychic phase if it is within 6&quot; of the centre of the battlefield.\r\rAt the end of the battle, score 3 victory points if your Ritual Points tally is 1, score 7 victory points if your tally is 2, or score 12 victory points if your tally is 3 or more.",
    "category": "WARPCRAFT",
    "type": "End Game Objective",
    "faction": "basic",
    "id": "0b0537da-2fbb-4394-8db5-44cd0ea46c97"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "BEHIND ENEMY LINES",
    "description": "Score 2 victory points at the end of your turn if one unit from your army (excluding **AIRCRAFT** units) is wholly within your opponent&apos;s deployment zone. Score 4 victory points at the end of your turn instead if two or more units from your army (excluding **AIRCRAFT** units) are wholly within your opponent&apos;s deployment zone.",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "basic",
    "id": "dc9ca96c-7662-4685-bc6d-49c836603a91"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "ENGAGE ON ALL FRONTS",
    "description": "Score 2 victory points at the end of your turn if you have one or more qualifying units (see below) from your army wholly within three different table quarters, and those units are all more than 6&quot; away from any other table quarter. Score 3 victory points instead if you have one or more qualifying units from your army wholly within each table quarter, and those units are all more than 6&quot; away from any other table quarter. A qualifying unit is one that has a Starting Strength of 3 or more models, or one that contains 1 or more **VEHICLE** or **MONSTER** models (excluding **AIRCRAFT** models).",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "basic",
    "id": "e2e004c1-5141-4d04-b25b-bb9769314667"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "RAISE THE BANNERS HIGH",
    "description": "If you select this objective, units from your army can attempt the following action:\r\r**Raise Banners (Action):** One or more **INFANTRY** units from your army can start to perform this action at the end of your Movement phase. Each unit from your army that starts to perform this action must be within range of a different objective marker you control and that does not have one of your banners raised on it (see below). The action is completed at the end of your turn. If completed, that objective marker is said to have one of your army&apos;s banners raised on it (the banner is &apos;removed&apos; if your opponent controls the objective marker at the start of any Command phase).\r\rScore 1 victory point at the end of each of your Command phases, and 1 victory point at the end of the battle, for each objective marker on the battlefield that has one of your banners raised on it.",
    "category": "SHADOW OPERATIONS",
    "type": "Progressive and End Game Objective",
    "faction": "basic",
    "id": "df84597a-2fd7-43e5-accb-d61446f9ee77"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "RETRIEVE NEPHILIM DATA",
    "description": "If you select this objective, keep a Retrieved Data tally. In addition, units from your army can attempt the following action:\r\r**Retrieve Data (Action):** One **INFANTRY** or **BIKER** unit from your army can start to perform this action at the end of your Movement phase if it is wholly within a table quarter that has not had a servo-skull retrieved by your army (see below) and it is more than 6&quot; away from any other table quarter. This action is completed at the end of your turn provided the unit performing it is still within the same table quarter. If completed, roll one D6, subtracting 1 from the result if the unit that completed the action has the Troops Battlefield Role: if the result is less than or equal to the number of models currently in that unit, that table quarter is said to have had a servo-skull retrieved by your army and you add 1 to your Retrieved Data tally.\r\rAt the end of the battle, score 4 victory points if your Retrieved Data tally is 2, score 8 victory points if your tally is 3, or score 12 victory points if your tally is 4.",
    "category": "SHADOW OPERATIONS",
    "type": "End Game Objective",
    "faction": "basic",
    "id": "604e708e-0131-4bc0-ace3-3a151684be24"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "SLAY THE HERETIC",
    "description": "At the end of the battle round: \r * Score 1 victory point for each enemy unit destroyed by an attack made with a bolt weapon by an **ADEPTUS MINISTORUM** unit from your army (to a maximum of 5 victory points per battle).\r * Score 1 victory point for each enemy unit destroyed by an attack made with a flame weapon by an **ADEPTUS MINISTORUM** unit from your army (to a maximum of 5 victory points per battle).\r * Score 1 victory point for each enemy unit destroyed by an attack made with a melta weapon by an **ADEPTUS MINISTORUM** unit from your army (to a maximum of 5 victory points per battle).",
    "category": "PURGE THE ENEMY",
    "type": "Progressive Objective",
    "faction": "AS",
    "id": "1e3d93e5-9634-4b73-a50a-d95a18003fef"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "A LEAP OF FAITH",
    "description": "At the end of each players turn, if two Acts of Faith were performed by **ADEPTA SORORITAS** units from your army that turn, score 1 victory point if it is your turn, or 2 victory points if it is your opponent&apos;s turn. If three or more Acts of Faith were performed by **ADEPTA SORORITAS** units from your army that turn, score 1 additional victory point. Note that Acts of Faith performed due to Cherub dice bestowed by incensor cherubs do not count towards this secondary objective. You can score a maximum of 12 victory points from this secondary objective per battle.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "AS",
    "id": "f89a189e-f68d-4129-bfd6-9837d3f96af9"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "DEFEND THE SHRINE",
    "description": "If you select this objective, during the Resolve Pre-battle Abilities step of the mission, select one objective marker on the battlefield not in your deployment zone to be the Sacred Shrine objective marker (if the only objective marker on the battlefield is in your deployment zone, then this must be the Sacred Shrine objective marker).\r * At the end of your turn, score 3 victory points if you control the Sacred Shrine objective marker and an **ADEPTUS MINISTORUM** unit from your army is within range of that objective marker.\r * At the end of the battle, if your opponent controls the Sacred Shrine objective marker, reduce the number of victory points you have scored from this secondary objective by 3 (to a minimum of 0).",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive and End Game Objective",
    "faction": "AS",
    "id": "ec43949b-0794-4779-881a-b974bcbd18a5"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "SACRED GROUNDS",
    "description": "If you select this objective, units from your army can attempt the following action: \r\r **Sacred Grounds (Action):** One or more **ADEPTA SORORITAS INFANTRY** or **CULT IMPERIALIS PRIEST** units from your army can start to perform this action at the end of your Movement phase. Each unit from your army that starts to perform this action must be within range of a different objective marker you control that has not been consecrated by your army (see below). The action is completed at the start of your next Command phase or at the end of the battle (whichever comes first). If completed, that objective marker is said to have been consecrated by your army, and until the end of the battle, that objective marker gains the Inspiring (**ADEPTUS MINISTORUM**) terrain trait (it is not considered to be a terrain feature for any other rules purposes). \r\r Each time a unit from your army completes this action, if the objective marker that was consecrated by that action is wholly within your deployment zone, score 1 victory point; otherwise, score 5 victory points.",
    "category": "SHADOW OPERATIONS",
    "type": "Progressive Objective",
    "faction": "AS",
    "id": "8c9ca59c-fb52-4706-989a-158ff8f15c4a"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "AURIC MORTALIS",
    "description": "If you select this objective, during the Resolve Pre-battle Abilities step of the mission, select one **PRIMARCH** or **SUPREME COMMANDER** unit from your opponent&apos;s army to be marked for death (see below). If no such unit exists, select the unit from your opponent&apos;s army with the highest points value (excluding **AIRCRAFT** units) to be marked for death. If two or more units are tied, you choose between them. A unit&apos;s points value includes the points of all weapons, wargear and upgrades it has. \r\r At the end of the battle, score victory points as follows: \r * Score 5 victory points if the unit you selected to be marked for death is destroyed.\r * Score 5 victory points if the unit you selected to be marked for death was destroyed as a result of a melee attack made by an **ADEPTUS CUSTODES** or **ANATHEMA PSYKANA** unit from your army.\r * Score 5 victory points if both of the above are true and the unit you selected to be marked for death was not within your deployment zone when it was destroyed.",
    "category": "PURGE THE ENEMY",
    "type": "End Game Objective",
    "faction": "AC",
    "id": "b581ddb1-0a0a-4d3b-9564-f6bbedccf3b1"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "MIGHT OF TERRA",
    "description": "At the end of the battle round, score 4 victory points if one or more enemy units were destroyed this battle round by an **ADEPTUS CUSTODES** unit from your army and no **ADEPTUS CUSTODES** units from your army were destroyed this battle round.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "AC",
    "id": "f578ee00-477f-4ced-8946-ed716c882b62"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "STAND VIGIL",
    "description": "At the end of the battle round, score 3 victory points if you control more objective markers that are not within either player&apos;s deployment zone than your opponent does.",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "AC",
    "id": "c7ae97fb-7b32-4672-9638-6dff8e671b1a"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "ACCRETION OF KNOWLEDGE",
    "description": "At the end of the battle, score 3 victory points for each enemy model that is destroyed that meets one or more of the following criteria:\r * The model has a **WARLORD** Trait.\r * The model has a Relic.\r * The model has the **VEHICLE** keyword and a Wounds characteristic of 14 or more.\r\r Models that were not destroyed by **ADEPTUS MECHANICUS** models from your army do not count towards this secondary objective.",
    "category": "PURGE THE ENEMY",
    "type": "End Game Objective",
    "faction": "AdM",
    "id": "4029e64f-5255-4b3f-b8cf-d45b74d73776"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "ERADICATION OF FLESH",
    "description": "At the end of the battle round, score 3 victory points if more enemy units were destroyed by **ADEPTUS MECHANICUS VEHICLE** units from your army this battle round than the number of **ADEPTUS MECHANICUS VEHICLE** units from your army that were destroyed by enemy units this battle round.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "AdM",
    "id": "d172a187-3e33-4dc4-b203-23084ba341a6"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "HIDDEN ARCHEOVAULT",
    "description": "If you select this objective, during the Resolve Pre-battle Abilities step of the mission, your opponent must select one objective marker on the battlefield not within their deployment zone to be the Hidden Archeovault objective marker (if the only objective marker on the battlefield is in the enemy&apos;s deployment zone, then this must be the Hidden Archeovault objective marker). \r\r At the end of the battle round, score 4 victory points if you control the Hidden Archeovault objective marker and an **ADEPTUS MECHANICUS** unit from your army is within range of that objective marker.",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "AdM",
    "id": "ef1ba556-aa36-44c6-ab2d-5e9e21746388"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "UNCHARTED SEQUENCING",
    "description": "If you select this objective, during the Resolve Pre-battle Abilities step of the mission, assign one objective marker to each battle round and note this down on your army roster. An objective marker cannot be assigned to more than one battle round. Score 3 victory points at the end of the battle round if you control the objective marker assigned to that battle round and an **ADEPTUS MECHANICUS** unit from your army is within range of that objective marker.",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "AdM",
    "id": "7c23040b-8a62-4433-b06e-17872e238810"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "BY LASGUN AND BAYONET",
    "description": "Score 1 victory point each time an enemy unit that started the turn within range of an objective marker is destroyed by an **ASTRA MILITARUM** unit from your army.",
    "category": "PURGE THE ENEMY",
    "type": "Progressive Objective",
    "faction": "AM",
    "id": "ce21d819-91e1-4fb9-a529-c282f9f6943b"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "INFLEXIBLE COMMAND",
    "description": "At the end of your turn: \r * Score 2 victory points if every **ASTRA MILITARUM INFANTRY** unit from your army is within 6&quot; of a friendly **OFFICER** unit.\n * Score 1 victory point if every **ASTRA MILITARUM VEHICLE** unit from your army is within 12&quot; of a friendly **VEHICLE OFFICER** unit. \r * Score 1 victory point if any enemy units were destroyed by an **ASTRA MILITARUM** unit from your army this turn while that **ASTRA MILITARUM** unit was being affected by an Order or Tank Order. \r\r For the purposes of this secondary objective, while an **OFFICER** unit from your army is embarked within a **TRANSPORT** model, that **TRANSPORT** model is also considered to have the **OFFICER** keyword. In addition, for the purposes of this secondary objective, while an **INFANTRY** unit from your army equipped with a vox-caster is within 24&quot; of a friendly **OFFICER** unit, it counts as being within 6&quot; instead if that **OFFICER** unit is itself within 1&quot; of a friendly **COMMAND SQUAD** or **TEMPESTUS COMMAND SQUAD** unit that is also equipped with a vox-caster.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "AM",
    "id": "6cbd6981-0f01-451e-b856-baeec5f75902"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "BOOTS ON THE GROUND",
    "description": "At the end of each of your turns (excluding the first)\r * Score 1 victory point for each table quarter that has one or more **<REGIMENT> INFANTRY** units from your army wholly within it (excluding **CHARACTER** models and units that are within 6&quot; of the centre of the battlefield). \r * Score 1 victory point if one or more units from your army equipped with a regimental standard are either wholly within 6&quot; of the centre of the battlefield or wholly within your opponent&apos;s deployment zone.",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "AM",
    "id": "721bfa6f-18e9-4398-99d8-0c4d187466fb"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "SPECIAL ORDERS",
    "description": "If you select this objective, units from your army can attempt the following action: \r\r **Expunge Intel (Action):** One **ASTRA MILITARUM INFANTRY** unit from your army can start to perform this action at the end of your Movement phase if it is within 12&quot; of a friendly **OFFICER** unit and it is within range of an objective marker you control that is not within your deployment zone and has not already been expunged by your army (see below). The action is completed at the end of the turn. If completed, that objective marker is said to have been expunged by your army. Roll one D6 each time an objective marker is expunged by your army: on a 6, you gain 1 Command point.\r\r At the end of the battle, score a number of victory points based on how many objective markers have been expunged by your army, as shown in the table below.\r\r|NUMBER OF EXPUNGED OBJECTIVE MARKERS|VICTORY POINTS|\r|---|---|\r|1|2|",
    "category": "SHADOW OPERATIONS",
    "type": "End Game Objective",
    "faction": "AM",
    "id": "bb61fde3-849d-4612-b079-151383330871"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "BATHE YOUR BLADE IN THE BLOOD OF THE FOE",
    "description": "If you select this objective, during the Resolve Pre-battle Abilities step of the mission, select one **BLACK TEMPLARS CHARACTER** model from your army to issue the challenge, then select one **CHARACTER** model from your opponent&apos;s army to accept the challenge. Score 5 victory points at the end of the battle for each of the following conditions that have been satisfied:\r * The model that accepted the challenge is destroyed.\r * The model that accepted the challenge was destroyed as the result of a melee attack. \r * The model that accepted the challenge was destroyed as the result of an attack made by the model that issued the challenge.\r\rIf the model that accepted the challenge is a Strategic Reserve or Reinforcement unit and is destroyed as a result of not arriving on the battlefield, all of the above conditions are considered to have been satisfied.\r\rIf all three of these conditions are satisfied during the battle, you immediately gain 1 Command point.",
    "category": "PURGE THE ENEMY",
    "type": "End Game Objective",
    "faction": "SM",
    "subfaction": "BT",
    "id": "576e4639-296e-4b25-b6db-fdf474b06026"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "ALLOW NOT THE WORSHIP OF UNCLEAN IDOLS",
    "description": "At the end of your turn, score 2 victory points for each objective marker you control that was controlled by your opponent at the start of that turn, and that has a BLACK TEMPLARS CORE or BLACK TEMPLARS CHAPLAIN unit from your army within range of it.",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "BT",
    "id": "09caf2a9-bbdc-4d2d-953f-503ce21b1a5e"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "CARRY OUT YOUR VOWS",
    "description": "You can select this secondary objective if you have selected any Templar Vows. This objective consists of a Progressive component and an End Game component. For the purposes of the End Game component, you can only score victory points that apply for the Templar Vow you selected at the end of the Read Mission Briefing step, and not for any other vows you selected during the battle.\r\r_Progressive Component_\r\rAt the end of the battle round, score 4 victory points if the number of enemy units destroyed by melee attacks made by **BLACK TEMPLARS** units from your army this battle round is greater than the number of **BLACK TEMPLARS** units from your army destroyed this battle round. You can score a maximum of 12 victory points per battle from this component.\r\r_End Game Component_\r\rAt the end of the battle, score 3 victory points if any of the following conditions are satisfied:\r * You selected the Suffer Not the Unclean to Live vow before the battle, and the enemy **WARLORD** was destroyed by a melee attack made by a BLACK TEMPLARS CHARACTER unit from your army during the battle. \r * You selected the Uphold the Honour of the Emperor vow before the battle, and a BLACK TEMPLARS INFANTRY unit (excluding CHARACTER units) from your army that is not below Half-strength is in your opponent&apos;s  deployment zone at the end of the battle. \r * You selected the Abhor the Witch, Destroy the Witch vow before the battle, and one or more enemy PSYKER CHARACTER units were destroyed by a BLACK TEMPLARS unit from your army during the battle. \r * You selected the Accept Any Challenge, No Matter the Odds vow before the battle, and an enemy unit with a Starting Strength of 20 or more models or an enemy model with a Wounds characteristic of 20 or more was destroyed by a BLACK TEMPLARS unit from your army during the battle.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive and End Game Objective",
    "faction": "SM",
    "subfaction": "BT",
    "id": "f812bad1-4fe8-420f-b1cb-38314c46e31b"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "BLADE OF SANGUINIUS",
    "description": "If you select this objective, during the Resolve Pre-battle Abilities step of the mission, select one BLOOD ANGELS CHARACTER model from your army to issue the challenge, then select one CHARACTER model from your opponent&apos;s army to accept the challenge. Score 5 victory points at the end of the battle for each of the following conditions that have been satisfied: \r * The model that accepted the challenge is destroyed. \r * The model that accepted the challenge was destroyed as the result of a melee attack. \r * The model that accepted the challenge was destroyed as the result of an attack made by the model that issued the challenge. \r\r If the model that accepted the challenge is a Strategic Reserve or Reinforcement unit and is destroyed as a result of not arriving on the battlefield, all of the above conditions are considered to have been satisfied. If all three of these conditions are satisfied during the battle, your opponent immediately loses 1 Command point (to a minimum of 0).",
    "category": "PURGE THE ENEMY",
    "type": "End Game Objective",
    "faction": "SM",
    "subfaction": "BA",
    "id": "868ab840-e414-4efe-88f5-42135da5fc03"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "FURY OF THE LOST",
    "description": "At the end of the battle round: \r * Score 3 victory points if one enemy unit was destroyed by a DEATH COMPANY unit from your army this battle round. Score 4 victory points instead if two or more enemy units were destroyed by DEATH COMPANY units from your army this battle round. \r * Score 1 additional victory point if one or more DEATH COMPANY units from your army were destroyed by enemy unit&apos;s this battle round.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "BA",
    "id": "f8885722-2898-49e8-9976-1a4d85e93489"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "DEATH FROM ABOVE",
    "description": "* At the end of your turn, score 3 victory points if any enemy units were destroyed by a BLOOD ANGELS unit from your army that was set up on the battlefield in the Reinforcements step of any of your Movement phases during the battle. \r * If any of those enemy units were destroyed in the same turn in which that BLOOD ANGELS unit was set up, score 1 additional victory point. \r * If any of those enemy units were CHARACTER units, score 1 additional victory point.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "BA",
    "id": "5a74f35f-4947-4525-a38f-20945b47b1a8"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "RELENTLESS ASSAULT",
    "description": "At the end of your turn, score 4 victory points if there are more BLOOD ANGELS units from your army in your opponent&apos;s deployment zone than there are enemy units in your deployment zone.",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "BA",
    "id": "9f31e05d-fef6-442a-8734-2fba545c9200"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "MARTIAL INTERDICTION",
    "description": "If you select this objective, during the Resolve Pre-battle Abilities step of the mission, select one CHARACTER model from your opponent&apos;s army. At the end of the battle, score victory points as follows: \r * Score 3 victory points if the selected enemy model is destroyed. \r * Score 3 additional victory points if the selected enemy model was destroyed by a melee attack made by a DARK ANGELS model from your army. \r * Score 3 additional victory points if the selected enemy model was destroyed by a melee attack made by an INNER CIRCLE or DEATHWING model from your army. \r * Score 6 additional victory points if the unit of the DARK ANGELS model that destroyed the selected enemy model has not itself been destroyed.",
    "category": "PURGE THE ENEMY",
    "type": "End Game Objective",
    "faction": "SM",
    "subfaction": "DA",
    "id": "2fda5cf1-9f0c-4f18-af90-0eb8de18f9b4"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "DEATH ON THE WIND",
    "description": "Score 2 victory points each time an enemy unit is destroyed by a RAVENWING model from your army that moved 12&quot; or more during the Movement phase of that turn, or made a charge move that turn.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "DA",
    "id": "a7b0cd48-0157-4452-9afa-66ba9f79198c"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "STUBBORN DEFIANCE",
    "description": "In your first Command phase, select one objective marker that is not within your deployment zone. At the end of each of your Command phases, if you control that objective marker and a DARK ANGELS unit from your army with the Objective Secured ability is within range of it, score a number of victory points based on the consecutive number of your Command phases you have controlled that objective marker for and had that unit within range of it, as follows:\r\r **TABLE MISSING**",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "DA",
    "id": "fcc9b13b-cf1f-46a1-9f69-b654c68c637c"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "CULL ORDER",
    "description": "If you select this objective, during the Resolve Pre-battle Abilities step of the mission, select three Battlefield Roles (HQ, Troops, etc.) from the units in your opponent&apos;s army. If your opponent&apos;s army does not include at least three units with different Battlefield Roles, select as many Battlefield Roles as possible. \r\r At the end of the battle, for each Battlefield Role that was selected, score 4 victory points if every enemy unit in your opponents army with that Battlefield Role has been destroyed.",
    "category": "PURGE THE ENEMY",
    "type": "End Game Objective",
    "faction": "SM",
    "subfaction": "DW",
    "id": "ddb7b7ad-b40b-4e99-b343-5bb960bb1793"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "SUFFER NOT THE ALIEN",
    "description": "Score 1 victory point each time an enemy TYRANIDS, AELDARI, ORKS, Necrons or T&apos;AU EMPIRE unit is destroyed by a DEATHWATCH unit from your army.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "DW",
    "id": "d0184a60-c06e-4695-a09a-598ab4e52c64"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "THE LONG VIGIL",
    "description": "At the start of your Command phase, score 4 victory points if there are no enemy units (excluding AIRCRAFT units) wholly within your deployment zone and there is at least one DEATHWATCH unit (excluding AIRCRAFT units) from your army wholly within your deployment zone. You cannot score this secondary objective during the first battle round.",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "DW",
    "id": "e300cbb8-18ee-4e7c-ae03-75ac45845a17"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "CRIPPLE STRONGHOLD",
    "description": "If you select this objective, during the Resolve Pre-battle Abilities step of the mission, your opponent must select one objective marker on the battlefield not within their deployment zone to be the Stronghold objective marker (if the only objective marker on the battlefield is in the enemy&apos;s deployment zone, then this must be the Stronghold objective marker). \r\r If you select this objective, DEATHWATCH INFANTRY units from your army can attempt the following action: \r\r Cripple Stronghold (Action): One DEATHWATCH INFANTRY unit from your army can start to perform this action at the end of your Movement phase if it is within range of the Stronghold objective marker and you control that objective marker. This action is completed at the end of your turn provided the unit performing the action is still within range of the same objective marker. \r\r Each time a unit from your army completes this action, score 4 victory points and roll one D6: on a 6, your opponent loses 1 Command point (to a minimum of 0).",
    "category": "SHADOW OPERATIONS",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "DW",
    "id": "7de49e4d-0b8c-4308-8b72-d865de6574d8"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "DESTROY THE DAEMON",
    "description": "At the end of the battle, score victory points for each enemy unit destroyed by a GREY KNIGHTS unit from your army during the battle as follows: \r * DAEMON PRIMARCH unit - score 5 victory points. \r * Any other DAEMON MONSTER unit - score 3 victory points. \r * DAEMON VEHICLE unit - score 3 victory points \r * Any other DAEMON unit - score 1 victory point. \r\r At the end of the battle, reduce the number of victory points scored from this secondary objective by 1 for each DAEMON unit that is on the battlefield that is not below Half-strength. For the purposes of this secondary objective, units with a Starting Strength of 1 are considered to be below Half-strength at the end of the battle if their remaining number of wounds is less than half their starting Wounds characteristic.",
    "category": "PURGE THE ENEMY",
    "type": "End Game Objective",
    "faction": "GK",
    "id": "7df4a578-8744-4672-b4c2-d86b7e8f9edf"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "TELEPORT ASSAULT",
    "description": "At the end of the battle round, score 4 victory points if one or more enemy units were destroyed by a GREY KNIGHTS model from your army that was set up on the battlefield using the Teleport Strike ability, the Teleportation Shunt Stratagem or the Gate of Infinity psychic power this battle round",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "GK",
    "id": "709050ad-fad9-433a-8347-940977f33285"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "PURIFYING RITUAL",
    "description": "If you select this objective, GREY KNIGHTS PSYKER units from your army can attempt the following psychic action: \r\r Purifying Ritual (Psychic Action - Warp Charge 5): One or more GREY KNIGHTS PSYKER units from your army can attempt to perform this psychic action in your Psychic phase. Each unit from your army that starts to perform this psychic action must be within range of a different objective marker you control that has not been purified by your army this turn. If this psychic action is completed, that objective marker is said to have been purified by your army this turn. \r\r At the end of your turn, score victory points depending on the number of objective markers purified by your army this turn, as shown in the table below.\r\r **TABLE MISSING**",
    "category": "WARPCRAFT",
    "type": "Progressive Objective",
    "faction": "GK",
    "id": "077733af-decf-40fd-b778-d8c5c4288d9d"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "BOLSTER BARRICADES",
    "description": "If you select this objective, IMPERIAL FISTS units from your army can attempt the following action:\r\r Bolster Barricades (Action): One IMPERIAL FISTS CORE INFANTRY unit from your army can start to perform this action at the end of your Movement phase if it is within range of an objective marker you control that has not been barricaded by your army (see below). The action is completed at the start of your next Command phase or at the end of the battle (whichever comes first), provided the unit performing it is still within range of the same objective marker. If completed, that objective marker is said to have been barricaded by your army.\r\r Each time a unit from your army completes this action: \r * If the objective marker that was barricaded by that action was within your deployment zone, score 1 victory point. \r * If the objective marker that was barricaded by that action was not within either player&apos;s deployment zone, score 4 victory points. \r * Until the end of the battle, each time an enemy unit makes an attack that targets an IMPERIAL FISTS INFANTRY unit from your army that is wholly within 6&quot; of an оbiective marker that has been barricaded by your army, that unit receives the benefits of Light Cover and Heavy Cover against that attack.",
    "category": "SHADOW OPERATIONS",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "IF",
    "id": "909e5d06-35ab-49d6-85f7-48cedf3384ad"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "DUEL OF HONOUR",
    "description": "If you select this objective, during the Resolve Pre-battle Abilities step of the mission, identify the enemy WARLORD. and the two units from your opponent&apos;s army that have the highest points value (excluding the enemy WARLORD), and make a note of them on your army roster (if two or more units are tied, your opponent can choose between them). If your opponent&apos;s army has three or fewer units, then you instead identify all the units in your opponent&apos;s army. A unit&apos;s points value includes the points of all weapons, wargear and upgrades it has. \r\r At the end of the battle, for each identified enemy unit that is destroyed, you score a number of victory points if that unit was destroyed during the battle by an IMPERIAL KNIGHTS unit from your army. If a unit splits into several smaller units during the battle, all of those separate units must be destroyed for the original unit to count as being destroyed for the purposes of this secondary objective. \r\r The number of victory points scored depends on how the enemy unit was destroyed, as shown in the table below. \r\r TABLE MISSING \r\r At the end of any battle round in which Honour to the King or Personal Combat was achieved, you gain 1 Honour point. \r\r At the end of the battle, if the enemy **WARLORD** is destroyed, you score 1 additional victory point. \r\r At the end of the battle, you must reduce the number of victory points you have scored from this secondary objective by 1 for each of the identified units that has not been destroyed.",
    "category": "PURGE THE ENEMY",
    "type": "End Game Objective",
    "faction": "QI",
    "id": "9072f256-d4d7-40ad-80e2-6d42813901a3"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "HONOUR OF THE HOUSE",
    "description": "At the end of the battle round, if you have 6 Honour points or if you have more Honour points than you had at the start of the battle round, score 2 victory points. In addition, at the end of the battle: \r * Score 3 additional victory points if your army is Virtuous. \r * Score 2 additional victory points if your army is Honoured. \r * If your army is Dishonoured, reduce the number of victory points you have scored from this secondary objective by 3.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive and End Game Objective",
    "faction": "QI",
    "id": "b577fbc9-e3a6-4fd0-8d6b-7f0e29756118"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "YIELD NO GROUND",
    "description": "At the end of your turn, score 1 victory point for each of the following conditions you satisfy (for a maximum of 3 victory points): \r * You control half or more of the total number of objective markers on the battlefield, and one or more IMPERIAL KNIGHTS models from your army are within range of each of those objective markers. \r * No enemy units (excluding AIRCRAFT units) are wholly within your deployment zone. \r * No IMPERIAL KNIGHTS units from your army ended that turn closer to your battlefield edge than they were at the start of that turn, and no IMPERIAL KNIGHTS units from your army Fell Back that turn.",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "QI",
    "id": "40b6313d-34c2-442c-b35b-0fa39f2a0f2a"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "RENEW THE OATHS",
    "description": "If you select this objective, IMPERIAL KNIGHTS units from your army can attempt the following action: \r\r Renew the Oaths (Action): One IMPERIAL KNIGHTS model from your army can start to perform this action at the end of your Movement phase if it is within 6&quot; of the centre of the battlefield. This action is completed at the end of your turn provided the unit performing it is still within 6&quot; of the centre of the battlefield. \r\r Each time a unit from your army completes this action: \r * Score 3 victory points if the action was completed by a non-TITANIC model. \r * Score 4 victory points if the action was completed by a TITANIC model. \r * Score 1 additional victory point if the action was completed by a CHARACTER model. \r * Roll one D6: on a 4+, you gain 1 Honour point.",
    "category": "SHADOW OPERATIONS",
    "type": "Progressive Objective",
    "faction": "QI",
    "id": "8a3d38cd-e165-4613-9bfd-075fe2e9feea"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "COLD FURY",
    "description": "At the end of your turn, score 1 victory point for each of the following conditions you satisfy (for a maximum of 4 victory points): \r * One or more IRON HANDS VEHICLE units (excluding AIRCRAFT units) from your army are wholly within your opponent&apos;s deployment zone. \r * One or more IRON HANDS VEHICLE units (excluding AIRCRAFT units) from your army are wholly within 6&quot; of the centre of the battlefield. \r * One or more enemy units were destroyed by ranged attacks made by IRON HANDS VEHICLE units from your army this turn. \r * One or more enemy units were destroyed by melee attacks made by IRON HANDS VEHICLE units from your army this turn.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "IH",
    "id": "7b9db9bf-2a31-4ea7-96e4-c966ca4e3ac6"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "SECURE OR SABOTAGE",
    "description": "If you select this objective, RAVEN GUARD units from your army can attempt the following action: \r\r Plant Explosives (Action): One or more RAVEN GUARD CORE INFANTRY units from your army can start to perform this action at the end of your Movement phase. Each unit from your army that starts to perform this action must be within range of a different objective marker you control that does not have explosives planted on it by your army (see below). The action is completed at the end of your turn. If completed, that objective marker is said to have explosives planted on it by your army. \r\r At the end of any player&apos;s turn, for each objective marker that has explosives planted on it by your army, if that objective marker is controlled by your opponent, you can perform a controlled explosion with it. If you do so, that objective marker is no longer said to have explosives planted on it by your army, and for each unit within range of that objective marker roll one D6: on a 2+, that unit suffers 3 mortal wounds. You cannot perform a controlled explosion with an objective marker in the same turn it had explosives planted on it by your army. \r\r At the end of the battle, score 3 victory points for each objective marker that still has explosives planted on it by your army.",
    "category": "SHADOW OPERATIONS",
    "type": "End Game Objective",
    "faction": "SM",
    "subfaction": "RG",
    "id": "a5143be2-5ab8-4edd-bf86-4e36a374014c"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "THE PROMETHEAN CREED",
    "description": "In your first Command phase, select one objective marker that is not within your deployment zone. \r * At the end of each of your Command phases, if you control that objective marker and a SALAMANDERS CORE INFANTRY unit from your army is within range of it, score 2 victory points. \r * Each time an enemy unit is selected to shoot or fight, if it selects a SALAMANDERS INFANTRY unit from your army that is within range of that objective marker as the target of one or more of its attacks, but it does not destroy that unit as a result of those attacks, score 1 victory point (to a maximum of 3 victory points per turn). \r * At the end of each player&apos;s turn, if one or more enemy units were destroyed by attacks made by a SALAMANDERS INFANTRY unit from your army that turn while that SALAMANDERS INFANTRY unit was within range of that objective marker, score 1 victory point (score 2 victory points instead if one or more models in any of those destroyed units were destroyed as a result of attacks made with flame or melta weapons that turn).",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "SA",
    "id": "2ede1b25-ec1e-453d-9a47-4f8157337ab1"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "PURGE THE ENEMY",
    "description": "At the end of the battle, score victory points as follows: \r * Score 2 victory points (to a maximum of 5 victory points) for each enemy unit that was destroyed as the result of an attack made with a Heavy or Grenade weapon by an ADEPTUS ASTARTES unit from your army while the Devastator Doctrine was active for your army. \r * Score 1 victory point (to a maximum of 5 victory points) for each enemy unit that was destroyed as the result of an attack made with a Rapid Fire or Assault weapon by an ADEPTUS ASTARTES unit from your army while the Tactical Doctrine was active for your army. \r * Score 1 victory point (to a maximum of 5 victory points) for each enemy unit that was destroyed as the result of an attack made with a Pistol or Melee weapon by an ADEPTUS ASTARTES unit from your army while the Assault Doctrine was active for your army.",
    "category": "PURGE THE ENEMY",
    "type": "End Game Objective",
    "faction": "SM",
    "id": "6127895f-2b80-428e-b6d2-816bd1759ab6"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "OATHS OF MOMENT",
    "description": "At the end of the battle round, score victory points for achieving the following three Oaths: \r * Oath of Valour: Score 1 victory point if any CHARACTER, VEHICLE or MONSTER unit was destroyed by an ADEPTUS ASTARTES unit from your army this battle round. \r * Oath of Honour: Score 1 victory point provided no ADEPTUS ASTARTES units from your army failed a Morale test this battle round, and no ADEPTUS ASTARTES units from your army Fell Back this battle round. \r * Oath of Duty: Score 1 victory point if an ADEPTUS ASTARTES CORE or ADEPTUS ASTARTES CHARACTER unit from your army is wholly within 6&quot; of the centre of the battlefield.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "SM",
    "id": "fee25e39-4d78-4c76-81bc-5394cc1ebfa0"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "SHOCK TACTICS",
    "description": "At the end of your turn, score 3 victory points if you control one or more objective markers that were controlled by your opponent at the start of that turn, and an ADEPTUS ASTARTES unit from your army is within range of that objective marker.",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "SM",
    "id": "19afcbcf-ca28-4a0e-8909-fbb01e3a37d2"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "GLORY KILLS",
    "description": "At the end of the battle round, score victory points as follows (for a maximum of 5 victory points): \r * Score 2 victory points if any CHARACTER units were destroyed by a SPACE WOLVES unit from your army this battle round. If no CHARACTER units were destroyed, but a CHARACTER unit suffered 1 or more wounds as the result of attacks made by SPACE WOLVES units from your army this battle round, score 1 victory point instead. \r * Score 3 victory points if any MONSTER or VEHICLE units were destroyed by a SPACE WOLVES unit from your army this battle round. If no MONSTER or VEHICLE units were destroyed, but a MONSTER or VEHICLE unit suffered 1 or more wounds as a result of attacks made by SPACE WOLVES units from your army this battle round, score 1 victory point instead. \r\r A CHARACTER MONSTER or CHARACTER VEHICLE unit counts towards both parts of this objective. For example, if a SPACE WOLVES unit from your army destroyed a CHARACTER MONSTER unit, you would score 5 victory points as a result.",
    "category": "PURGE THE ENEMY",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "SW",
    "id": "02a3e2fd-ee0c-4ce3-8d67-37547a79b52b"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "HEROIC CHALLENGE",
    "description": "If you select this objective, during the Resolve Pre-battle Abilities step of the mission, select one SPACE WOLVES CHARACTER model from your army to issue the challenge, then select one CHARACTER model from your opponent&apos;s army to accept the challenge. Score 5 victory points at the end of the battle for each of the following conditions that have been satisfied: \r * The model that accepted the challenge is destroyed. \r * The model that accepted the challenge was destroyed as the result of a melee attack. \r * The model that accepted the challenge was destroyed as the result of an attack made by the model that issued the challenge. \r\r If the model that accepted the challenge is a Strategic Reserve or Reinforcement unit and is destroyed as a result of not arriving on the battlefield, all of the above conditions are considered to have been satisfied. If all three of these conditions are satisfied during the battle, you immediately gain 1 Command point.",
    "category": "PURGE THE ENEMY",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "SW",
    "id": "3d331c21-c344-4db0-aecc-b828c8c6a97f"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "A MIGHTY SAGA",
    "description": "At the end of the battle round, score 2 victory points for each of the following achieved by your SPACE WOLVES **WARLORD** (to a maximum of 5 victory points per battle round): \r * An enemy CHARACTER, MONSTER or VEHICLE unit lost any wounds as the result of a melee attack made by your **WARLORD** this battle round. \r * 5 or more models were destroyed as the result of attacks made by your **WARLORD** this battle round. \r * An enemy unit was destroyed as the result of an attack made by your **WARLORD** this battle round. \r * Your **WARLORD** is within range of an objective marker you control that is not within your deployment zone.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "SW",
    "id": "c547976a-12ee-4491-b9c8-cdbc7a8f6f44"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "WARRIOR PRIDE",
    "description": "At the end of your turn, score 3 victory points if two or more SPACE WOLVES units from your army are within Engagement Range of any enemy units or completed a charge move this turn, and neither of those units are within your deployment zone.",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "SW",
    "id": "daa91a79-bd68-4bc6-b1f2-ed09e630b403"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "WE MARCH FOR MACRAGGE",
    "description": "If you select this objective, ULTRAMARINES CORE INFANTRY units from your army can attempt the following action: \r\r Claimed for Macragge (Action): One or more ULTRAMARINES CORE INFANTRY units from your army can start to perform this action at the end of your Movement phase. Each unit from your army that starts to perform this action must be within range of a different objective marker you control that is not within your deployment zone and has not been claimed for Macragge by your army. The action is completed at the start of your next Command phase or at the end of the battle (whichever comes first). If completed, that objective marker is said to have been claimed for Macragge by your army. \r\r Score 4 victory points each time a unit from your army completes this action.",
    "category": "SHADOW OPERATIONS",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "UL",
    "id": "cc437607-e942-4a37-97be-d1b5c591f7ee"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "LIGHTNING STRIKE",
    "description": "At the end of your turn: \r * Score 3 victory points for each enemy CHARACTER or MONSTER unit that was destroyed by a melee attack made by a WHITE SCARS unit from your army that made a charge move this turn. \r * Score 1 victory point for each other enemy unit that was destroyed by a melee attack made by a WHITE SCARS unit from your army that made a charge move this turn. \r * Score 1 victory point for each enemy unit that was destroyed by a ranged attack made by a WHITE SCARS unit from your army that Advanced this turn. \r\r You can score a maximum of 5 victory points per battle round from this secondary objective.",
    "category": "PURGE THE ENEMY",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "WS",
    "id": "0b5c1e7d-85c4-4b5a-9de6-c915695cef2d"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "INFILTRATE AND SUBVERT",
    "description": "If you select this objective, ALPHA LEGION INFANTRY units from your army can attempt the following action: \r\r Subvert (Action): One ALPHA LEGION INFANTRY unit (excluding CHARACTER units) from your army can start to perform this action at the end of your Movement phase if it is wholly within 6&quot; of your opponent&apos;s deployment zone. The action is completed at the end of your next Command phase, provided the unit performing it is still wholly within 6&quot; of your opponent&apos;s deployment zone. If completed, if the unit that performed the action is within range of an objective marker, roll one D6 to see if that objective marker has been subverted. If that unit was a CULTISTS unit, on a 5+ that objective marker is said to have been subverted by your army; otherwise, on a 3+ that objective marker is said to have been subverted by your army. Enemy units can never control objective markers that have been subverted by your army, and can never perform actions while they are within range of any objective markers that have been subverted by your army. \r\r Each time a unit from your army completes this action, score 3 victory points. Score 4 victory points instead if that unit completed this action while wholly within your opponent&apos;s deployment zone.",
    "category": "SHADOW OPERATIONS",
    "type": "Progressive Objective",
    "faction": "CSM",
    "subfaction": "AL",
    "id": "d6989f86-1e20-49fc-b235-3aba78a183ed"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "DESPOIL DOMINIONS",
    "description": "If you select this objective, BLACK LEGION INFANTRY and BLACK LEGION BIKER units from your army can attempt the following action: \r\r Despoil Dominions (Action): One BLACK LEGION INFANTRY or BLACK LEGION BIKER unit from your army can start to perform this action at the end of your Movement phase if it is within range of an objective marker that has not already been despoiled by your army (see below). A unit cannot start this action while there are any enemy units (excluding AIRCRAFT units) within range of the same objective marker. The action is completed at the start of your next Command phase or at the end of the battle (whichever comes first), provided the unit performing it is still within range of the same objective marker. If completed, that objective marker is said to have been despoiled by your army, and until the end of the battle, each time an enemy unit starts to perform an action while it is within range of that despoiled objective marker, roll one D6: on a 4+, that action immediately fails. \r\r Each time a unit from your army completes this action, if the objective marker that was despoiled by that action was wholly within your deployment zone, score 1 victory point; otherwise, score 4 victory points.",
    "category": "SHADOW OPERATIONS",
    "type": "Progressive Objective",
    "faction": "CSM",
    "subfaction": "BL",
    "id": "61707356-affb-4e2e-a811-c8271ac62521"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "NOURISHED BY TERROR",
    "description": " * Each time an enemy model flees the battlefield, score 1 victory point.\r * Each time an enemy unit is destroyed by a CHAOS DAEMONS unit from your army (excluding HERETIC ASTARTES units), before removing the last model in that destroyed unit from the battlefield, roll 2D6: if the result equals or exceeds the Leadership characteristic of that enemy model, score 1 victory point. A unit can, if it is resurrected for any reason (i.e. it was destroyed and subsequently returned to the battlefield), potentially contribute victory points due to this secondary objective several times (assuming it is resurrected and subsequently destroyed several times over, and your 2D6 result equals or exceeds that model&apos;s Leadership characteristic each time).",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "CD",
    "id": "f88956d3-6e81-4feb-9688-13baef70e42c"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "REALITY REBELS",
    "description": "At the end of your turn: \r * Score 1 victory point for each table quarter that has one or more CHAOS DAEMONS units from your army (excluding HERETIC ASTARTES units) wholly within it, provided your opponent does not have more units wholly within the same table quarter. For the purposes of this bullet point, exclude any units that are within 6&quot; of the centre of the battlefield. \r * Score 1 victory point if one or more CHAOS DAEMONS units from your army (excluding HERETIC ASTARTES units) are wholly within 6&quot; of the centre of the battlefield.",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "CD",
    "id": "a9a4392b-d8b8-4482-b1be-02eed570ec23"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "DESPOILERS OF REALITY",
    "description": "If you select this objective, CHAOS DAEMONS INFANTRY units from your army (excluding HERETIC ASTARTES units) can attempt the following action:\r\r **Dark Ritual (Action):** One or more CHAOS DAEMONS INFANTRY units from your army (excluding HERETIC ASTARTES units) can start to perform this action at the end of your Movement phase. Each unit from your army that starts to perform this action must be within range of a different objective marker you control that is not within your deployment zone and has not been corrupted by your army (see below). The action is completed at the start of your next Command phase or at the end of the battle (whichever comes first). If completed, that objective marker is said to have been corrupted by your army. \r\r Score 4 victory points each time a unit from your army completes this action.",
    "category": "SHADOW OPERATIONS",
    "type": "Progressive Objective",
    "faction": "CD",
    "id": "c0aae86a-1cf7-403d-9bb5-122a9cd0746d"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "A FITTING CHALLENGE",
    "description": "If you select this objective, during the Resolve Pre-battle Abilities step of the mission, identify which three units from your opponent&apos;s army have the highest points value, and make a note of them (if two or more units are tied, your opponent can choose between them). If your opponent&apos;s army has three or fewer units, then you instead identify all the units in your opponent&apos;s army. A unit&apos;s points value includes the points of all weapons, wargear and upgrades it has. \r\r At the end of the battle round, score a number of victory points for each identified unit that was destroyed during the battle by a CHAOS KNIGHTS unit from your army (to a maximum of 6 victory points per battle round). If a unit splits into several smaller units during the battle, all of those separate units must be destroyed for the original unit to count as being destroyed for the purposes of this secondary objective. \r\r The number of victory points scored depends on the battle round during which each unit was destroyed, as shown in the table below.\r\r *TABLE MISSING* \r\r At the end of the battle, reduce the number of victory points you have scored from this secondary objective by 1 for each of the identified units that has not been destroyed. If a unit was destroyed, but was then resurrected or otherwise returned to the battlefield and subsequently destroyed again, then for the purposes of this secondary objective it was destroyed during the battle round in which it was last removed from the battlefield.",
    "category": "PURGE THE ENEMY",
    "type": "Progressive and End Game Objective",
    "faction": "QT",
    "id": "34f2fc67-2478-41b1-93bb-6465800e9325"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "PATH OF DESTRUCTION",
    "description": "At the end of the battle round, score 1 victory point for each of the following conditions that were satisfied that battle round (for a maximum of 3 victory points):\r * One or more enemy units were destroyed by a CHAOS KNIGHTS model from your army while that CHAOS KNIGHTS model was wholly within your deployment zone.\r * One or more enemy units were destroyed by a CHAOS KNIGHTS model from your army while that CHAOS KNIGHTS model was more than 3&quot; away from either player&apos;s deployment zone. \r * One or more enemy units were destroyed by a CHAOS KNIGHTS model from your army while that CHAOS KNIGHTS model was wholly within your opponent&apos;s deployment zone.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "QT",
    "id": "fb3fd761-7036-4648-91e2-522e4a670045"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "RUTHLESS TYRANNY",
    "description": "At the end of your turn: \r * Score 2 victory points if you control half or more of the total number of objective markers on the battlefield and one or more CHAOS KNIGHTS models from your army are within range of each of those objective markers. \r * Score 1 victory point if half or more of the total number of objective markers on the battlefield are within Dread range of one or more CHAOS KNIGHTS models from your army. \r * Score 1 victory point if every objective marker on the battlefield is within Dread range of one or more CHAOS KNIGHTS models from your army.",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "QT",
    "id": "854f28c4-1926-4599-9486-36591fae091b"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "STORM OF DARKNESS",
    "description": "If you select this objective, CHAOS KNIGHTS units from your army can attempt the following action: \r\r **Storm of Darkness (Action):** One CHAOS KNIGHTS unit from your army can start to perform this action at the end of the Morale phase if it is within range of an objective marker that has not already been cursed by your army (see below). A unit cannot start this action while there are any enemy units (excluding AIRCRAFT units) within range of the same objective marker. The action is completed at the end of your next Psychic phase, provided the unit performing it is still within range of the same objective marker. If completed, that objective marker is said to have been cursed by your army, and until the end of the battle, while a non-CHAOS unit is within 6&quot; of that objective marker, subtract 1 from the Leadership characteristic of models in that unit.\r\rScore 3 victory points each time a unit from your army completes this action.",
    "category": "SHADOW OPERATIONS",
    "type": "Progressive Objective",
    "faction": "QT",
    "id": "4070ccd4-9551-45dc-9c32-4aa284f5f336"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "RISE TO GLORY",
    "description": "At the end of the battle round, score 2 victory points for each CHARACTER, MONSTER or VEHICLE model destroyed that battle round by a melee attack made by a TRAITORIS ASTARTES CHARACTER model from your army. If such a destroyed model had a Wounds characteristic of 10-19, score 1 additional victory point for destroying that model, or 2 additional victory points for destroying that model if it had a Wounds characteristic of 20 or more or it was the enemy WARLORD. You can score a maximum of 5 victory points per battle round from this secondary objective.\r\rEach time a CHARACTER, MONSTER or VEHICLE model is destroyed by a melee attack made by a TRAITORIS ASTARTES CHARACTER model from your army, roll 2D6. If the result is less than the Wounds characteristic of the destroyed model, gain 1 Command point at the end of the phase.",
    "category": "PURGE THE ENEMY",
    "type": "Progressive Objective",
    "faction": "CSM",
    "id": "97c28224-29a4-47b7-8ff6-d46938ee83b9"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "THE LONG WAR",
    "description": "At the end of your turn: \r * Score 1 victory point for each enemy unit that was destroyed by a TRAITORIS ASTARTES unit from your army this turn and was within range of an objective marker at the start of this turn. \r * Score 2 victory points if you control any objective markers that were controlled by your opponent at the start of this turn and a TRAITORIS ASTARTES unit from your army is within range of any of those objective markers. \r\r You can score a maximum of 3 victory points per turn from this secondary objective.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "CSM",
    "id": "80602ec9-90b7-4723-8358-e5c94fde51fc"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "FOR THE DARK GODS",
    "description": "If you select this objective, keep a For the Dark Gods tally; add 1 to that tally each time a unit from your army dedicates a table quarter to a Chaos God by performing the following action: \r\r **For the Dark Gods (Action):** One TRAITORIS ASTARTES INFANTRY or TRAITORIS ASTARTES BIKER unit from your army can start to perform this action at the end of your Movement phase if it is wholly within a table quarter that has not been dedicated to a Chaos God by your army (see below) and it is within 3&quot; of the centre of that table quarter. If the unit performing this action had the Objective Secured ability when it started performing this action, the action is completed at the end of your turn; otherwise, the action is completed at the start of your next Command phase. In any case, the action is only completed if the unit performing it is still within 3&quot; of the centre of the same table quarter. If completed, select either Khorne, Tzeentch, Nurgle or Slaanesh to dedicate that table quarter to. If this action is completed by a KHORNE, TZEENTCH, NURGLE or SLAANESH unit, that unit can only dedicate that table quarter to their patron deity (e.g. a KHORNE unit can only dedicate a table quarter to Khorne). That table quarter is said to have been dedicated to that Chaos God by your army. The same table quarter cannot be dedicated to more than one Chaos God by your army. \r\r If a table quarter has been dedicated to a Chaos God by your army, then while a TRAITORIS ASTARTES unit from your army is wholly within that table quarter, add 2 to the Leadership characteristic of that unit, unless that Chaos God is not their patron deity (e.g. if a table quarter is dedicated to KHORNE, then TZEENTCH, NURGLE and SLAANESH units do not receive this bonus). \r\r At the end of the battle, score 2 victory points if your For the Dark Gods tally is 1; score 5 victory points if that tally is 2; score 9 victory points if that tally is 3; score 14 victory points if that tally is 4.",
    "category": "SHADOW OPERATIONS",
    "type": "End Game Objective",
    "faction": "CSM",
    "id": "d3dee173-7c11-4be4-89da-e492eee23377"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "SPECIMENS FOR THE SPIDER",
    "description": "At the end of the battle round: \r * Score 3 victory points if one or more CHARACTER or MONSTER units were destroyed by a melee attack made by a CREATIONS OF BILE model from your army this battle round. \r * Score 2 victory points if one or more units (excluding CHARACTER, MONSTER or VEHICLE units) were destroyed by a melee attack made by a CREATIONS OF BILE model from your army this battle round. \r\r At the end of the battle, if one or more ADEPTUS ASTARTES, SANCTIC ASTARTES or HERETIC ASTARTES units were destroyed by a melee attack made by a CREATIONS OF BILE model from your army during the battle, score 1 additional victory point.",
    "category": "PURGE THE ENEMY",
    "type": "Progressive and End Game Objective",
    "faction": "CoB",
    "id": "75357da4-b171-48aa-b2a8-b92e04cb9ada"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "FLEEING VECTORS",
    "description": "* At the end of each player&apos;s turn, score 1 victory point if seven or more enemy models were destroyed by attacks made by DEATH GUARD models from your army that turn. If seven or more of those enemy models were destroyed by attacks made with plague weapons that turn, score 1 additional victory point.\r * At the end of each Morale phase, score 2 victory points if one or more enemy units failed a Morale test that phase. If any of those enemy units had one or more models destroyed by attacks made with plague weapons this turn, score 1 additional victory point.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "DG",
    "id": "0ca7a839-66d9-4498-a585-bceefb0d9fde"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "DESPOILED GROUND",
    "description": "At the end of the battle, score 3 victory points for each of the following conditions you satisfy:\r * One or more DEATH GUARD units from your army are wholly within your opponent&apos;s deployment zone and one or more DEATH GUARD units from your army are wholly within your deployment zone.\r * One or more DEATH GUARD units from your army are wholly within three different table quarters, and those units are all more than 6&quot; from any other table quarter. \r * One or more DEATH GUARD units from your army are wholly within four different table quarters, and those units are all more than 6&quot; from any other table quarter.\r * You control half or more of the total number of objective markers on the battlefield and there are DEATH GUARD units from your army within range of each of those objective markers. \r * Every objective marker on the battlefield is within Contagion range of one or more Contagion abilities that DEATH GUARD units from your army have.",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "End Game Objective",
    "faction": "DG",
    "id": "3d66d19a-ba2d-4605-923a-8815517bd8b5"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "SPREAD THE SICKNESS",
    "description": "If you select this objective, DEATH GUARD INFANTRY units from your army can attempt the following action:\r\r **Spread the Sickness (Action):** One DEATH GUARD INFANTRY unit from your army can start to perform this action at the end of your Movement phase if it is within range of an objective marker you control that has not been contaminated by your army (see below). The action is completed at the end of your turn. If completed, if the unit that performed the action has the Objective Secured ability, that objective marker is said to have been contaminated by your army. Otherwise, roll one D6: on a 4+, that objective marker is said to have been contaminated by your army. \r\r Score 3 victory points each time an objective marker in your deployment zone is contaminated by your army, and score 4 victory points each time an objective marker not in your deployment zone is contaminated by your army.",
    "category": "SHADOW OPERATIONS",
    "type": "Progressive Objective",
    "faction": "DG",
    "id": "520fb567-e847-4b89-b744-eae5fa6f372c"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "ADORN THE CANVAS ECLECTIC",
    "description": "At the end of the battle round, score 1 victory point for each of the following conditions you satisfy: \r * You control more objective markers than your opponent. \r * More enemy units were destroyed by ranged attacks made by EMPEROR&apos;S CHILDREN units from your army this battle round than vice versa (i.e. the number of EMPEROR&apos;S CHILDREN units from your army that were destroyed by ranged attacks made by enemy units this battle round was lower than the number of enemy units destroyed by ranged attacks made by EMPEROR&apos;S CHILDREN units from your army this battle round). \r * More enemy units were destroyed by melee attacks made by EMPEROR&apos;S CHILDREN units from your army this battle round than vice versa.\r * More enemy CHARACTER units were destroyed by attacks made by EMPEROR&apos;S CHILDREN CHARACTER units from your army this battle round than vice versa.\r\r If all four of the above apply at the end of a battle round, score 1 additional victory point at the end of that battle round (for a maximum of 5 victory points per battle round).",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "CSM",
    "subfaction": "EC",
    "id": "fd34d7be-e797-4a53-b09b-8be3ab17ff5a"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "MASTERS OF DEMOLITION",
    "description": "If you select this objective, during the Resolve Pre-battle Abilities step of the mission, your opponent must set up three objective markers anywhere on the battlefield that are on ground level, not within 9&quot; of each other, and not within 6&quot; of any battlefield edge. These objective markers cannot be set up on terrain features with the Unstable Position terrain trait, and no more than one of them can be set up within 6&quot; of your opponent's deployment zone. If it is impossible to set up an objective marker, it is not set up. Each represents a demolition site, but does not count as an objective marker for any rules purposes other than for this objective. IRON WARRIORS INFANTRY units from your army can attempt the following action: \r\r **Total Demolition (Action):** One IRON WARRIORS INFANTRY unit (excluding CHARACTER units) from your army can start to perform this action at the start of your Movement phase if it is within range of a demolition site objective marker and no enemy units (excluding AIRCRAFT units) are within range of that objective marker. This action is completed at the end of the turn, provided the unit performing it is still within range of the same objective marker. If completed, that objective marker is said to have been demolished by your army, and is removed from the battlefield. \r\r At the end of the battle, score 4 victory points for each demolition site objective marker that was demolished by your army. Score an additional 3 victory points if a demolition site objective marker that was within 6&quot; of your opponent&apos;s deployment zone was demolished by your army.",
    "category": "SHADOW OPERATIONS",
    "type": "End Game Objective",
    "faction": "CSM",
    "subfaction": "IW",
    "id": "3305dbb1-a791-4414-8b5a-2e924e97d5b7"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "SOW THE SEED, REAP THE FEAR",
    "description": "If you select this objective, score 1 victory point each time one of the following happens: \r * An enemy unit fails a Morale test. \r * An enemy unit Falls Back. \r * An enemy unit fails an action. \r\r In addition, each time an enemy unit is destroyed by a melee attack made by a NIGHT LORDS model from your army, before removing the last model in that enemy unit from the battlefield, roll 2D6: if the result equals or exceeds the Leadership characteristic of that enemy model, score 1 victory point. \r\r A model can, if it is resurrected for any reason (i.e. it was destroyed and subsequently returned to the battlefield), potentially contribute victory points due to this secondary objective several times (assuming it is resurrected and subsequently destroyed several times over, and your 2D6 result equals or exceeds that model&apos;s Leadership characteristic each time).",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "CSM",
    "subfaction": "NL",
    "id": "b8c86ee8-a51a-4737-a918-d9e6afa21df8"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "RAID AND REAVE",
    "description": "If you select this objective, RED CORSAIRS INFANTRY and RED CORSAIRS BIKER units from your army can attempt the following action: \r\r **Raid and Reave (Action):** One or more RED CORSAIRS INFANTRY or RED CORSAIRS BIKER units from your army can start to perform this action at the end of your Movement phase. Each unit from your army that starts to perform this action must be within range of a different objective marker that has not been raided by your army (see below). A unit cannot start this action while there are any enemy units (excluding AIRCRAFT units) within range of the same objective marker. The action is completed at the start of your next Command phase or at the end of the battle (whichever comes first), provided the unit performing it is still within range of the same objective marker. If completed, that objective marker is said to have been raided by your army, and until the end of the battle the unit that performed the action is said to be carrying spoils of war. \r\r Each time a unit from your army completes this action, if the objective marker that was raided as a result was wholly within your deployment zone, score 1 victory point; if that objective marker was wholly within your opponent&apos;s deployment zone, score 3 victory points; otherwise, score 2 victory points. \r\r At the end of the battle, score 1 victory point for each RED CORSAIRS unit from your army that is carrying spoils of war (score 2 victory points instead if that unit, or a TRANSPORT model it is embarked within, is wholly within your deployment zone).",
    "category": "SHADOW OPERATIONS",
    "type": "Progressive and End Game Objective",
    "faction": "CSM",
    "subfaction": "RC",
    "id": "fd13c7c5-7eee-4cc0-bcd3-88666ee00a38"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "SORCEROUS PROWESS",
    "description": "At the end of the battle: \r * Score 5 victory points for each enemy PSYKER CHARACTER unit that was destroyed in the Psychic phase by a THOUSAND SONS PSYKER unit from your army. \r * Score 3 victory points for each other enemy PSYKER unit that was destroyed in the Psychic phase by a THOUSAND SONS PSYKER unit from your army. \r * Score 2 victory points for each other enemy unit that was destroyed in the Psychic phase by a THOUSAND SONS PSYKER unit from your army.",
    "category": "PURGE THE ENEMY",
    "type": "End Game Objective",
    "faction": "TS",
    "id": "05a20a27-ceb9-4b77-a8b5-175e9be3504b"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "WRATH OF MAGNUS",
    "description": "You can only select this objective if your opponent's army includes one or more PSYKER units. At the end of the battle round, score 1 victory point for each of the following conditions that have been satisfied: \r * THOUSAND SONS PSYKER units from your army manifested at least one Witchfire power this battle round, and manifested more Witchfire powers than enemy units did this battle round. \r * THOUSAND SONS PSYKER units from your army manifested at least one Blessing power this battle round, and manifested more Blessing powers than enemy units did this battle round. \r * THOUSAND SONS PSYKER units from your army manifested at least one Malediction power this battle round, and manifested more Malediction powers than enemy units did this battle round. \r\r Psychic powers manifested by MAGNUS THE RED do not count towards this secondary objective.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "TS",
    "id": "5a978cf8-d294-484d-b132-3bd875d5e127"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "MUTATE LANDSCAPE",
    "description": "If you select this objective, THOUSAND SONS PSYKER units from your army can attempt the following psychic action: \r\r **Mutate Landscape (Psychic Action - Warp Charge 4):** One PSYKER unit from your army can attempt to perform this psychic action in your Psychic phase if it is within range of an objective marker you control that has not yet been mutated by your army. If this psychic action is completed, that objective marker is said to have been mutated by your army. \r\r Score 3 victory points each time a unit from your army completes this psychic action.",
    "category": "WARPCRAFT",
    "type": "Progressive Objective",
    "faction": "TS",
    "id": "bcedd78a-e185-4768-b495-d8db2c5b4f7a"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "BURN EMPIRES",
    "description": "If you select this objective, THOUSAND SONS INFANTRY units from your army can attempt the following action: \r\r **Burn Empires (Action):** One or more THOUSAND SONS INFANTRY units (excluding CHARACTER units) from your army can start to perform this action at the end of your Movement phase. Each unit from your army that starts to perform this action must be within range of a different objective marker you control that is not within your deployment zone and has not been burned by your army (see below). The action is completed at the start of your next Command phase or at the end of the battle (whichever comes first). If completed, that objective marker is said to have been burned by your army. \r\r Score 4 victory points each time a unit from your army completes this action.",
    "category": "SHADOW OPERATIONS",
    "type": "Progressive Objective",
    "faction": "TS",
    "id": "aa7ccc61-c342-4a09-8349-1eb5a57d79fe"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "EXALT THE DARK GODS",
    "description": "If you select this objective, keep an Exalt the Dark Gods tally; add 1 to that tally each time a WORD BEARERS unit from your army completes the following action: \r\r **Exalt the Dark Gods (Action):** One WORD BEARERS INFANTRY unit from your army can start to perform this action at the end of your Movement phase if it is wholly within 6&quot; of the centre of the battlefield. WORD BEARERS PSYKER units can attempt to manifest psychic powers while performing this action without this action failing. If the unit performing this action is a WORD BEARERS ICON, WORD BEARERS DARK APOSTLE or WORD BEARERS MASTER OF POSSESSION unit, this action is completed at the end of your turn; otherwise, it is completed at the start of your next Command phase. In any case, the action is only completed if the unit performing it is still wholly within 6&quot; of the centre of the battlefield and no enemy units (excluding AIRCRAFT units) are wholly within 6&quot; of the centre of the battlefield. \r\r At the end of the battle, score 2 victory points if your Exalt the Dark Gods tally is 1; score 5 victory points if that tally is 2; score 9 victory points if that tally is 3; score 15 victory points if that tally is 4 or more.",
    "category": "SHADOW OPERATIONS",
    "type": "End Game Objective",
    "faction": "CSM",
    "subfaction": "WB",
    "id": "8f0371a3-6b44-4ae9-90ec-9b227908fd96"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "SKULLS FOR THE SKULL THRONE",
    "description": "If you select this objective, during the Resolve Pre-battle Abilities step of the mission, select one WORLD EATERS CHARACTER model from your army to issue the challenge, then select one CHARACTER model from your opponent&apos;s army to accept the challenge. Score 5 victory points at the end of the battle for each of the following conditions that have been satisfied: \r * The model that accepted the challenge is destroyed. \r * The model that accepted the challenge was destroyed as the result of a melee attack. \r * The model that accepted the challenge was destroyed as the result of an attack made by the model that issued the challenge. \r\r If the model that accepted the challenge is a Strategic Reserve or Reinforcement unit and is destroyed as a result of not arriving on the battlefield, all of the above conditions are considered to have been satisfied. If all three of these conditions are satisfied during the battle, you immediately gain 1 Command point.",
    "category": "PURGE THE ENEMY",
    "type": "End Game Objective",
    "faction": "CSM",
    "subfaction": "WE",
    "id": "3313e3b1-f792-4c58-886e-af5b81f47784"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "WRATH OF KHAINE",
    "description": "At the end of the battle round: \r * Score 1 victory point if one or more enemy units were destroyed by a ranged attack made by an ASPECT WARRIOR unit from your army this battle round. \r * Score 1 victory point if one or more enemy units were destroyed by a melee attack made by a different ASPECT WARRIOR unit from your army this battle round. \r * Score 2 additional victory points if both of the above bullet points were achieved this battle round.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "AE",
    "id": "ff26a6aa-597b-4fee-8f37-a239bd1e0090"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "SCRY FUTURES",
    "description": "If you select this objective, ASURYANI PSYKER units from your army can attempt the following psychic action: \r\r **Scry Futures (Psychic Action - Warp Charge 4):** One ASURYANI PSYKER unit from your army can attempt to perform this psychic action in your Psychic phase if it is within range of an objective marker you control that has not yet been scried by your army (see below). If this psychic action is completed, that objective marker is said to have been scried by your army. \r\r Score 3 victory points each time a unit from your army completes this psychic action.",
    "category": "WARPCRAFT",
    "type": "Progressive Objective",
    "faction": "AE",
    "id": "c9729951-eef1-4f64-81d0-86bd0b637010"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "THE HIDDEN PATH",
    "description": "If you select this secondary objective and your army contains a WEBWAY GATE unit, that unit cannot be set up within 6&quot; of your deployment zone. If your army does not contain a WEBWAY GATE unit, in your first Command phase, select one objective marker that is not within 6&quot; of your deployment zone. At the end of each of your Command phases: \r * If your army includes a WEBWAY GATE unit, score a number of victory points equal to the current battle round number if you control that WEBWAY GATE. You control it if there is one ASURYANI unit with the Objective Secured ability within 3&quot; of it, or if there are more ASURYANI models from your army within 3&quot; of it than there are enemy models (excluding WEBWAY GATE models). \r * If your army does not include a WEBWAY GATE unit, score a number of victory points equal to the current battle round number if you control the selected objective marker and an ASURYANI unit from your army is within range of that objective marker.",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "AE",
    "id": "85d4cb81-a063-4396-82eb-31fa146eb34e"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "SCOUT THE ENEMY",
    "description": "ASURYANI units from your army can attempt the following action: \r\r **Scout the Enemy (Action):** One ASURYANI unit from your army can start to perform this action at the end of your Movement phase if it is not within 6&quot; of your deployment zone. If the unit performing this action is a RANGERS unit, it is completed at the end of the turn; otherwise, it is completed at the start of your next Command phase or at the end of the battle (whichever comes first). If completed: \r * Score 2 victory points if the unit performing this action is not wholly within your opponent&quot;s deployment zone. \r * Score 4 victory points if the unit performing the action is wholly within your opponent&quot;s deployment zone.",
    "category": "SHADOW OPERATIONS",
    "type": "Progressive Objective",
    "faction": "AE",
    "id": "2fd00fc7-735f-4fea-a217-53e7af401af6"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "TAKE THEM ALIVE!",
    "description": "At the end of the battle round:\r * Score 3 victory points for each enemy CHARACTER or MONSTER unit that was destroyed by a melee attack made by a DRUKHARI unit from your army this battle round. \r * Score 1 victory point for each other enemy unit that was destroyed by a melee attack made by a DRUKHARI unit from your army this battle round. \r\r You can score a maximum of 5 victory points per battle round from this secondary objective.",
    "category": "PURGE THE ENEMY",
    "type": "Progressive Objective",
    "faction": "DRU",
    "id": "3f57b558-d188-4c2a-8915-835513578875"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "BEASTS FOR THE ARENAS",
    "description": "At the end of the battle, score 2 victory points for each enemy MONSTER, CAVALRY or BEAST unit that was destroyed by a melee attack made by a DRUKHARI unit from your army. For each of those enemy units that was destroyed by a <WYCH CULT> unit from your army, score 1 additional victory point, and for each of those enemy units that was a TITANIC unit, score 3 additional victory points.",
    "category": "PURGE THE ENEMY",
    "type": "End Game Objective",
    "faction": "DRU",
    "id": "d2ac53e9-151b-439a-93e8-201707b8f663"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "FEAR AND TERROR",
    "description": "Score 1 victory point each time one of the following happens: \r * An enemy unit fails a Morale test. \r * An enemy unit Falls Back. \r * An enemy unit fails an action. \r\r In addition, each time an enemy unit is destroyed by a melee attack made by a DRUKHARI model from your army, before removing the last model in that enemy unit from the battlefield, roll 2D6: if the result equals or exceeds the Leadership characteristic of that enemy model, score 1 victory point. A model can, if it is resurrected for any reason (i.e. it was destroyed and subsequently returned to the battlefield), potentially contribute victory points due to this secondary objective several times (assuming it is resurrected and subsequently destroyed several times over, and your 2D6 result equals or exceeds that models Leadership characteristic each time).",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "DRU",
    "id": "24a5c702-8a0d-4ab1-84fa-ed164db5462e"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "HERD THE PREY",
    "description": "At the end of your turn, score 1 victory point for each table quarter that does not have any enemy units (excluding AIRCRAFT units) wholly within it.",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "DRU",
    "id": "0169d344-1fa8-4147-a90b-6a43d4054293"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "AMBUSH",
    "description": "At the end of your turn, score victory points as follows (to a maximum of 4 victory points): \r * Score 1 victory point if one or more enemy units were destroyed this turn by units from your army while they had a crossfire marker. \r * Score 2 victory points if one or more enemy units were destroyed this turn by units from your army that were set up from ambush or from underground this turn. \r * Score 2 victory points if one or more enemy units were destroyed this turn as a result of a ranged attack made by a model from your army, and that enemy unit was Exposed when it was selected as the target of that attack. Note, that enemy unit must have been Exposed as specified here, rather than by any other means (e.g. the Priority Target ability).",
    "category": "PURGE THE ENEMY",
    "type": "Progressive Objective",
    "faction": "GC",
    "id": "9e1d39cd-47cc-4397-a0ea-68805fa49649"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "BROODSWARM",
    "description": "At the end of your turn, score 1 victory point for each of the following conditions you satisfy (for a maximum of 5 victory points): \r * You have more models on the battlefield than your opponent does. \r * You have more models within your opponent&apos;s deployment zone than your opponent does. \r * You have more models within your deployment zone than your opponent does. \r * You have more models on the battlefield that are within no man&apos;s land than your opponent does. \r * All four of the above bullet points apply.",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "GC",
    "id": "49d01d30-d4e6-4bc5-987e-8750f8008a9e"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "SABOTAGE CRITICAL LOCATION",
    "description": "If you select this objective, during the Resolve Pre-battle Abilities step of the mission, your opponent must place 2 critical location markers on the battlefield. Each must be more than 9&quot; away from any battlefield edge and more than 9&quot; away from their other critical location marker. If both players must place these markers, the players alternate doing so, starting with the Defender. \r\r If you select this objective, GENESTEALER CULTS and BROOD BROTHERS units from your army can attempt the following action: \r\r **Sabotage Critical Location (Action):** One or more GENESTEALER CULTS INFANTRY, BROOD BROTHERS INFANTRY or GENESTEALER CULTS BIKER units from your army (excluding CHARACTER units other than REDUCTUS SABOTEUR units) can start to perform this action at the end of the Move Units step of your Movement phase. Each unit from your army that starts to perform this action must be within range of a different one of your opponent&apos;s critical location markers that you control. The action is completed at the end of your turn, provided the unit performing it is still within range of the same critical location marker. If completed, you have sabotaged that critical location; remove it from the battlefield. \r\r Score victory points each time a unit from your army completes this action, as shown in the table below.\r\r *TABLE MISSING*",
    "category": "SHADOW OPERATIONS",
    "type": "Progressive Objective",
    "faction": "GC",
    "id": "72cbe669-3493-4fa0-aef5-bdcdcc139053"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "A DEADLY PERFORMANCE",
    "description": "At the end of your turn, score 3 victory points if two or more of the following conditions are satisfied: \r * You control an objective marker you did not control at the start of the turn and a HARLEQUINS unit from your army is within range of that objective marker.\r * A HARLEQUINS unit from your army is wholly within your opponent&apos;s deployment zone. \r * Two or more enemy units were destroyed by an attack made with a ranged weapon by a HARLEQUINS model from your army this turn. \r * Two or more enemy units were destroyed by an attack made with a melee weapon by a HARLEQUINS model from your army this turn.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "HAR",
    "id": "da758cab-60c5-4ff0-8b8b-609392878035"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "WEAVE VEIL",
    "description": "If you select this objective, SHADOWSEER units from your army can attempt the following psychic action: \r\r **Weave Veil (Psychic Action - Warp Charge 3):** One SHADOWSEER model from your army can attempt to perform this psychic action in your Psychic phase if it is within 18&quot; of an enemy unit that has not yet been veiled by your army (see below). If this psychic action is completed, select one enemy unit that has not yet been veiled by your army and is within 18&quot; of the SHADOWSEER model that completed this psychic action. That enemy unit is said to have been veiled by your army, and the warp charge value of this psychic action is increased by 1 for your army for the remainder of the battle. \r\r Score 3 victory points each time a unit from your army completes this psychic action.",
    "category": "WARPCRAFT",
    "type": "Progressive Objective",
    "faction": "HAR",
    "id": "9354c490-b9ad-4a3d-8b26-ce5271364c39"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "TAKE YOUR PLACES",
    "description": "If you select this objective, during the Resolve Pre-battle Abilities step of the mission, set up one additional objective marker in your opponent's deployment zone, then your opponent must set up one additional objective marker in your deployment zone and one additional objective marker within 6&quot; of the centre of the battlefield. These objective markers cannot be set up within 9&quot; of each other, within 6&quot; of a battlefield edge or within 1&quot; of another objective marker. These Take Your Places objective markers represent the positions your Harlequins must take up for their performance, but do not count as objective markers for any rules purposes other than for this secondary objective. \r * At the end of your turn, score 2 victory points if you control two of your Take Your Places objective markers and one or more HARLEQUINS units from your army are within range of each of those objective markers. \r * At the end of your turn, score 4 victory points instead if you control all three of your Take Your Places objective markers and one or more HARLEQUINS units from your army are within range of each of those objective markers.",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "HAR",
    "id": "9354c490-b9ad-4a3d-8b26-ce5271364c39"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "CODE OF COMBAT",
    "description": "At the end of the battle: \r * Score 3 victory points for each enemy unit that was destroyed by a ranged attack made by a NECRONS NOBLE unit from your army during the battle. \r * Score 4 victory points for each enemy unit that was destroyed by a melee attack made by a NECRONS NOBLE unit from your army during the battle. \r\r In addition, each time an enemy CHARACTER unit is destroyed by a melee attack made by a NECRONS NOBLE unit from your army, gain 1 Command point.",
    "category": "PURGE THE ENEMY",
    "type": "End Game Objective",
    "faction": "NEC",
    "id": "f35b8ffe-4bd1-4982-a94d-5520e69416b3"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "THE TREASURES OF AEONS",
    "description": "If you select this objective, during the Resolve Pre-battle Abilities step of the mission, your opponent must select 3 objective markers on the battlefield. When doing so, they cannot select objective markers that are in their deployment zone unless they have already selected all objective markers that are in no man's land. \r\r At the end of your turn, score victory points if you control one or more of those selected objective markers, as shown in the table below.\r\r *TABLE MISSING*",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "NEC",
    "id": "ad314790-83f2-4e51-9546-c6a12821eb92"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "PURGE THE VERMIN",
    "description": "At the end of your turn:\r * Score 1 victory point for each table quarter that has no enemy units (excluding AIRCRAFT units) wholly within it. \r * Score 1 victory point if there are no enemy units (excluding AIRCRAFT units) wholly within your deployment zone.",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "NEC",
    "id": "7afb7106-7e20-4343-aaf7-11bfaa37f66f"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "ANCIENT MACHINERIES",
    "description": "If you select this secondary objective, NECRONS CORE and NECRONS CANOPTEK units from your army can attempt the following action: \r\r **Awaken Ancient Machinery (Action):** At the end of your Movement phase, one NECRONS CORE or NECRONS CANOPTEK unit from your army can start to perform this action if it is within range of an objective marker you control that is not within your deployment zone and which has not already been awakened by your army (see below). If the unit performing this action has the Objective Secured ability, the action is completed at the end of your turn; otherwise, it is completed at the start of your next Command phase or at the end of the battle (whichever comes first). In any case, the action is only completed if the unit performing it is still within range of the same objective marker. If completed, that objective marker is said to have been awakened by your army. \r\r Score 4 victory points each time a unit from your army completes this action.",
    "category": "SHADOW OPERATIONS",
    "type": "Progressive Objective",
    "faction": "NEC",
    "id": "5ec94750-8cc7-4144-8005-fc7f5c9e73b4"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "DA BIGGEST AND DA BEST",
    "description": "At the end of the battle round, score 2 victory points for each of the following achieved by your ORKS WARLORD (to a maximum of 5 victory points per battle round): \r * An enemy CHARACTER, MONSTER or VEHICLE unit lost any wounds as the result of a melee attack made by your WARLORD this battle round. \r * 5 or more models were destroyed as the result of attacks made by your WARLORD this battle round. \r * An enemy unit was destroyed as the result of an attack made by your WARLORD this battle round. \r * Your WARLORD is within range of an objective marker you control that is not within your deployment zone.",
    "category": "PURGE THE ENEMY",
    "type": "Progressive Objective",
    "faction": "ORK",
    "id": "8e8196c2-ca76-4df3-ab18-7a12c900d168"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "STOMP'EM GOOD",
    "description": "At the end of the battle round: \r * Score 3 victory points if the number of enemy units destroyed by melee attacks made by ORKS units from your army this battle round is more than the number of non-GRETCHIN units from your army destroyed by melee attacks this battle round. \r * Score 1 additional victory point if the number of enemy units destroyed by melee attacks made by ORKS units from your army this battle round is at least 2 and is at least double the number of non-GRETCHIN units from your army destroyed by melee attacks this battle round.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "ORK",
    "id": "188d9cbe-4aa6-41c4-902d-f6c7a9f5f994"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "GREEN TIDE",
    "description": "At the end of your turn, score 1 victory point for each table quarter that contains 10 or more ORK models from your army (excluding models that are within 6&quot; of any other table quarter).",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "ORK",
    "id": "2e87af6b-459f-4302-9308-4d74f9aa6ff8"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "GET DA GOOD BITZ",
    "description": "If you select this secondary objective, ORKS CORE units from your army can attempt the following action: \r\r **Get da Good Bitz (Action):** At the end of your Movement phase, one or more ORKS CORE units from your army can start to perform this action. Each unit from your army that starts to perform this action must be within range of a different objective marker you control that is not in either player's deployment zone. If a LOOTAS or GRETCHIN unit is performing this action, it is completed at the end of your turn; otherwise, it is completed at the start of your next Command phase or at the end of the battle (whichever comes first). In any case, the action is only completed if the unit performing it is still within range of the same objective marker. \r\r Score 3 victory points each time a unit from your army completes this action (to a maximum of 5 victory points per battle round).",
    "category": "SHADOW OPERATIONS",
    "type": "Progressive Objective",
    "faction": "ORK",
    "id": "d87103cf-9c5b-4b4f-a920-e905ea9786a2"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "A CLEAN VICTORY",
    "description": "At the end of the battle round: \r * Score 1 victory point if one or more enemy units were destroyed by T'AU EMPIRE units from your army this battle round. \r * Score 3 victory points if three or more enemy units were destroyed by T'AU EMPIRE units from your army this battle round. \r\r If you selected the Mont'ka Tactical Philosophy at the start of the battle, you can only score victory points from this secondary objective at the end of battle rounds one, two and three. If you selected the Kauyon Tactical Philosophy at the start of the battle, you can only score victory points from this secondary objective at the end of battle rounds three, four and five.",
    "category": "NO MERCY, NO RESPITE",
    "type": "End Game Objective",
    "faction": "TAU",
    "id": "3ffb1d6a-79da-48b2-8273-8a6dd11b018c"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "DECISIVE ACTION",
    "description": "If you selected the Mont'ka Tactical Philosophy at the start of the battle, then at the end of your turn in battle rounds one, two and three, score 4 victory points if you control half or more of the total number of objective markers on the battlefield. \r\r If you selected the Kauyon Tactical Philosophy at the start of the battle, then at the end of your turn in battle rounds three, four and five, score 4 victory points if you control half or more of the total number of objective markers on the battlefield.",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "TAU",
    "id": "75eef954-c4dd-4b73-9ee8-c80687c7e592"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "AEROSPACE TARGETING RELAYS",
    "description": "If you select this objective, place an Aerospace Designation marker halfway along each battlefield edge. T'AU EMPIRE INFANTRY units from your army can attempt the following action:\r\r **Install Targeting Relay (Action):** One or more T'AU EMPIRE INFANTRY units from your army can start to perform this action at the end of your Movement phase. Each unit from your army that starts to perform this action must be within 6&quot; of a different Aerospace Designation marker that has not had a targeting relay installed at it by your army (see below). If a FIRE WARRIOR TEAM unit is performing this action, it is completed at the end of your turn; otherwise, it is completed at the start of your next Command phase or at the end of the battle (whichever comes first). If completed, that Aerospace Designation marker is said to have had a targeting relay installed at it by your army.\r\rAt the end of the battle, score a number of victory points based on how many targeting relays were installed by your army, as shown in the table below.",
    "category": "SHADOW OPERATIONS",
    "type": "End Game Objective",
    "faction": "TAU",
    "id": "fae86280-2758-4a3d-bc7b-6d637c3f0383"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "CRANIAL FEASTING",
    "description": "Each time an enemy CHARACTER model or unit champion is destroyed by a melee attack made by a HIVE TENDRIL model from your army, roll one D6, adding 2 to the result if that HIVE TENDRIL model has the FEEDER TENDRILS keyword, and adding 2 to the result if the destroyed model has the CHARACTER keyword: on a 6+, you gain 1 Command point. \r\r At the end of the battle: \r * Score 3 victory points if you gained 1 or more Command points during the battle due to this secondary objective. \r * Score 1 victory point for each enemy unit champion that is destroyed, if it was destroyed by a melee attack made by a HIVE TENDRIL model from your army. \r * Score 3 victory points for each enemy CHARACTER unit that is destroyed, if it was destroyed by a melee attack made by a HIVE TENDRIL model from your army. \r * Score an additional 3 victory points if the enemy WARLORD is destroyed, if it was destroyed by a melee attack made by a FEEDER TENDRILS model from your army.",
    "category": "PURGE THE ENEMY",
    "type": "End Game Objective",
    "faction": "TYR",
    "id": "b986b69e-04db-41db-bb57-6c68149fd446"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "SYNAPTIC INSIGHT",
    "description": "If you select this objective, keep a Synaptic Kill points tally. Reset your Synaptic Kill points tally to 0 at the start of each battle round. Each time an enemy model is destroyed by a SYNAPSE model from your army: \r * If that enemy model had a Wounds characteristic of 3-5, gain 1 Synaptic Kill point. \r * If that enemy model had a Wounds characteristic of 6-9, gain 2 Synaptic Kill points. \r * If that enemy model had a Wounds characteristic of 10 or more, gain 3 Synaptic Kill points. \r\r At the end of the battle round, score 3 victory points if your Synaptic Kill points tally is 4 or more. You can score a maximum of 12 victory points per battle from this secondary objective.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "TYR",
    "id": "c959c15e-4697-43ad-b943-ab5167b5f507"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "SPORE NODES",
    "description": "If you select this objective, HIVE TENDRIL Troops units from your army can attempt the following action: \r \r **Seed Spore Node (Action):** One HIVE TENDRIL Troops unit from your army can start to perform this action at the end of your Movement phase from the second battle round onwards if it is within 6&quot; of your opponent's deployment zone and not within 6&quot; of any Spore Node objective markers (see below). The action is completed at the end of your turn. If completed, place one objective marker anywhere within 1&quot; of the unit that completed this action. This objective marker represents a Spore Node, but does not count as an objective marker for any rules purposes other than for this secondary objective. \r\r Score 4 victory points each time a unit from your army completes this action.",
    "category": "SHADOW OPERATIONS",
    "type": "Progressive Objective",
    "faction": "TYR",
    "id": "0e14a3e5-9d6b-49c9-84d7-a141fbe46805"
  }
]
