[
  {
    "cardType": "secondary",
    "source": "basic",
    "description": "Score 3 victory points at the end of the battle for each enemy **CHARACTER** unit that is destroyed. At the end of the battle, if the enemy WARLORD is destroyed, score 1 extra victory point.",
    "faction": "basic",
    "id": "2cfbcd09-62f3-46e8-98ca-0a47710400a1",
    "name": "ASSASSINATION",
    "type": "End Game Objective",
    "category": "PURGE THE ENEMY"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "BRING IT DOWN",
    "description": "At the end of the battle, score victory points for each enemy **MONSTER** or **VEHICLE** model that is destroyed, as follows:\r * Score 1 victory point for each of those destroyed models with a Wounds characteristic of 9 or less. * Score 2 victory points for each of those destroyed models with a Wounds characteristic of 10-14. * Score 3 victory points for each of those destroyed models with a Wounds characteristic of 15-19. * Score 4 victory points for each of those destroyed models with a Wounds characteristic of 20 or more.",
    "category": "PURGE THE ENEMY",
    "type": "End Game Objective",
    "faction": "basic",
    "id": "5a9ed34b-bd69-4c6c-80a1-015d8712589c"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "GRIND THEM DOWN",
    "description": "Score 3 victory points at the end of the battle round if more enemy units than friendly units were destroyed this battle round.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "basic",
    "id": "e29a6831-d33a-4b65-8418-b23c54d009cc"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "NO PRISONERS",
    "description": "If you select this objective, keep a Kill Points tally. Each time an enemy model is destroyed (excluding **VEHICLE**, **MONSTER** or **CHARACTER** models), add a number of marks to this tally equal to the Wounds characteristic of the destroyed model. At the end of the battle, divide your Kill Points tally by 10 and round down - the result is the number of victory points you score. In addition, if your Kill Points tally is between 50 and 99, you score 1 additional victory point, and if your tally is 100 or more, you score 2 additional victory points.",
    "category": "NO MERCY, NO RESPITE",
    "type": "End Game Objective",
    "faction": "basic",
    "id": "586aa4e2-25f5-4d00-aa21-8067b115905f"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "ABHOR THE WITCH",
    "description": "You cannot select this secondary objective if your army includes any **PSYKER** units. Score 3 victory points at the end of the battle for each enemy **PSYKER CHARACTER** unit that is destroyed, and 2 victory points for every other enemy **PSYKER** unit that is destroyed.",
    "category": "WARPCRAFT",
    "type": "End Game Objective",
    "faction": "basic",
    "id": "de2a3c50-b9eb-4545-82f3-d49995c5d34d"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "PSYCHIC INTERROGATION",
    "description": "Score 3 victory points each time you successfully complete the following psychic action:\r\r**Psychic Interrogation (Psychic Action - Warp Charge 4):** One **PSYKER CHARACTER** unit from your army can attempt to perform this psychic action in your Psychic phase if it is within 24&quot; of any enemy **CHARACTER** units\r\rIn addition, if the result of the Psychic test is equal to or greater than the Leadership characteristic of any enemy **CHARACTER** models within 24&quot; of the **PSYKER** unit that completed this psychic action, you gain 1 Command point at the end of the phase.",
    "category": "WARPCRAFT",
    "type": "Progressive Objective",
    "faction": "basic",
    "id": "a347a949-2796-428f-9b43-717663f36589"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "WARP RITUAL",
    "description": "If you select this objective, keep a Ritual Points tally; add 1 to that tally each time a unit from your army completes the following psychic action during the battle:\r\r**Warp Ritual (Psychic Action - Warp Charge 3):** One **PSYKER CHARACTER** unit from your army can attempt to perform this psychic action in your Psychic phase if it is within 6&quot; of the centre of the battlefield.\r\rAt the end of the battle, score 3 victory points if your Ritual Points tally is 1, score 7 victory points if your tally is 2, or score 12 victory points if your tally is 3 or more.",
    "category": "WARPCRAFT",
    "type": "End Game Objective",
    "faction": "basic",
    "id": "0b0537da-2fbb-4394-8db5-44cd0ea46c97"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "BEHIND ENEMY LINES",
    "description": "Score 2 victory points at the end of your turn if one unit from your army (excluding **AIRCRAFT** units) is wholly within your opponent&apos;s deployment zone. Score 4 victory points at the end of your turn instead if two or more units from your army (excluding **AIRCRAFT** units) are wholly within your opponent&apos;s deployment zone.",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "basic",
    "id": "dc9ca96c-7662-4685-bc6d-49c836603a91"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "ENGAGE ON ALL FRONTS",
    "description": "Score 2 victory points at the end of your turn if you have one or more qualifying units (see below) from your army wholly within three different table quarters, and those units are all more than 6&quot; away from any other table quarter. Score 3 victory points instead if you have one or more qualifying units from your army wholly within each table quarter, and those units are all more than 6&quot; away from any other table quarter. A qualifying unit is one that has a Starting Strength of 3 or more models, or one that contains 1 or more **VEHICLE** or **MONSTER** models (excluding **AIRCRAFT** models).",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "basic",
    "id": "e2e004c1-5141-4d04-b25b-bb9769314667"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "RAISE THE BANNERS HIGH",
    "description": "If you select this objective, units from your army can attempt the following action:\r\r**Raise Banners (Action):** One or more **INFANTRY** units from your army can start to perform this action at the end of your Movement phase. Each unit from your army that starts to perform this action must be within range of a different objective marker you control and that does not have one of your banners raised on it (see below). The action is completed at the end of your turn. If completed, that objective marker is said to have one of your army&apos;s banners raised on it (the banner is &apos;removed&apos; if your opponent controls the objective marker at the start of any Command phase).\r\rScore 1 victory point at the end of each of your Command phases, and 1 victory point at the end of the battle, for each objective marker on the battlefield that has one of your banners raised on it.",
    "category": "SHADOW OPERATIONS",
    "type": "Progressive and End Game Objective",
    "faction": "basic",
    "id": "df84597a-2fd7-43e5-accb-d61446f9ee77"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "RETRIEVE NEPHILIM DATA",
    "description": "If you select this objective, keep a Retrieved Data tally. In addition, units from your army can attempt the following action:\r\r**Retrieve Data (Action):** One **INFANTRY** or **BIKER** unit from your army can start to perform this action at the end of your Movement phase if it is wholly within a table quarter that has not had a servo-skull retrieved by your army (see below) and it is more than 6&quot; away from any other table quarter. This action is completed at the end of your turn provided the unit performing it is still within the same table quarter. If completed, roll one D6, subtracting 1 from the result if the unit that completed the action has the Troops Battlefield Role: if the result is less than or equal to the number of models currently in that unit, that table quarter is said to have had a servo-skull retrieved by your army and you add 1 to your Retrieved Data tally.\r\rAt the end of the battle, score 4 victory points if your Retrieved Data tally is 2, score 8 victory points if your tally is 3, or score 12 victory points if your tally is 4.",
    "category": "SHADOW OPERATIONS",
    "type": "End Game Objective",
    "faction": "basic",
    "id": "604e708e-0131-4bc0-ace3-3a151684be24"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "SLAY THE HERETIC",
    "description": "At the end of the battle round: \r * Score 1 victory point for each enemy unit destroyed by an attack made with a bolt weapon by an **ADEPTUS MINISTORUM** unit from your army (to a maximum of 5 victory points per battle).\r * Score 1 victory point for each enemy unit destroyed by an attack made with a flame weapon by an **ADEPTUS MINISTORUM** unit from your army (to a maximum of 5 victory points per battle).\r * Score 1 victory point for each enemy unit destroyed by an attack made with a melta weapon by an **ADEPTUS MINISTORUM** unit from your army (to a maximum of 5 victory points per battle).",
    "category": "PURGE THE ENEMY",
    "type": "Progressive Objective",
    "faction": "AS",
    "id": "1e3d93e5-9634-4b73-a50a-d95a18003fef"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "A LEAP OF FAITH",
    "description": "At the end of each players turn, if two Acts of Faith were performed by **ADEPTA SORORITAS** units from your army that turn, score 1 victory point if it is your turn, or 2 victory points if it is your opponent&apos;s turn. If three or more Acts of Faith were performed by **ADEPTA SORORITAS** units from your army that turn, score 1 additional victory point. Note that Acts of Faith performed due to Cherub dice bestowed by incensor cherubs do not count towards this secondary objective. You can score a maximum of 12 victory points from this secondary objective per battle.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "AS",
    "id": "f89a189e-f68d-4129-bfd6-9837d3f96af9"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "DEFEND THE SHRINE",
    "description": "If you select this objective, during the Resolve Pre-battle Abilities step of the mission, select one objective marker on the battlefield not in your deployment zone to be the Sacred Shrine objective marker (if the only objective marker on the battlefield is in your deployment zone, then this must be the Sacred Shrine objective marker).\r * At the end of your turn, score 3 victory points if you control the Sacred Shrine objective marker and an **ADEPTUS MINISTORUM** unit from your army is within range of that objective marker.\r * At the end of the battle, if your opponent controls the Sacred Shrine objective marker, reduce the number of victory points you have scored from this secondary objective by 3 (to a minimum of 0).",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive and End Game Objective",
    "faction": "AS",
    "id": "ec43949b-0794-4779-881a-b974bcbd18a5"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "SACRED GROUNDS",
    "description": "If you select this objective, units from your army can attempt the following action: \r\r **Sacred Grounds (Action):** One or more **ADEPTA SORORITAS INFANTRY** or **CULT IMPERIALIS PRIEST** units from your army can start to perform this action at the end of your Movement phase. Each unit from your army that starts to perform this action must be within range of a different objective marker you control that has not been consecrated by your army (see below). The action is completed at the start of your next Command phase or at the end of the battle (whichever comes first). If completed, that objective marker is said to have been consecrated by your army, and until the end of the battle, that objective marker gains the Inspiring (**ADEPTUS MINISTORUM**) terrain trait (it is not considered to be a terrain feature for any other rules purposes). \r\r Each time a unit from your army completes this action, if the objective marker that was consecrated by that action is wholly within your deployment zone, score 1 victory point; otherwise, score 5 victory points.",
    "category": "SHADOW OPERATIONS",
    "type": "Progressive Objective",
    "faction": "AS",
    "id": "8c9ca59c-fb52-4706-989a-158ff8f15c4a"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "AURIC MORTALIS",
    "description": "If you select this objective, during the Resolve Pre-battle Abilities step of the mission, select one **PRIMARCH** or **SUPREME COMMANDER** unit from your opponent&apos;s army to be marked for death (see below). If no such unit exists, select the unit from your opponent&apos;s army with the highest points value (excluding **AIRCRAFT** units) to be marked for death. If two or more units are tied, you choose between them. A unit&apos;s points value includes the points of all weapons, wargear and upgrades it has. \r\r At the end of the battle, score victory points as follows: \r * Score 5 victory points if the unit you selected to be marked for death is destroyed.\r * Score 5 victory points if the unit you selected to be marked for death was destroyed as a result of a melee attack made by an **ADEPTUS CUSTODES** or **ANATHEMA PSYKANA** unit from your army.\r * Score 5 victory points if both of the above are true and the unit you selected to be marked for death was not within your deployment zone when it was destroyed.",
    "category": "PURGE THE ENEMY",
    "type": "End Game Objective",
    "faction": "AC",
    "id": "b581ddb1-0a0a-4d3b-9564-f6bbedccf3b1"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "MIGHT OF TERRA",
    "description": "At the end of the battle round, score 4 victory points if one or more enemy units were destroyed this battle round by an **ADEPTUS CUSTODES** unit from your army and no **ADEPTUS CUSTODES** units from your army were destroyed this battle round.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "AC",
    "id": "4615d0bb-1c62-4b24-a738-bf5454de4654"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "STAND VIGIL",
    "description": "At the end of the battle round, score 3 victory points if you control more objective markers that are not within either player&apos;s deployment zone than your opponent does.",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "AC",
    "id": "c7ae97fb-7b32-4672-9638-6dff8e671b1a"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "ACCRETION OF KNOWLEDGE",
    "description": "At the end of the battle, score 3 victory points for each enemy model that is destroyed that meets one or more of the following criteria:\r * The model has a Warlord Trait.\r * The model has a Relic.\r * The model has the **VEHICLE** keyword and a Wounds characteristic of 14 or more.\r\r Models that were not destroyed by **ADEPTUS MECHANICUS** models from your army do not count towards this secondary objective.",
    "category": "PURGE THE ENEMY",
    "type": "End Game Objective",
    "faction": "AdM",
    "id": "4029e64f-5255-4b3f-b8cf-d45b74d73776"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "ERADICATION OF FLESH",
    "description": "At the end of the battle round, score 3 victory points if more enemy units were destroyed by **ADEPTUS MECHANICUS VEHICLE** units from your army this battle round than the number of **ADEPTUS MECHANICUS VEHICLE** units from your army that were destroyed by enemy units this battle round.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "AdM",
    "id": "d172a187-3e33-4dc4-b203-23084ba341a6"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "HIDDEN ARCHEOVAULT",
    "description": "If you select this objective, during the Resolve Pre-battle Abilities step of the mission, your opponent must select one objective marker on the battlefield not within their deployment zone to be the Hidden Archeovault objective marker (if the only objective marker on the battlefield is in the enemy&apos;s deployment zone, then this must be the Hidden Archeovault objective marker). \r\r At the end of the battle round, score 4 victory points if you control the Hidden Archeovault objective marker and an **ADEPTUS MECHANICUS** unit from your army is within range of that objective marker.",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "AdM",
    "id": "ef1ba556-aa36-44c6-ab2d-5e9e21746388"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "UNCHARTED SEQUENCING",
    "description": "If you select this objective, during the Resolve Pre-battle Abilities step of the mission, assign one objective marker to each battle round and note this down on your army roster. An objective marker cannot be assigned to more than one battle round. Score 3 victory points at the end of the battle round if you control the objective marker assigned to that battle round and an **ADEPTUS MECHANICUS** unit from your army is within range of that objective marker.",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "AdM",
    "id": "7c23040b-8a62-4433-b06e-17872e238810"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "BY LASGUN AND BAYONET",
    "description": "Score 1 victory point each time an enemy unit that started the turn within range of an objective marker is destroyed by an **ASTRA MILITARUM** unit from your army.",
    "category": "PURGE THE ENEMY",
    "type": "Progressive Objective",
    "faction": "AM",
    "id": "ce21d819-91e1-4fb9-a529-c282f9f6943b"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "INFLEXIBLE COMMAND",
    "description": "At the end of your turn: \r * Score 2 victory points if every **ASTRA MILITARUM INFANTRY** unit from your army is within 6&quot; of a friendly **OFFICER** unit.\n * Score 1 victory point if every **ASTRA MILITARUM VEHICLE** unit from your army is within 12&quot; of a friendly **VEHICLE OFFICER** unit. \r * Score 1 victory point if any enemy units were destroyed by an **ASTRA MILITARUM** unit from your army this turn while that **ASTRA MILITARUM** unit was being affected by an Order or Tank Order. \r\r For the purposes of this secondary objective, while an **OFFICER** unit from your army is embarked within a **TRANSPORT** model, that **TRANSPORT** model is also considered to have the **OFFICER** keyword. In addition, for the purposes of this secondary objective, while an **INFANTRY** unit from your army equipped with a vox-caster is within 24&quot; of a friendly **OFFICER** unit, it counts as being within 6&quot; instead if that **OFFICER** unit is itself within 1&quot; of a friendly **COMMAND SQUAD** or **TEMPESTUS COMMAND SQUAD** unit that is also equipped with a vox-caster.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "AM",
    "id": "6cbd6981-0f01-451e-b856-baeec5f75902"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "BOOTS ON THE GROUND",
    "description": "At the end of each of your turns (excluding the first)\r * Score 1 victory point for each table quarter that has one or more **<REGIMENT> INFANTRY** units from your army wholly within it (excluding **CHARACTER** models and units that are within 6&quot; of the centre of the battlefield). \r * Score 1 victory point if one or more units from your army equipped with a regimental standard are either wholly within 6&quot; of the centre of the battlefield or wholly within your opponent&apos;s deployment zone.",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "AM",
    "id": "721bfa6f-18e9-4398-99d8-0c4d187466fb"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "SPECIAL ORDERS",
    "description": "If you select this objective, units from your army can attempt the following action: \r\r **Expunge Intel (Action):** One **ASTRA MILITARUM INFANTRY** unit from your army can start to perform this action at the end of your Movement phase if it is within 12&quot; of a friendly **OFFICER** unit and it is within range of an objective marker you control that is not within your deployment zone and has not already been expunged by your army (see below). The action is completed at the end of the turn. If completed, that objective marker is said to have been expunged by your army. Roll one D6 each time an objective marker is expunged by your army: on a 6, you gain 1 Command point.\r\r At the end of the battle, score a number of victory points based on how many objective markers have been expunged by your army, as shown in the table below.\r\r|NUMBER OF EXPUNGED OBJECTIVE MARKERS|VICTORY POINTS|\r|---|---|\r|1|2|",
    "category": "SHADOW OPERATIONS",
    "type": "End Game Objective",
    "faction": "AM",
    "id": "bb61fde3-849d-4612-b079-151383330871"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "BATHE YOUR BLADE IN THE BLOOD OF THE FOE",
    "description": "If you select this objective, during the Resolve Pre-battle Abilities step of the mission, select one **BLACK TEMPLARS CHARACTER** model from your army to issue the challenge, then select one **CHARACTER** model from your opponent&apos;s army to accept the challenge. Score 5 victory points at the end of the battle for each of the following conditions that have been satisfied:\r * The model that accepted the challenge is destroyed.\r * The model that accepted the challenge was destroyed as the result of a melee attack. \r * The model that accepted the challenge was destroyed as the result of an attack made by the model that issued the challenge.\r\rIf the model that accepted the challenge is a Strategic Reserve or Reinforcement unit and is destroyed as a result of not arriving on the battlefield, all of the above conditions are considered to have been satisfied.\r\rIf all three of these conditions are satisfied during the battle, you immediately gain 1 Command point.",
    "category": "PURGE THE ENEMY",
    "type": "End Game Objective",
    "faction": "SM",
    "subfaction": "BT",
    "id": "576e4639-296e-4b25-b6db-fdf474b06026"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "ALLOW NOT THE WORSHIP OF UNCLEAN IDOLS",
    "description": "At the end of your turn, score 2 victory points for each objective marker you control that was controlled by your opponent at the start of that turn, and that has a BLACK TEMPLARS CORE or BLACK TEMPLARS CHAPLAIN unit from your army within range of it.",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "BT",
    "id": "09caf2a9-bbdc-4d2d-953f-503ce21b1a5e"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "CARRY OUT YOUR VOWS",
    "description": "You can select this secondary objective if you have selected any Templar Vows. This objective consists of a Progressive component and an End Game component. For the purposes of the End Game component, you can only score victory points that apply for the Templar Vow you selected at the end of the Read Mission Briefing step, and not for any other vows you selected during the battle.\r\r_Progressive Component_\r\rAt the end of the battle round, score 4 victory points if the number of enemy units destroyed by melee attacks made by **BLACK TEMPLARS** units from your army this battle round is greater than the number of **BLACK TEMPLARS** units from your army destroyed this battle round. You can score a maximum of 12 victory points per battle from this component.\r\r_End Game Component_\r\rAt the end of the battle, score 3 victory points if any of the following conditions are satisfied:\r * You selected the Suffer Not the Unclean to Live vow before the battle, and the enemy WARLORD was destroyed by a melee attack made by a BLACK TEMPLARS CHARACTER unit from your army during the battle. \r * You selected the Uphold the Honour of the Emperor vow before the battle, and a BLACK TEMPLARS INFANTRY unit (excluding CHARACTER units) from your army that is not below Half-strength is in your opponent&apos;s  deployment zone at the end of the battle. \r * You selected the Abhor the Witch, Destroy the Witch vow before the battle, and one or more enemy PSYKER CHARACTER units were destroyed by a BLACK TEMPLARS unit from your army during the battle. \r * You selected the Accept Any Challenge, No Matter the Odds vow before the battle, and an enemy unit with a Starting Strength of 20 or more models or an enemy model with a Wounds characteristic of 20 or more was destroyed by a BLACK TEMPLARS unit from your army during the battle.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive and End Game Objective",
    "faction": "SM",
    "subfaction": "BT",
    "id": "f812bad1-4fe8-420f-b1cb-38314c46e31b"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "BLADE OF SANGUINIUS",
    "description": "If you select this objective, during the Resolve Pre-battle Abilities step of the mission, select one BLOOD ANGELS CHARACTER model from your army to issue the challenge, then select one CHARACTER model from your opponent&apos;s army to accept the challenge. Score 5 victory points at the end of the battle for each of the following conditions that have been satisfied: \r * The model that accepted the challenge is destroyed. \r * The model that accepted the challenge was destroyed as the result of a melee attack. \r * The model that accepted the challenge was destroyed as the result of an attack made by the model that issued the challenge. \r\r If the model that accepted the challenge is a Strategic Reserve or Reinforcement unit and is destroyed as a result of not arriving on the battlefield, all of the above conditions are considered to have been satisfied. If all three of these conditions are satisfied during the battle, your opponent immediately loses 1 Command point (to a minimum of 0).",
    "category": "PURGE THE ENEMY",
    "type": "End Game Objective",
    "faction": "SM",
    "subfaction": "BA",
    "id": "868ab840-e414-4efe-88f5-42135da5fc03"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "FURY OF THE LOST",
    "description": "At the end of the battle round: \r * Score 3 victory points if one enemy unit was destroyed by a DEATH COMPANY unit from your army this battle round. Score 4 victory points instead if two or more enemy units were destroyed by DEATH COMPANY units from your army this battle round. \r * Score 1 additional victory point if one or more DEATH COMPANY units from your army were destroyed by enemy unit&apos;s this battle round.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "BA",
    "id": "f8885722-2898-49e8-9976-1a4d85e93489"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "DEATH FROM ABOVE",
    "description": "* At the end of your turn, score 3 victory points if any enemy units were destroyed by a BLOOD ANGELS unit from your army that was set up on the battlefield in the Reinforcements step of any of your Movement phases during the battle. \r * If any of those enemy units were destroyed in the same turn in which that BLOOD ANGELS unit was set up, score 1 additional victory point. \r * If any of those enemy units were CHARACTER units, score 1 additional victory point.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "BA",
    "id": "5a74f35f-4947-4525-a38f-20945b47b1a8"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "RELENTLESS ASSAULT",
    "description": "At the end of your turn, score 4 victory points if there are more BLOOD ANGELS units from your army in your opponent&apos;s deployment zone than there are enemy units in your deployment zone.",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "BA",
    "id": "9f31e05d-fef6-442a-8734-2fba545c9200"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "MARTIAL INTERDICTION",
    "description": "If you select this objective, during the Resolve Pre-battle Abilities step of the mission, select one CHARACTER model from your opponent&apos;s army. At the end of the battle, score victory points as follows: \r * Score 3 victory points if the selected enemy model is destroyed. \r * Score 3 additional victory points if the selected enemy model was destroyed by a melee attack made by a DARK ANGELS model from your army. \r * Score 3 additional victory points if the selected enemy model was destroyed by a melee attack made by an INNER CIRCLE or DEATHWING model from your army. \r * Score 6 additional victory points if the unit of the DARK ANGELS model that destroyed the selected enemy model has not itself been destroyed.",
    "category": "PURGE THE ENEMY",
    "type": "End Game Objective",
    "faction": "SM",
    "subfaction": "DA",
    "id": "2fda5cf1-9f0c-4f18-af90-0eb8de18f9b4"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "DEATH ON THE WIND",
    "description": "Score 2 victory points each time an enemy unit is destroyed by a RAVENWING model from your army that moved 12&quot; or more during the Movement phase of that turn, or made a charge move that turn.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "DA",
    "id": "a7b0cd48-0157-4452-9afa-66ba9f79198c"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "STUBBORN DEFIANCE",
    "description": "In your first Command phase, select one objective marker that is not within your deployment zone. At the end of each of your Command phases, if you control that objective marker and a DARK ANGELS unit from your army with the Objective Secured ability is within range of it, score a number of victory points based on the consecutive number of your Command phases you have controlled that objective marker for and had that unit within range of it, as follows:\r\r **TABLE MISSING**",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "DA",
    "id": "fcc9b13b-cf1f-46a1-9f69-b654c68c637c"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "CULL ORDER",
    "description": "If you select this objective, during the Resolve Pre-battle Abilities step of the mission, select three Battlefield Roles (HQ, Troops, etc.) from the units in your opponent&apos;s army. If your opponent&apos;s army does not include at least three units with different Battlefield Roles, select as many Battlefield Roles as possible. \r\r At the end of the battle, for each Battlefield Role that was selected, score 4 victory points if every enemy unit in your opponents army with that Battlefield Role has been destroyed.",
    "category": "PURGE THE ENEMY",
    "type": "End Game Objective",
    "faction": "SM",
    "subfaction": "DW",
    "id": "ddb7b7ad-b40b-4e99-b343-5bb960bb1793"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "SUFFER NOT THE ALIEN",
    "description": "Score 1 victory point each time an enemy TYRANIDS, AELDARI, ORKS, Necrons or T&apos;AU EMPIRE unit is destroyed by a DEATHWATCH unit from your army.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "DW",
    "id": "d0184a60-c06e-4695-a09a-598ab4e52c64"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "THE LONG VIGIL",
    "description": "At the start of your Command phase, score 4 victory points if there are no enemy units (excluding AIRCRAFT units) wholly within your deployment zone and there is at least one DEATHWATCH unit (excluding AIRCRAFT units) from your army wholly within your deployment zone. You cannot score this secondary objective during the first battle round.",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "DW",
    "id": "e300cbb8-18ee-4e7c-ae03-75ac45845a17"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "CRIPPLE STRONGHOLD",
    "description": "If you select this objective, during the Resolve Pre-battle Abilities step of the mission, your opponent must select one objective marker on the battlefield not within their deployment zone to be the Stronghold objective marker (if the only objective marker on the battlefield is in the enemy&apos;s deployment zone, then this must be the Stronghold objective marker). \r\r If you select this objective, DEATHWATCH INFANTRY units from your army can attempt the following action: \r\r Cripple Stronghold (Action): One DEATHWATCH INFANTRY unit from your army can start to perform this action at the end of your Movement phase if it is within range of the Stronghold objective marker and you control that objective marker. This action is completed at the end of your turn provided the unit performing the action is still within range of the same objective marker. \r\r Each time a unit from your army completes this action, score 4 victory points and roll one D6: on a 6, your opponent loses 1 Command point (to a minimum of 0).",
    "category": "SHADOW OPERATIONS",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "DW",
    "id": "7de49e4d-0b8c-4308-8b72-d865de6574d8"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "DESTROY THE DAEMON",
    "description": "At the end of the battle, score victory points for each enemy unit destroyed by a GREY KNIGHTS unit from your army during the battle as follows: \r * DAEMON PRIMARCH unit - score 5 victory points. \r * Any other DAEMON MONSTER unit - score 3 victory points. \r * DAEMON VEHICLE unit - score 3 victory points \r * Any other DAEMON unit - score 1 victory point. \r\r At the end of the battle, reduce the number of victory points scored from this secondary objective by 1 for each DAEMON unit that is on the battlefield that is not below Half-strength. For the purposes of this secondary objective, units with a Starting Strength of 1 are considered to be below Half-strength at the end of the battle if their remaining number of wounds is less than half their starting Wounds characteristic.",
    "category": "PURGE THE ENEMY",
    "type": "End Game Objective",
    "faction": "GK",
    "id": "7df4a578-8744-4672-b4c2-d86b7e8f9edf"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "TELEPORT ASSAULT",
    "description": "At the end of the battle round, score 4 victory points if one or more enemy units were destroyed by a GREY KNIGHTS model from your army that was set up on the battlefield using the Teleport Strike ability, the Teleportation Shunt Stratagem or the Gate of Infinity psychic power this battle round",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "GK",
    "id": "709050ad-fad9-433a-8347-940977f33285"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "PURIFYING RITUAL",
    "description": "If you select this objective, GREY KNIGHTS PSYKER units from your army can attempt the following psychic action: \r\r Purifying Ritual (Psychic Action - Warp Charge 5): One or more GREY KNIGHTS PSYKER units from your army can attempt to perform this psychic action in your Psychic phase. Each unit from your army that starts to perform this psychic action must be within range of a different objective marker you control that has not been purified by your army this turn. If this psychic action is completed, that objective marker is said to have been purified by your army this turn. \r\r At the end of your turn, score victory points depending on the number of objective markers purified by your army this turn, as shown in the table below.\r\r **TABLE MISSING**",
    "category": "WARPCRAFT",
    "type": "Progressive Objective",
    "faction": "GK",
    "id": "077733af-decf-40fd-b778-d8c5c4288d9d"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "BOLSTER BARRICADES",
    "description": "If you select this objective, IMPERIAL FISTS units from your army can attempt the following action:\r\r Bolster Barricades (Action): One IMPERIAL FISTS CORE INFANTRY unit from your army can start to perform this action at the end of your Movement phase if it is within range of an objective marker you control that has not been barricaded by your army (see below). The action is completed at the start of your next Command phase or at the end of the battle (whichever comes first), provided the unit performing it is still within range of the same objective marker. If completed, that objective marker is said to have been barricaded by your army.\r\r Each time a unit from your army completes this action: \r * If the objective marker that was barricaded by that action was within your deployment zone, score 1 victory point. \r * If the objective marker that was barricaded by that action was not within either player&apos;s deployment zone, score 4 victory points. \r * Until the end of the battle, each time an enemy unit makes an attack that targets an IMPERIAL FISTS INFANTRY unit from your army that is wholly within 6&quot; of an оbiective marker that has been barricaded by your army, that unit receives the benefits of Light Cover and Heavy Cover against that attack.",
    "category": "SHADOW OPERATIONS",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "IF",
    "id": "909e5d06-35ab-49d6-85f7-48cedf3384ad"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "DUEL OF HONOUR",
    "description": "If you select this objective, during the Resolve Pre-battle Abilities step of the mission, identify the enemy WARLORD. and the two units from your opponent&apos;s army that have the highest points value (excluding the enemy WARLORD), and make a note of them on your army roster (if two or more units are tied, your opponent can choose between them). If your opponent&apos;s army has three or fewer units, then you instead identify all the units in your opponent&apos;s army. A unit&apos;s points value includes the points of all weapons, wargear and upgrades it has. \r\r At the end of the battle, for each identified enemy unit that is destroyed, you score a number of victory points if that unit was destroyed during the battle by an IMPERIAL KNIGHTS unit from your army. If a unit splits into several smaller units during the battle, all of those separate units must be destroyed for the original unit to count as being destroyed for the purposes of this secondary objective. \r\r The number of victory points scored depends on how the enemy unit was destroyed, as shown in the table below. \r\r TABLE MISSING \r\r At the end of any battle round in which Honour to the King or Personal Combat was achieved, you gain 1 Honour point. \r\r At the end of the battle, if the enemy WARLORD is destroyed, you score 1 additional victory point. \r\r At the end of the battle, you must reduce the number of victory points you have scored from this secondary objective by 1 for each of the identified units that has not been destroyed.",
    "category": "PURGE THE ENEMY",
    "type": "End Game Objective",
    "faction": "QI",
    "id": "9072f256-d4d7-40ad-80e2-6d42813901a3"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "HONOUR OF THE HOUSE",
    "description": "At the end of the battle round, if you have 6 Honour points or if you have more Honour points than you had at the start of the battle round, score 2 victory points. In addition, at the end of the battle: \r * Score 3 additional victory points if your army is Virtuous. \r * Score 2 additional victory points if your army is Honoured. \r * If your army is Dishonoured, reduce the number of victory points you have scored from this secondary objective by 3.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive and End Game Objective",
    "faction": "QI",
    "id": "b577fbc9-e3a6-4fd0-8d6b-7f0e29756118"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "YIELD NO GROUND",
    "description": "At the end of your turn, score 1 victory point for each of the following conditions you satisfy (for a maximum of 3 victory points): \r * You control half or more of the total number of objective markers on the battlefield, and one or more IMPERIAL KNIGHTS models from your army are within range of each of those objective markers. \r * No enemy units (excluding AIRCRAFT units) are wholly within your deployment zone. \r * No IMPERIAL KNIGHTS units from your army ended that turn closer to your battlefield edge than they were at the start of that turn, and no IMPERIAL KNIGHTS units from your army Fell Back that turn.",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "QI",
    "id": "40b6313d-34c2-442c-b35b-0fa39f2a0f2a"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "RENEW THE OATHS",
    "description": "If you select this objective, IMPERIAL KNIGHTS units from your army can attempt the following action: \r\r Renew the Oaths (Action): One IMPERIAL KNIGHTS model from your army can start to perform this action at the end of your Movement phase if it is within 6&quot; of the centre of the battlefield. This action is completed at the end of your turn provided the unit performing it is still within 6&quot; of the centre of the battlefield. \r\r Each time a unit from your army completes this action: \r * Score 3 victory points if the action was completed by a non-TITANIC model. \r * Score 4 victory points if the action was completed by a TITANIC model. \r * Score 1 additional victory point if the action was completed by a CHARACTER model. \r * Roll one D6: on a 4+, you gain 1 Honour point.",
    "category": "SHADOW OPERATIONS",
    "type": "Progressive Objective",
    "faction": "QI",
    "id": "8a3d38cd-e165-4613-9bfd-075fe2e9feea"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "COLD FURY",
    "description": "At the end of your turn, score 1 victory point for each of the following conditions you satisfy (for a maximum of 4 victory points): \r * One or more IRON HANDS VEHICLE units (excluding AIRCRAFT units) from your army are wholly within your opponent&apos;s deployment zone. \r * One or more IRON HANDS VEHICLE units (excluding AIRCRAFT units) from your army are wholly within 6&quot; of the centre of the battlefield. \r * One or more enemy units were destroyed by ranged attacks made by IRON HANDS VEHICLE units from your army this turn. \r * One or more enemy units were destroyed by melee attacks made by IRON HANDS VEHICLE units from your army this turn.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "IH",
    "id": "7b9db9bf-2a31-4ea7-96e4-c966ca4e3ac6"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "SECURE OR SABOTAGE",
    "description": "If you select this objective, RAVEN GUARD units from your army can attempt the following action: \r\r Plant Explosives (Action): One or more RAVEN GUARD CORE INFANTRY units from your army can start to perform this action at the end of your Movement phase. Each unit from your army that starts to perform this action must be within range of a different objective marker you control that does not have explosives planted on it by your army (see below). The action is completed at the end of your turn. If completed, that objective marker is said to have explosives planted on it by your army. \r\r At the end of any player&apos;s turn, for each objective marker that has explosives planted on it by your army, if that objective marker is controlled by your opponent, you can perform a controlled explosion with it. If you do so, that objective marker is no longer said to have explosives planted on it by your army, and for each unit within range of that objective marker roll one D6: on a 2+, that unit suffers 3 mortal wounds. You cannot perform a controlled explosion with an objective marker in the same turn it had explosives planted on it by your army. \r\r At the end of the battle, score 3 victory points for each objective marker that still has explosives planted on it by your army.",
    "category": "SHADOW OPERATIONS",
    "type": "End Game Objective",
    "faction": "SM",
    "subfaction": "RG",
    "id": "a5143be2-5ab8-4edd-bf86-4e36a374014c"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "THE PROMETHEAN CREED",
    "description": "In your first Command phase, select one objective marker that is not within your deployment zone. \r * At the end of each of your Command phases, if you control that objective marker and a SALAMANDERS CORE INFANTRY unit from your army is within range of it, score 2 victory points. \r * Each time an enemy unit is selected to shoot or fight, if it selects a SALAMANDERS INFANTRY unit from your army that is within range of that objective marker as the target of one or more of its attacks, but it does not destroy that unit as a result of those attacks, score 1 victory point (to a maximum of 3 victory points per turn). \r * At the end of each player&apos;s turn, if one or more enemy units were destroyed by attacks made by a SALAMANDERS INFANTRY unit from your army that turn while that SALAMANDERS INFANTRY unit was within range of that objective marker, score 1 victory point (score 2 victory points instead if one or more models in any of those destroyed units were destroyed as a result of attacks made with flame or melta weapons that turn).",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "SA",
    "id": "2ede1b25-ec1e-453d-9a47-4f8157337ab1"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "PURGE THE ENEMY",
    "description": "At the end of the battle, score victory points as follows: \r * Score 2 victory points (to a maximum of 5 victory points) for each enemy unit that was destroyed as the result of an attack made with a Heavy or Grenade weapon by an ADEPTUS ASTARTES unit from your army while the Devastator Doctrine was active for your army. \r * Score 1 victory point (to a maximum of 5 victory points) for each enemy unit that was destroyed as the result of an attack made with a Rapid Fire or Assault weapon by an ADEPTUS ASTARTES unit from your army while the Tactical Doctrine was active for your army. \r * Score 1 victory point (to a maximum of 5 victory points) for each enemy unit that was destroyed as the result of an attack made with a Pistol or Melee weapon by an ADEPTUS ASTARTES unit from your army while the Assault Doctrine was active for your army.",
    "category": "PURGE THE ENEMY",
    "type": "End Game Objective",
    "faction": "SM",
    "id": "6127895f-2b80-428e-b6d2-816bd1759ab6"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "OATHS OF MOMENT",
    "description": "At the end of the battle round, score victory points for achieving the following three Oaths: \r * Oath of Valour: Score 1 victory point if any CHARACTER, VEHICLE or MONSTER unit was destroyed by an ADEPTUS ASTARTES unit from your army this battle round. \r * Oath of Honour: Score 1 victory point provided no ADEPTUS ASTARTES units from your army failed a Morale test this battle round, and no ADEPTUS ASTARTES units from your army Fell Back this battle round. \r * Oath of Duty: Score 1 victory point if an ADEPTUS ASTARTES CORE or ADEPTUS ASTARTES CHARACTER unit from your army is wholly within 6&quot; of the centre of the battlefield.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "SM",
    "id": "fee25e39-4d78-4c76-81bc-5394cc1ebfa0"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "SHOCK TACTICS",
    "description": "At the end of your turn, score 3 victory points if you control one or more objective markers that were controlled by your opponent at the start of that turn, and an ADEPTUS ASTARTES unit from your army is within range of that objective marker.",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "SM",
    "id": "19afcbcf-ca28-4a0e-8909-fbb01e3a37d2"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "GLORY KILLS",
    "description": "At the end of the battle round, score victory points as follows (for a maximum of 5 victory points): \r * Score 2 victory points if any CHARACTER units were destroyed by a SPACE WOLVES unit from your army this battle round. If no CHARACTER units were destroyed, but a CHARACTER unit suffered 1 or more wounds as the result of attacks made by SPACE WOLVES units from your army this battle round, score 1 victory point instead. \r * Score 3 victory points if any MONSTER or VEHICLE units were destroyed by a SPACE WOLVES unit from your army this battle round. If no MONSTER or VEHICLE units were destroyed, but a MONSTER or VEHICLE unit suffered 1 or more wounds as a result of attacks made by SPACE WOLVES units from your army this battle round, score 1 victory point instead. \r\r A CHARACTER MONSTER or CHARACTER VEHICLE unit counts towards both parts of this objective. For example, if a SPACE WOLVES unit from your army destroyed a CHARACTER MONSTER unit, you would score 5 victory points as a result.",
    "category": "PURGE THE ENEMY",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "SW",
    "id": "02a3e2fd-ee0c-4ce3-8d67-37547a79b52b"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "HEROIC CHALLENGE",
    "description": "If you select this objective, during the Resolve Pre-battle Abilities step of the mission, select one SPACE WOLVES CHARACTER model from your army to issue the challenge, then select one CHARACTER model from your opponent&apos;s army to accept the challenge. Score 5 victory points at the end of the battle for each of the following conditions that have been satisfied: \r * The model that accepted the challenge is destroyed. \r * The model that accepted the challenge was destroyed as the result of a melee attack. \r * The model that accepted the challenge was destroyed as the result of an attack made by the model that issued the challenge. \r\r If the model that accepted the challenge is a Strategic Reserve or Reinforcement unit and is destroyed as a result of not arriving on the battlefield, all of the above conditions are considered to have been satisfied. If all three of these conditions are satisfied during the battle, you immediately gain 1 Command point.",
    "category": "PURGE THE ENEMY",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "SW",
    "id": "3d331c21-c344-4db0-aecc-b828c8c6a97f"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "A MIGHTY SAGA",
    "description": "At the end of the battle round, score 2 victory points for each of the following achieved by your SPACE WOLVES WARLORD (to a maximum of 5 victory points per battle round): \r * An enemy CHARACTER, MONSTER or VEHICLE unit lost any wounds as the result of a melee attack made by your WARLORD this battle round. \r * 5 or more models were destroyed as the result of attacks made by your WARLORD this battle round. \r * An enemy unit was destroyed as the result of an attack made by your WARLORD this battle round. \r * Your WARLORD is within range of an objective marker you control that is not within your deployment zone.",
    "category": "NO MERCY, NO RESPITE",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "SW",
    "id": "c547976a-12ee-4491-b9c8-cdbc7a8f6f44"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "WARRIOR PRIDE",
    "description": "At the end of your turn, score 3 victory points if two or more SPACE WOLVES units from your army are within Engagement Range of any enemy units or completed a charge move this turn, and neither of those units are within your deployment zone.",
    "category": "BATTLEFIELD SUPREMACY",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "SW",
    "id": "daa91a79-bd68-4bc6-b1f2-ed09e630b403"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "WE MARCH FOR MACRAGGE",
    "description": "If you select this objective, ULTRAMARINES CORE INFANTRY units from your army can attempt the following action: \r\r Claimed for Macragge (Action): One or more ULTRAMARINES CORE INFANTRY units from your army can start to perform this action at the end of your Movement phase. Each unit from your army that starts to perform this action must be within range of a different objective marker you control that is not within your deployment zone and has not been claimed for Macragge by your army. The action is completed at the start of your next Command phase or at the end of the battle (whichever comes first). If completed, that objective marker is said to have been claimed for Macragge by your army. \r\r Score 4 victory points each time a unit from your army completes this action.",
    "category": "SHADOW OPERATIONS",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "UL",
    "id": "cc437607-e942-4a37-97be-d1b5c591f7ee"
  },
  {
    "cardType": "secondary",
    "source": "basic",
    "name": "LIGHTNING STRIKE",
    "description": "At the end of your turn: \r * Score 3 victory points for each enemy CHARACTER or MONSTER unit that was destroyed by a melee attack made by a WHITE SCARS unit from your army that made a charge move this turn. \r * Score 1 victory point for each other enemy unit that was destroyed by a melee attack made by a WHITE SCARS unit from your army that made a charge move this turn. \r * Score 1 victory point for each enemy unit that was destroyed by a ranged attack made by a WHITE SCARS unit from your army that Advanced this turn. \r\r You can score a maximum of 5 victory points per battle round from this secondary objective.",
    "category": "PURGE THE ENEMY",
    "type": "Progressive Objective",
    "faction": "SM",
    "subfaction": "WS",
    "id": "0b5c1e7d-85c4-4b5a-9de6-c915695cef2d"
  }
]
