[
  {
    "faction_id": "AC",
    "faction_name": "Adeptus Custodes",
    "type": "Warlord Traits",
    "roll": "",
    "name": "LOCKWARDEN",
    "legend": "The master of the Shadowkeepers is the Lockwarden, an especially stern master gaoler feared by all his charges. He must be implacable in defence and unrelenting on the attack.",
    "description": "Each time an attack made by this WARLORD is allocated to a CHARACTER unit, an invulnerable saving throw cannot be made against that attack."
  },
  {
    "faction_id": "AC",
    "faction_name": "Adeptus Custodes",
    "type": "Warlord Traits",
    "roll": "",
    "name": "ALL-SEEING ANNIHILATOR",
    "legend": "The Dread Host employ a near-prescient intelligence network to foresee their enemies’ plans and weaknesses. This warlord employs that amassed knowledge to best direct his comrades’ attacks.",
    "description": "In your Command phase, select this WARLORD or one friendly DREAD HOST CORE unit within 6\" of this WARLORD. Until the start of your next Command phase, each time a model in that unit makes an attack, an unmodified hit roll of 6 scores 1 additional hit."
  },
  {
    "faction_id": "AC",
    "faction_name": "Adeptus Custodes",
    "type": "Warlord Traits",
    "roll": "",
    "name": "REVERED COMPANION",
    "legend": "Years of interposing himself between his charges and the blades of their foes has left this warlord adept at turning and deflecting attacks.",
    "description": "Each time an attack is allocated to this WARLORD, halve the Damage characteristic of that attack (rounding up)."
  },
  {
    "faction_id": "AC",
    "faction_name": "Adeptus Custodes",
    "type": "Warlord Traits",
    "roll": "",
    "name": "SALLY FORTH",
    "legend": "This warlord excels in directing fast and deadly offensives designed to close rapidly with the enemy, overwhelming the foe with a devastating concentration of force.",
    "description": "At the start of your Charge phase, select one friendly SOLAR WATCH INFANTRY unit within 6\" of this WARLORD. Until the end of the phase, that unit is eligible to charge in a turn in which it Advanced."
  },
  {
    "faction_id": "AC",
    "faction_name": "Adeptus Custodes",
    "type": "Warlord Traits",
    "roll": "",
    "name": "VOICE OF THE EMPEROR",
    "legend": "Where many amongst the Adeptus Custodes hold themselves remote and aloof from the lesser mortals around them, this warlord’s booming oratory and inspirational rhetoric are meant for the ears and hearts of all loyal Imperial servants.",
    "description": "* Add 3\" to the range of this WARLORD’s aura abilities to a maximum of 12\" (this has already been added to the Voice of the Emperor aura ability below).\n* This WARLORD has the following ability: ‘Voice of the Emperor (Aura): While a friendly ADEPTUS CUSTODES or ANATHEMA PSYKANA unit is within 9\" of this model, add 1 to the Leadership characteristic of models in that unit.’"
  },
  {
    "faction_id": "AC",
    "faction_name": "Adeptus Custodes",
    "type": "Warlord Traits",
    "roll": "1",
    "name": "OBLIVION KNIGHT",
    "legend": "Oblivion Knights are among the most powerful and experienced of the Sisters of Silence. Many have fought against and defeated numerous alpha-level psykers.",
    "description": "* This WARLORD has the following ability: ‘Oblivion Knight (Aura)**:** Add 1 to Advance and charge rolls made for ANATHEMA PSYKANA INFANTRY units while they are within 6\" of this model.’\n* Each time this WARLORD makes an attack, re-roll a wound roll of 1."
  },
  {
    "faction_id": "AC",
    "faction_name": "Adeptus Custodes",
    "type": "Warlord Traits",
    "roll": "2",
    "name": "SILENT JUDGE (AURA)",
    "legend": "This warlord has condemned countless numbers to death in her mission to root out the psyker and punish those concealing them. In battle she is cold, calculated and remorseless.",
    "description": "While an enemy unit is within 3\" of this WARLORD:  \n* Each time a Combat Attrition test is taken for that enemy unit, subtract 1 from that Combat Attrition test.\n* That enemy unit loses the Objective Secured ability."
  },
  {
    "faction_id": "AC",
    "faction_name": "Adeptus Custodes",
    "type": "Warlord Traits",
    "roll": "3",
    "name": "MISTRESS OF PERSECUTION (AURA)",
    "legend": "This warlord is a supreme huntress who has captured and purged countless psykers in the bowels of hive worlds, the hidden dens of criminal warlords and on planets in the throes of heretical rebellion.",
    "description": "While a friendly ANATHEMA PSYKANA INFANTRY unit is within 6 \" of this WARLORD:  \n* Each time a model in that ANATHEMA PSYKANA INFANTRY unit makes an attack, the target does not receive the benefits of Heavy or Light Cover against that attack.\n* Add 3\" to the Range characteristic of ranged weapons models in that ANATHEMA PSYKANA INFANTRY unit are equipped with."
  },
  {
    "faction_id": "AC",
    "faction_name": "Adeptus Custodes",
    "type": "Warlord Traits",
    "roll": "1",
    "name": "MASTER OF MARTIAL STRATEGY",
    "legend": "This warlord is immeasurably accomplished in the arts of war and in the Adeptus Custodes’ fighting formations.",
    "description": "* While this WARLORD is on the battlefield, each time you spend a Command point to use a Stratagem, you can roll one D6: on a 5+, that Command point is refunded.\n* Once per battle, in your Command phase, if units from your army are using the Martial Ka’tah ability, before selecting a ka’tah stance for your army, you can change the order of your martial ka’tahs, i.e. primary, secondary or tertiary. Note that this does not allow you to select ka’tah stances more than once."
  },
  {
    "faction_id": "AC",
    "faction_name": "Adeptus Custodes",
    "type": "Warlord Traits",
    "roll": "2",
    "name": "CHAMPION OF THE IMPERIUM",
    "legend": "This warlord is amongst the finest champions in the entire Imperium, and their presence inspires all nearby to acts of heroism.",
    "description": "* This WARLORD is eligible to perform a Heroic Intervention if it is within 6\" horizontally and 5\" vertically of any enemy unit.\n* Each time this WARLORD makes a Heroic Intervention move, it can move up to 6\" instead of 3\". All other rules for Heroic Interventions still apply.\n* Each time this WARLORD makes an attack, you can re-roll the hit roll."
  },
  {
    "faction_id": "AC",
    "faction_name": "Adeptus Custodes",
    "type": "Warlord Traits",
    "roll": "3",
    "name": "SUPERIOR CREATION",
    "legend": "The cellular alchemy that went into the creation of this heroic warrior has rendered him breathtakingly resilient.",
    "description": "Each time this WARLORD would lose a wound, roll one D6: on a a 5+, that wound is not lost."
  },
  {
    "faction_id": "AC",
    "faction_name": "Adeptus Custodes",
    "type": "Warlord Traits",
    "roll": "4",
    "name": "IMPREGNABLE MIND",
    "legend": "No blandishment or invasion by the enemy can overcome the fortress of this warlords mind, and his strength of will can crush that of lesser beings.",
    "description": "* In your opponent’s Psychic phase, this WARLORD can attempt to Deny the Witch once as if it were a PSYKER model. Each time a Deny the Witch test is taken for this WARLORD, add 1 to the result.\n* This WARLORD counts as two additional models when determining control of an objective marker. This is cumulative with any other rules that make it count as additional models."
  },
  {
    "faction_id": "AC",
    "faction_name": "Adeptus Custodes",
    "type": "Warlord Traits",
    "roll": "5",
    "name": "RADIANT MANTLE",
    "legend": "The holy light of the Emperor himself glows around this magnificent warrior in a sublime halo. Enemies are blinded by its glory, forced to recoil in pain and terror.",
    "description": "Each time an attack is made against this WARLORD, subtract 1 from that attack’s hit roll."
  },
  {
    "faction_id": "AC",
    "faction_name": "Adeptus Custodes",
    "type": "Warlord Traits",
    "roll": "6",
    "name": "PEERLESS WARRIOR",
    "legend": "With every strike, this warlord proves himself the master of one-to-one combat against even the most terrifying foes.",
    "description": "* Each time this WARLORD makes a melee attack, an unmodified wound roll of 6 inflicts 1 mortal wound on the target in addition to any normal damage.\n* Each time an attack made by this WARLORD is allocated to an enemy model, the saving throw cannot be re-rolled."
  },
  {
    "faction_id": "AdM",
    "faction_name": "Adeptus Mechanicus",
    "type": "Codex Supplement: Metalica",
    "roll": "1",
    "name": "MASTER ANNIHILATOR",
    "legend": "This Warlord is a peerless annihilator, commanding ruthless technology to eliminate all life before them.",
    "description": "In your Command phase, select one friendly METALICA unit that is within 6\" of this WARLORD. Until the start of your next Command phase, add 6\" to the Range characteristic and 1 to the Strength characteristic of all radium weapons models in that unit are equipped with. For the purposes of this rule, a Radium weapon is any weapon whose profile includes the word ‘Radium’ (radium pistol, radium carbine etc.) and any relic that replaces such a weapon. This is not cumulative with any other rule that increases a weapons range."
  },
  {
    "faction_id": "AdM",
    "faction_name": "Adeptus Mechanicus",
    "type": "Codex Supplement: Metalica",
    "roll": "2",
    "name": "ASHRUNNER",
    "legend": "This Warlord earned their reputation on ash wastes of Armageddon. The mark of that war zone is apparent in the extensive modifications that make them suitable for such environments.",
    "description": "Add 3\" to the Move characteristic and 1 to the Strength and Attacks characteristics of this WARLORD."
  },
  {
    "faction_id": "AdM",
    "faction_name": "Adeptus Mechanicus",
    "type": "Codex Supplement: Metalica",
    "roll": "3",
    "name": "RADIOACTIVE EMANATION (AURA)",
    "legend": "This Warlord is wreathed in a dense, radioactive fog that saps the stamina of those who are not inured to its ionising embrace.",
    "description": "While a unit is within 6\" of this WARLORD, unless it is a METALICA unit, subtract 1 from its Toughness characteristic. This is not cumulative with any other rule that reduces the Toughness characteristic of an enemy model (e.g. the Rad-saturation ability or the Rad-Bombardment Stratagem)."
  },
  {
    "faction_id": "AdM",
    "faction_name": "Adeptus Mechanicus",
    "type": "Warlord Traits",
    "roll": "1",
    "name": "MULTITASKING CORTEX",
    "legend": "The warlord’s cogitative capacity is several orders of magnitude greater than a common Skitarius. Sharing a fraction of this processing power, the cogni-savant enables those under their command to focus upon several tasks at once.",
    "description": "In your Command phase, select one friendly FORGE WORLD> SKITARII CORE unit within 9\" of this WARLORD, or select one friendly FORGE WORLD> CORE DATA-TETHER unit on the battlefield. Until the start of your next Command phase, if that unit is performing an action, it can make ranged attacks without that action failing."
  },
  {
    "faction_id": "AdM",
    "faction_name": "Adeptus Mechanicus",
    "type": "Warlord Traits",
    "roll": "2",
    "name": "BATTLE-SPHERE UPLINK",
    "legend": "Tapping into infostacks of data emanating from across the wider battle-sphere, the warlord synchronises the warriors under their command with the flows of wisdom, feeding them targeting data at a rate that borders on prophetic.",
    "description": "In your Command phase, select one friendly FORGE WORLD> SKITARII CORE unit within 9\" of this WARLORD, or select one friendly FORGE WORLD> CORE DATA-TETHER unit on the battlefield. Until the start of your next Command phase, models in that unit do not suffer the penalty to hit rolls incurred for firing:  \n* Heavy weapons in the same turn that their unit has moved.\n* Assault weapons in the same turn that their unit has Advanced."
  },
  {
    "faction_id": "AdM",
    "faction_name": "Adeptus Mechanicus",
    "type": "Warlord Traits",
    "roll": "3",
    "name": "PROGRAMMED RETREAT",
    "legend": "Taking direct control of their cohorts’ manoeuvres, the warlord sees their soldiers’ withdrawal carried out with such precision that they can be immediately pressed back into efficacious service.",
    "description": "In your Command phase, select one friendly FORGE WORLD> SKITARII CORE unit within 9\" of this WARLORD, or select one friendly FORGE WORLD> CORE DATA-TETHER unit on the battlefield. Until the start of your next Command phase, that unit is eligible to shoot in a turn in which it Fell Back."
  },
  {
    "faction_id": "AdM",
    "faction_name": "Adeptus Mechanicus",
    "type": "Warlord Traits",
    "roll": "4",
    "name": "ARCHIVED ENGAGEMENTS",
    "legend": "Drawing upon the minutiae of servo-recorded conflicts, the warlord feeds adjusted protocols into the data-nets of their warriors, granting them a hyper-predictive combat awareness.",
    "description": "In your Command phase, select one friendly FORGE WORLD> SKITARII CORE unit within 9\" of this WARLORD, or select one friendly FORGE WORLD> CORE DATA-TETHER unit on the battlefield. Until the start of your next Command phase, if that unit is within Engagement Range of any enemy units at the start of the Fight phase, it can fight first that phase."
  },
  {
    "faction_id": "AdM",
    "faction_name": "Adeptus Mechanicus",
    "type": "Warlord Traits",
    "roll": "5",
    "name": "FIREPOINT TELEMETRY CACHE",
    "legend": "Optimal firepoints have been surveyed and stored by the warlord in encoded crypto-caches. When the cache seals are broken the warlord directs his charges in the golden ratios of obscuration.",
    "description": "In your Command phase, select one friendly FORGE WORLD> SKITARII CORE unit within 9\" of this WARLORD, or select one friendly FORGE WORLD> CORE DATA-TETHER unit on the battlefield. Until the start of your next Command phase, each time a ranged attack is allocated to a model in that unit:  \n* It is treated as receiving the benefits of Light Cover against that attack.\n* If that model is entirely on or within a terrain feature and has the INFANTRY keyword, add an additional 1 to any armour saving throw made against that attack."
  },
  {
    "faction_id": "AdM",
    "faction_name": "Adeptus Mechanicus",
    "type": "Warlord Traits",
    "roll": "6",
    "name": "EYES OF THE OMNISSIAH",
    "legend": "The warlord accumulates datapoints from servoskulls in order to catalogue enemy movements, allowing their Skitarii to ambush enemies.",
    "description": "In your Command phase, select one friendly FORGE WORLD> SKITARII CORE unit within 9\" of this WARLORD, or select one friendly FORGE WORLD> CORE DATA-TETHER unit on the battlefield. Until the start of your next Command phase, you can re-roll Advance rolls and charge rolls made for that unit."
  },
  {
    "faction_id": "AdM",
    "faction_name": "Adeptus Mechanicus",
    "type": "Warlord Traits",
    "roll": "1",
    "name": "EMOTIONLESS CLARITY",
    "legend": "With a mind blissfully unsullied by the passions common to the flesh, the warlord imparts the detached logic of his priorities unto his minions. They will know the perfection of serving without the pressures of survival.",
    "description": "In your Command phase, select one friendly FORGE WORLD> CULT MECHANICUS CORE unit within 6\" of this WARLORD. Until the start of your next Command phase, that unit is eligible to charge in a turn in which it Fell Back."
  },
  {
    "faction_id": "AdM",
    "faction_name": "Adeptus Mechanicus",
    "type": "Warlord Traits",
    "roll": "2",
    "name": "MASTERWORK BIONICS",
    "legend": "Human flesh is an anachronism, a sad legacy of a civilisation whose time has come and gone. Perfection is in crafting.",
    "description": "* This WARLORD has a 4+ invulnerable save.\n* Each time an attack is allocated to this WARLORD, subtract 1 from the Damage characteristic of that attack (to a minimum of 1)."
  },
  {
    "faction_id": "AdM",
    "faction_name": "Adeptus Mechanicus",
    "type": "Warlord Traits",
    "roll": "3",
    "name": "FIRST-HAND FIELD TESTING",
    "legend": "True innovation is rare among the forge worlds, and orthodox construct testing may take centuries of study. Once the stage of field testing is reached, however, only the truly blessed of the Machine Cult are fit to bear such works of divine creation.",
    "description": "When you select this Warlord Trait, select one weapon this WARLORD is equipped with (excluding Relics). Add 1 to the Strength and Damage characteristics of that weapon."
  },
  {
    "faction_id": "AdM",
    "faction_name": "Adeptus Mechanicus",
    "type": "Warlord Traits",
    "roll": "4",
    "name": "NECROMECHANIC",
    "legend": "The blessed healing of machinery is the sign of a true shepherd of the Omnissiah’s flock.",
    "description": "Each time this WARLORD uses its Master of the Machines ability, the model being repaired regains up to 3 lost wounds instead of D3."
  },
  {
    "faction_id": "AdM",
    "faction_name": "Adeptus Mechanicus",
    "type": "Warlord Traits",
    "roll": "5",
    "name": "CARTOGRAMMATIST",
    "legend": "From atmospheric strata to the planet’s core, the Tech-Priest has inloaded every feature of this world in advance. With such knowledge, the warlord can dispatch their servants to sites of techno-religious interest with uncanny accuracy.",
    "description": "When you select this Warlord Trait, select one friendly FORGE WORLD> CULT MECHANICUS CORE unit from your army. That unit gains the following ability:  \n  \n‘Orbital Teleportarium**:** During deployment, you can set up this unit in orbit instead of setting it up on the battlefield. If you do so, then in the Reinforcements step of one of your Movement phases, you can set up this unit anywhere on the battlefield that is more than 9\" away from any enemy models.’"
  },
  {
    "faction_id": "AdM",
    "faction_name": "Adeptus Mechanicus",
    "type": "Warlord Traits",
    "roll": "6",
    "name": "SUPERVISORY RADIANCE",
    "legend": "This warlord’s devout minions all feel the Tech-Priest’s watchful presence as a divine radiance. Under such holy scrutiny, warriors are imbued with the precision and strength of the Machine God’s chosen.",
    "description": "At the start of the Fight phase, select one friendly FORGE WORLD> CULT MECHANICUS CORE unit within 9\" of this WARLORD. Until the start of the next Fight phase, each time a model in that unit makes a melee attack, you can re-roll the hit roll."
  },
  {
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "type": "Warlord Traits",
    "roll": "1",
    "name": "FAVOUR OF CEGORACH",
    "legend": "To be possessed of supernatural fortune is a sure sign of Cegorach’s favour.",
    "description": "Once per turn, when you make a melee hit roll, a melee wound roll or a saving throw for this WARLORD, after making the roll, you can treat the result as an unmodified roll of 6 instead."
  },
  {
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "type": "Warlord Traits",
    "roll": "2",
    "name": "FRACTAL STORM",
    "legend": "In the cut and thrust of battle, this warlord performs rapid movements that maximise the effect of their holo-suit to better evade their enemys blows.",
    "description": "Each time an attack is made against this WARLORD, your opponent cannot re-roll the hit roll, the wound roll or the damage roll for that attack."
  },
  {
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "type": "Warlord Traits",
    "roll": "3",
    "name": "A FOOT IN THE FUTURE",
    "legend": "This warlord flows like starlight across the field of battle.",
    "description": "* Each time this WARLORD Advances, do not make an Advance roll. Instead, until the end of the phase, add D3+3\" to the Move characteristic of this WARLORD.\n* Each time you make a charge roll for this WARLORD, you can add 6 to the result."
  },
  {
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "type": "Warlord Traits",
    "roll": "",
    "name": "FATE READER",
    "legend": "Using their prescience to discern the enemy commander’s intentions, this warlord can react before the foe’s plans even come into action.",
    "description": "After you make a Strands of Fate roll, if this WARLORD is on the battlefield, you can choose to retain one additional dice."
  },
  {
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "type": "Warlord Traits",
    "roll": "",
    "name": "MASTER OF AMBUSH",
    "legend": "This warlord is adept at directing the activities of nearby warriors, allowing some of their number to accomplish complex tasks while their fellows provide covering fire.",
    "description": "* In your Command phase, you can select one ALAITOC INFANTRY CORE unit within 9\" of this WARLORD. Until the end of the turn, if that unit is performing an action, it can still make attacks with ranged weapons without that action failing.\n* At the start of the first battle round, before the first turn begins, if this WARLORD is on the battlefield, you can select one other friendly ALAITOC RANGERS unit on the battlefield. Remove that unit from the battlefield, and set it up anywhere on the battlefield that is more than 9\" away from the enemy deployment zone and any enemy models (if both players have abilities that redeploy units before the first turn begins, roll off; the winner chooses who redeploys their units first)."
  },
  {
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "type": "Warlord Traits",
    "roll": "",
    "name": "NATURAL LEADER",
    "legend": "Tactical acumen and the use of targeting matrices are second nature to this battle-seasoned warlord.",
    "description": "In your Command phase, you can select one friendly BIEL-TAN CORE unit within 6\" of this WARLORD. Until the end of the turn, each time a model in that unit makes an attack, you can re-roll the hit roll."
  },
  {
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "type": "Warlord Traits",
    "roll": "",
    "name": "ENDURING RESOLVE",
    "legend": "Resolute in mind and body, this warlord’s willpower is second to none, and serves them well on the battlefield.",
    "description": "Each time this WARLORD would lose a wound, roll one D6: on a 5+, that wound is not lost."
  },
  {
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "type": "Warlord Traits",
    "roll": "",
    "name": "WILD RIDER CHIEFTAIN",
    "legend": "To the bravest goes the glory, as they say aboard Saim-Hann.",
    "description": "* Add 1 to this WARLORD’s Attacks characteristic.\n* This WARLORD is eligible to perform a Heroic Intervention if it is within 6\" horizontally and 5\" vertically of any enemy unit, instead of 3\" horizontally and 5\" vertically. Each time this WARLORD makes a Heroic Intervention move, it can move up to 6\" instead of 3\". All other rules for Heroic Interventions still apply."
  },
  {
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "type": "Warlord Traits",
    "roll": "",
    "name": "WARDEN OF SOULS",
    "legend": "This warrior of the Reborn is the keeper of many souls; their mastery over deathly energy is unparalleled.",
    "description": "* At the start of your Command phase, this WARLORD regains 1 lost wound.\n* When this WARLORD is selected to fight, if any enemy units within Engagement Range of this WARLORD are below Starting Strength, until the end of the phase, add 1 to this WARLORD’s Strength and Attacks characteristics."
  },
  {
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "type": "Warlord Traits",
    "roll": "",
    "name": "PLAYER OF THE LIGHT",
    "legend": "This heroic protagonist pauses briefly to strike a mocking pose, their enemies laying slain around their feet, before disappearing again to continue their murderous dance elsewhere.",
    "description": "* This WARLORD is eligible to perform a Heroic Intervention if it is within 6\" horizontally and 5\" vertically of any enemy unit, instead of 3\" horizontally and 5\" vertically. Each time this WARLORD makes a Heroic Intervention move, it can move up to 6\". All other rules for Heroic Interventions still apply.\n* Each time this WARLORD fights, if it made a charge move or performed a Heroic Intervention this turn, then until that fight is resolved, add 1 to the Strength and Attacks characteristics of this WARLORD."
  },
  {
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "type": "Warlord Traits",
    "roll": "",
    "name": "PLAYER OF THE DARK",
    "legend": "Those who lead Troupes of the Dark portray the most cruel and macabre personalities, and their violent acts exist as vivid living nightmares in the folklore of the Aeldari and their enemies alike.",
    "description": "Each time this WARLORD makes a melee attack, on an unmodified wound roll of 5+, the target suffers 1 mortal wound in addition to any normal damage."
  },
  {
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "type": "Warlord Traits",
    "roll": "",
    "name": "PLAYER OF THE TWILIGHT",
    "legend": "The leaders of the Twilight see cycles of transition in everything, obsessing over each detail before revealing their true genius.",
    "description": "* While this WARLORD is on the battlefield, each time you or your opponent spends any Command points to use a Stratagem, you can roll one D6 for each Command point spent: on a 6, you gain 1 Command point.\n* While this WARLORD is on the battlefield, each time you roll four or more dice for a Luck of the Laughing God roll, you gain 1 Command point."
  },
  {
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "type": "Codex Supplement: Altansar",
    "roll": "1",
    "name": "MASTER OF RUNE-WARDING",
    "legend": "This warlord has become a master of suppressing the manifestations and corrupting influence of the warp.",
    "description": "* In your opponent’s Psychic phase, if this WARLORD has the PSYKER keyword, this WARLORD can attempt to deny one additional psychic power that phase; otherwise, this WARLORD can attempt to deny one psychic power that phase as if it were a PSYKER.\n* You can re-roll Deny the Witch tests taken for this WARLORD."
  },
  {
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "type": "Codex Supplement: Altansar",
    "roll": "2",
    "name": "A BEACON OF LIGHT IN THE DARKNESS",
    "legend": "This warlord is an inspiring figure to their fellow Altansari, fully committed to the well-being of their people as well as the destruction of their enemies. The warlord’s mere presence encourages warriors around to greater feats of courage and to fight harder.",
    "description": "In your Command phase, select one friendly ALTANSAR unit within 9\" of this WARLORD. Until the start of your next Command phase:  \n* If the selected unit is performing an action, it can make ranged attacks without that action failing.\n* The selected unit can still perform actions in a turn in which it Advanced or Fell Back."
  },
  {
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "type": "Codex Supplement: Altansar",
    "roll": "3",
    "name": "WEAVER OF THE BLADE STORM",
    "legend": "This warlord has learnt much from the Altansar schools of thought that emphasise using massed firepower to annihilate the foe, which were formed after countless battles to drive daemons out of the craftworld. As a result, they drill their warriors relentlessly to deliver volley after devastating volley into the enemy.",
    "description": "In your Command phase, select one friendly ALTANSAR CORE unit within 9\" of this WARLORD. Until the start of your next Command phase, each time a model in the selected unit makes an attack with a shuriken weapon, an unmodified hit roll of 6 automatically wounds the target."
  },
  {
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "type": "Warlord Traits",
    "roll": "1",
    "name": "AMBUSH OF BLADES",
    "legend": "The warlord commands their kin to level a storm of blades, energy blasts and razor-edged shurikens into the foe.",
    "description": "In your Command phase, select one friendly CRAFTWORLD> CORE or CRAFTWORLD> CHARACTER unit within 9\" of this WARLORD. Until the start of your next Command phase, each time a model in that unit makes a melee attack, improve the Armour Penetration characteristic of that attack by 1."
  },
  {
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "type": "Warlord Traits",
    "roll": "2",
    "name": "WALKER OF MANY PATHS",
    "legend": "The hard-earned skills of this war leader have been honed by walking the many Paths of the Aeldari.",
    "description": "Once per turn, you can re-roll one hit roll, one wound roll or one damage roll made for this WARLORD."
  },
  {
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "type": "Warlord Traits",
    "roll": "3",
    "name": "FALCON’S SWIFTNESS",
    "legend": "This warlord moves across broken ruins and blasted battlefields with astonishing agility as they close with those they hunt.",
    "description": "* Add 2\" to this WARLORD’s Move characteristic.\n* This WARLORD can ignore the effects of the Difficult Ground terrain trait.\n* Each time this WARLORD makes a Battle Focus move, do not roll a dice. Instead, this WARLORD can move up to 6\"."
  },
  {
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "type": "Warlord Traits",
    "roll": "4",
    "name": "FATE’S MESSENGER",
    "legend": "The strands of fate coil and twist around this warlord, the paths of destiny manipulated to keep them from harm so that they might strike back at their foes.",
    "description": "Once per turn, when a saving throw made for this WARLORD is failed, you can change the Damage characteristic of that attack to 0."
  },
  {
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "type": "Warlord Traits",
    "roll": "5",
    "name": "MARK OF THE INCOMPARABLE HUNTER",
    "legend": "This warlord is a skilled hunter and a master marksman. They place their shots precisely where they are most needed, each kill tipping the course of the battle to their advantage.",
    "description": "Each time this WARLORD makes a ranged attack:  \n* Add 1 to the Strength characteristic of that attack\n* An unmodified wound roll of 6 inflicts one mortal wound on the target in addition to any normal damage."
  },
  {
    "faction_id": "AE",
    "faction_name": "Aeldari",
    "type": "Warlord Traits",
    "roll": "6",
    "name": "SEER OF THE SHIFTING VECTOR",
    "legend": "This warlord is wise enough to read the skeins of destiny, seeing many possible futures amidst the mayhem of combat.",
    "description": "While this WARLORD is on the battlefield, each time you or your opponent spends any Command points to use a Stratagem, you can roll one D6 for each Command point spent: on a 6, you gain 1 Command point."
  },
  {
    "faction_id": "AM",
    "faction_name": "Astra Militarum",
    "type": "Codex Supplement: Cadia",
    "roll": "1",
    "name": "STEEL DISCIPLINE (AURA)",
    "legend": "This warlord is the epitome of the famed Cadian discipline, and his example reinforces the military efficiency bred into the bones of all those under his gaze.",
    "description": "While a friendly CADIAN unit is performing an action within 6\" of this model, that unit can shoot without that action failing."
  },
  {
    "faction_id": "AM",
    "faction_name": "Astra Militarum",
    "type": "Codex Supplement: Cadia",
    "roll": "2",
    "name": "GIFTED COMMANDER",
    "legend": "Even amongst the lauded strategists and tacticians of Cadia this warlord is a renowned logistician, always knowing where best to position their forces.",
    "description": "After both players have deployed their armies, but before the first battle round begins, select either one CADIAN VEHICLE unit (excluding TITANIC units) from your army that is in your deployment zone, or up to three non-VEHICLE CADIAN units from your army that are in your deployment zone, and redeploy them. If the mission uses the Strategic Reserves rules, any of those units can be placed into Strategic Reserves without having to spend any additional CPs, regardless of how many units are already in Strategic Reserves. If both players have abilities that redeploy units, roll off; the winner chooses who redeploys their units first."
  },
  {
    "faction_id": "AM",
    "faction_name": "Astra Militarum",
    "type": "Codex Supplement: Cadia",
    "roll": "3",
    "name": "MIND LIKE A FORTRESS (AURA)",
    "legend": "All Cadians receive a no-nonsense introduction to the perils of psyker-taint in their youth, but few are able to resist its malign touch like this warlord, and his example steels the minds and souls of his soldiers.",
    "description": "While a friendly CADIAN unit is within 6\" of this model, in the enemy’s Psychic phase, each time a model in that unit would lose a wound as the result of a mortal wound, roll one D6: on a 5+, that wound is not lost."
  },
  {
    "faction_id": "AM",
    "faction_name": "Astra Militarum",
    "type": "Warlord Traits",
    "roll": "1",
    "name": "GRAND STRATEGIST",
    "legend": "This Warlord is capable of precisely anticipating the ebb and flow of war.",
    "description": "Whilst your Warlord is alive, you can re-roll a single hit roll, wound roll or saving throw per battle. In addition, if your army is Battle-forged and this Warlord is on the battlefield, roll a D6 for each Command Point you spend to use a Stratagem; on a 5+ that Command Point is immediately refunded."
  },
  {
    "faction_id": "AM",
    "faction_name": "Astra Militarum",
    "type": "Warlord Traits",
    "roll": "2",
    "name": "OLD GRUDGES",
    "legend": "The Warlord has learned his nemesis’ weakness, and will exploit it ruthlessly.",
    "description": "After deployment, but before the first battle round begins, choose a unit in your opponent’s army. You can re-roll failed wound rolls for ASTRA MILITARUM units from your army that target the unit you chose whilst they are within 6\" of your Warlord."
  },
  {
    "faction_id": "AM",
    "faction_name": "Astra Militarum",
    "type": "Warlord Traits",
    "roll": "3",
    "name": "IMPLACABLE DETERMINATION",
    "legend": "The Warlord is known for leading swift and inexorable advances.",
    "description": "When your Warlord and a single friendly unit within 3\" of them Advances, they may both add 6\" to their Move characteristic for that Movement phase instead of rolling a dice."
  },
  {
    "faction_id": "AM",
    "faction_name": "Astra Militarum",
    "type": "Warlord Traits",
    "roll": "4",
    "name": "DRACONIAN DISCIPLINARIAN",
    "legend": "The Warlord believes that to spare the lash is to spoil the soldier, and is never hesitant in dealing out despotic punishments. His men fear his wrath more than any mortal foe.",
    "description": "You can re-roll failed Morale tests for friendly ASTRA MILITARUM INFANTRY units within 6\" of your Warlord in the Morale phase. If a COMMISSAR has this Warlord Trait, then their Summary Execution ability takes precedence, but if the re-rolled Morale test is also failed then D3 additional models are slain and the test is then considered to have passed."
  },
  {
    "faction_id": "AM",
    "faction_name": "Astra Militarum",
    "type": "Warlord Traits",
    "roll": "5",
    "name": "BELLOWING VOICE",
    "legend": "Every order given by this Warlord is bellowed to his men with perfect clarity and at ear-splitting volume, ensuring those under his command know his will and act on it without hesitation.",
    "description": "Add 3\" to the range of any abilities on your Warlord’s datasheet (such as Aura of Discipline or Voice of Command)."
  },
  {
    "faction_id": "AM",
    "faction_name": "Astra Militarum",
    "type": "Warlord Traits",
    "roll": "6",
    "name": "MASTER OF COMMAND",
    "legend": "This Warlord commands his forces with a masterful knowledge of their abilities and even individual personalities, ensuring he gets the best from the men around him.",
    "description": "Your Warlord gains the Voice of Command ability. If your Warlord already has the Voice of Command or Tank Orders ability, they may instead issue one additional order per turn. If your Warlord is a COMMISSAR, it can issue an order to any REGIMENT> INFANTRY unit (irrespective of what regiment that unit is from – e.g. MILITARUM TEMPESTUS, CADIAN, etc.)"
  },
  {
    "faction_id": "AM",
    "faction_name": "Astra Militarum",
    "type": "Warlord Traits",
    "roll": "Cadian",
    "name": "Superior Tactical Training",
    "legend": "Cadian officers are known for their strategic excellence, as are those they command. Their long training and curt, well-established battle cant allows them to issue the right order at the right time with consummate speed and efficiency.",
    "description": "Roll a dice each time your Warlord issues an order or tank order. On a 4+ that order can affect an additional CADIAN unit of the same type as the original target (INFANTRY or VEHICLE excluding TITANIC) within 6\" of the Warlord."
  },
  {
    "faction_id": "AM",
    "faction_name": "Astra Militarum",
    "type": "Warlord Traits",
    "roll": "Catachan",
    "name": "Lead From the Front",
    "legend": "Catachan officers dive into the thick of the fray without hesitation, their blades and their teeth bared – mortal enemies hold little fear for those who have fought the mega-fauna of a death world jungle and survived.",
    "description": "This Warlord can perform a Heroic Intervention if, after the enemy has completed all their charge moves, they are within 6\" of any enemy units. This Warlord can move up to 6\" when performing a Heroic Intervention, so long as they end the move closer to the nearest enemy model. In addition, if your Warlord charged, was charged or performed a Heroic Intervention, then until the end of the turn you can re-roll failed hit rolls made for them."
  },
  {
    "faction_id": "AM",
    "faction_name": "Astra Militarum",
    "type": "Warlord Traits",
    "roll": "Valhallan",
    "name": "Tenacious",
    "legend": "Valhallan officers are famously merciless, and freely sacrifice the lives of their men in order to carry the day – yet they are not afraid of danger, and will fight on even when sustaining deep wounds, the better to inspire obedience in their men.",
    "description": "Roll a dice each time your Warlord suffers a wound or mortal wound. On a 5+, the wound is ignored. If your Warlord has the VEHICLE keyword, the wound is ignored on a roll of a 6+ instead."
  },
  {
    "faction_id": "AM",
    "faction_name": "Astra Militarum",
    "type": "Warlord Traits",
    "roll": "Vostroyan",
    "name": "Honoured Duellist",
    "legend": "The sword-forms of the Vostroyan aristocracy are steeped in tradition, yet at their heart is a deadly efficacy of movement – those trained in such honour duels make formidable opponents at close quarters.",
    "description": "Re-roll failed hit and wound rolls in the Fight phase for attacks made by your Warlord."
  },
  {
    "faction_id": "AM",
    "faction_name": "Astra Militarum",
    "type": "Warlord Traits",
    "roll": "Armageddon",
    "name": "Ex-gang Leader",
    "legend": "It is common amongst the regiments of Armageddon to recruit from the underhive gangs of the planet’s towering metropoli – those who once led gangs in urban warfare fight dirty even on the field of open war.",
    "description": "Add 1 to this Warlord’s Attacks characteristic. In addition, add 1 to any wound rolls made for your Warlord in the Fight phase."
  },
  {
    "faction_id": "AM",
    "faction_name": "Astra Militarum",
    "type": "Warlord Traits",
    "roll": "Tallarn",
    "name": "Swift Attacker",
    "legend": "The Tallarn way of war is to ebb and flow, to fall back and to sprint forward at a single barked command from their leaders. To fight them is to fight a hurricane of blades, bolts and las blasts that can change direction in a heartbeat.",
    "description": "Your Warlord and all friendly TALLARN units within 6\" of them can charge even if they Fell Back that turn."
  },
  {
    "faction_id": "AM",
    "faction_name": "Astra Militarum",
    "type": "Warlord Traits",
    "roll": "Militarum Tempestus",
    "name": "Faithful Servant of the Throne",
    "legend": "The Scions of the Militarum Tempestus, raised by the punitively strict Schola Progenia, are possessed of an iron mental fortitude. The strongest amongst them have a faith that can turn aside hostile psychic emanations.",
    "description": "Your Warlord can attempt to deny one psychic power in each enemy Psychic phase in the same manner as a Psyker."
  },
  {
    "faction_id": "AM",
    "faction_name": "Astra Militarum",
    "type": "Warlord Traits",
    "roll": "Mordian",
    "name": "Iron Discipline",
    "legend": "The steel in the soul of Mordian’s officers is further hardened by a lifetime of oppression and conflict – those who fight under their stern gaze are inspired to battle on even against impossible odds.",
    "description": "Roll a dice for each model that flees from any friendly MORDIAN units within 6\" of your Warlord in the Morale phase. On a 4+, that model does not flee."
  },
  {
    "faction_id": "AS",
    "faction_name": "Adepta Sororitas",
    "type": "Codex Supplement: Order of the Bloody Rose",
    "roll": "1",
    "name": "FIERY EXAMPLE",
    "legend": "This warlord leads by example, plunging into the foe without hesitation, seeking out the most execrable of heretics and laying them low in the name of the God-Emperor.",
    "description": "* Each time this WARLORD makes a melee attack against a CHARACTER unit, add 1 to that attack’s wound roll.\n* Each time this WARLORD destroys an enemy CHARACTER unit, you gain 2 Miracle dice."
  },
  {
    "faction_id": "AS",
    "faction_name": "Adepta Sororitas",
    "type": "Codex Supplement: Order of the Bloody Rose",
    "roll": "2",
    "name": "INCANDESCENT REPRISAL",
    "legend": "Even the mightiest strike cannot stay the inflamed passions of this warlord. Many a would-be impious executioner has struck what they believed a killing blow, only to be cut down in their turn.",
    "description": "* Each time this WARLORD would lose a wound, roll one D6: on a 5+, that wound is not lost.\n* Once per phase, after an enemy unit shoots or fights, if this WARLORD suffered any wounds as a result of those attacks:  \n   * If this WARLORD is not within Engagement Range of any enemy units, this WARLORD can shoot with one ranged weapon it is equipped with. It can only target that enemy unit when doing so, and only if that enemy unit is an eligible target.  \n   * If this WARLORD is within Engagement Range of any enemy units and has not already been selected to fight during this phase, it can immediately be selected to fight. It can only target that enemy unit when doing so, and only if that enemy unit is an eligible target."
  },
  {
    "faction_id": "AS",
    "faction_name": "Adepta Sororitas",
    "type": "Codex Supplement: Order of the Bloody Rose",
    "roll": "3",
    "name": "RED-HANDED CASTIGATOR",
    "legend": "As this zealous commander cuts down the foe, their bellowed prayers echo across the tumult of battle, fuelling the holy rage and devout determination of their fellow Sisters.",
    "description": "* Each time you gain a Miracle dice at the end of a phase as a result of the Vengeance ability, if this WARLORD destroyed any enemy units during that phase, that Miracle dice is automatically a 6.\n* Each time this WARLORD makes a melee attack, if this WARLORD made a charge move, was charged or performed a Heroic Intervention this turn, you can re-roll that attack’s hit roll."
  },
  {
    "faction_id": "AS",
    "faction_name": "Adepta Sororitas",
    "type": "Warlord Traits",
    "roll": "1",
    "name": "INSPIRING ORATOR",
    "legend": "Those who hear this leader’s stirring words are inspired to great feats of bravery.",
    "description": "* Each time this WARLORD intones a hymn or uses an ability in your Command phase that specifies a range, you can add 3\" to the range of that hymn or ability. This does not affect the Miracle range of any abilities.\n* This WARLORD has the following ability: ‘Inspiring Orator (Aura)**:** While a friendly ORDER> CORE unit is within 6\" of this WARLORD, that unit ignores the Combat Attrition penalty for being below Half-strength.’"
  },
  {
    "faction_id": "AS",
    "faction_name": "Adepta Sororitas",
    "type": "Warlord Traits",
    "roll": "2",
    "name": "RIGHTEOUS RAGE",
    "legend": "This servant of the divine can barely contain their desire to strike down the unfaithful.",
    "description": "Each time this WARLORD makes a melee attack, you can re-roll the hit roll and you can re-roll the wound roll."
  },
  {
    "faction_id": "AS",
    "faction_name": "Adepta Sororitas",
    "type": "Warlord Traits",
    "roll": "3",
    "name": "EXECUTIONER OF HERETICS (AURA)",
    "legend": "This leader hunts down the Ecclesiarchy’s enemies and slays them without mercy.",
    "description": "While an enemy unit is within 6\" of this WARLORD:  \n* Subtract 1 from the Leadership characteristic of models in that unit.\n* Each time a Combat Attrition test is taken for that unit, subtract 1 from that Combat Attrition test."
  },
  {
    "faction_id": "AS",
    "faction_name": "Adepta Sororitas",
    "type": "Warlord Traits",
    "roll": "4",
    "name": "BEACON OF FAITH",
    "legend": "This Adepta Sororitas leader is a shining beacon of faith, whose actions on the battlefield are nothing short of miraculous.",
    "description": "At the start of your Command phase, if this WARLORD is on the battlefield, you gain 1 Miracle dice. This Miracle dice can only be used when your WARLORD performs an Act of Faith or uses a Miraculous ability, and if not used by the start of your next Command phase, it is discarded. This Miracle dice can be used to perform an Act of Faith even if another unit from your army has already performed an Act of Faith this phase."
  },
  {
    "faction_id": "AS",
    "faction_name": "Adepta Sororitas",
    "type": "Warlord Traits",
    "roll": "5",
    "name": "INDOMITABLE BELIEF (AURA)",
    "legend": "This chosen champion has such strength of belief that their followers refuse to yield.",
    "description": "While a friendly ORDER> CORE INFANTRY unit is within 6\" of this WARLORD, the invulnerable save models in that unit receive from the Shield of Faith ability is improved by 1 (to a maximum of 4+)."
  },
  {
    "faction_id": "AS",
    "faction_name": "Adepta Sororitas",
    "type": "Warlord Traits",
    "roll": "6",
    "name": "PURE OF WILL",
    "legend": "With a will of adamant, this devout servant’s faith can turn aside even the most foul witchcraft.",
    "description": "* This WARLORD can attempt to deny one additional psychic power in your opponent’s Psychic phase, as described in the Shield of Faith ability.\n* Add 3 to Deny the Witch tests taken for this WARLORD."
  },
  {
    "faction_id": "AS",
    "faction_name": "Adepta Sororitas",
    "type": "Codex Supplement: Order of Our Martyred Lady",
    "roll": "1",
    "name": "SAINTLY EXAMPLE",
    "legend": "With her final breath is another heroine elevated to the ranks of sainthood, her death stirring her greatest companions to step up in her stead, and finish what she has started.",
    "description": "* In addition to this Warlord Trait, this WARLORD has one randomly generated Warlord Trait from the Adepta Sororitas Warlord traits table in _Codex: Adepta Sororitas_. Each Warlord Trait in your army must be unique, so re-roll duplicate results.\n* If this WARLORD is destroyed, you can immediately select another ORDER OF OUR MARTYRED LADY CHARACTER model from your army that does not have a Warlord Trait. Then, select a Warlord Trait that no model in your army has (this must be a Warlord Trait that the model you just selected can have, and it cannot be Saintly Example). Until the end of the battle, that model gains that Warlord Trait and for all rules purposes now counts as your WARLORD. If any mission objectives, secondary objective or Agenda rules are triggered when your WARLORD is destroyed, those rules are not triggered until after the new WARLORD is destroyed."
  },
  {
    "faction_id": "AS",
    "faction_name": "Adepta Sororitas",
    "type": "Codex Supplement: Order of Our Martyred Lady",
    "roll": "2",
    "name": "SAINT KATHERINE’S LEGACY",
    "legend": "The martyrdom of Saint Katherine, and the need for vengeance, has left an ever-lasting legacy amongst those that follow in her footsteps.",
    "description": "* The Spirit of the Martyr sacred rite is active for this WARLORD in addition to any others that are active for your army.\n* This WARLORD has the following ability: ‘Saint Katherines Legacy (Aura)**:** While a friendly ORDER OF OUR MARTYRED LADY unit is within 6\" of this WARLORD, if the Spirit of the Martyr sacred rite is active for your army, or for that unit, each time you roll a D6 when a model in that unit is destroyed, the attacking model suffers a mortal wound on a 5+.’"
  },
  {
    "faction_id": "AS",
    "faction_name": "Adepta Sororitas",
    "type": "Codex Supplement: Order of Our Martyred Lady",
    "roll": "3",
    "name": "MARTYR’S STRENGTH",
    "legend": "With every wound inflicted on their mortal form does a true martyrs strength grow, their suffering a prayer to the God-Emperor.",
    "description": "For each wound this WARLORD has lost, add 1 to its Strength and Attacks characteristic (to a maximum of +2 each)."
  },
  {
    "faction_id": "CA",
    "faction_name": "Astra Cartographica",
    "type": "Warlord Traits",
    "roll": "1",
    "name": "MASTER OF HIGH SOCIETY",
    "legend": "To endure the untold dangers found on the outer edges of the Imperium requires more than just superlative martial skill - it takes a mastermind of logistical organisation. Only those Rogue Traders who prepare for everything can expect to survive for long.",
    "description": "While this WARLORD is on the battlefield, each time you spend a Command point to use a Core Stratagem or Astra Cartographica Stratagem, you can roll one D6: on a 5+, that Command point is refunded."
  },
  {
    "faction_id": "CA",
    "faction_name": "Astra Cartographica",
    "type": "Warlord Traits",
    "roll": "2",
    "name": "PRIVATEER (AURA)",
    "legend": "Many Rogue Traders become obsessed with securing rare archeotech and discovering relics. Some are willing to sacrifice almost anything to recover what they have become determined to acquire.",
    "description": "While a friendly VOIDSMEN-AT-ARMS unit is within 6\" of this WARLORD:  \n* That unit has the Objective Secured ability.\n* That unit can make ranged attacks without any action it is performing failing."
  },
  {
    "faction_id": "CA",
    "faction_name": "Astra Cartographica",
    "type": "Warlord Traits",
    "roll": "3",
    "name": "DUELLIST",
    "legend": "Some Rogue Traders invest considerable time and effort into perfecting their duelling skills. Not only do these come in handy on dangerous missions, but they also impress fellow nobles at important functions.",
    "description": "Each time this WARLORD makes a melee attack:  \n* You can re-roll the hit roll.\n* An unmodified wound roll of 6 inflicts 1 mortal wound on the target in addition to any normal damage."
  },
  {
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "type": "Khorne Warlord Traits",
    "roll": "6",
    "name": "RAGE INCARNATE",
    "legend": "The fury with which this daemon hurls itself at the enemy serves as a beacon of wrath to its like-minded minions.",
    "description": "* Add 1 to Advance and charge rolls made for this WARLORD.\n* Each time a friendly LEGIONES DAEMONICA KHORNE CORE unit declares a charge against an enemy unit within Engagement Range of this WARLORD, add 1 to the charge roll made for that unit."
  },
  {
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "type": "Khorne Warlord Traits",
    "roll": "5",
    "name": "IMMENSE POWER",
    "legend": "The molten fury of the Lord of Battle rages within this daemon, and its body is swollen with unholy might.",
    "description": "Each time this WARLORD makes a melee attack, add 1 to that attack’s wound roll."
  },
  {
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "type": "Khorne Warlord Traits",
    "roll": "4",
    "name": "GLORY OF BATTLE",
    "legend": "The more foes that surround this daemon, the faster and more eagerly it fights.",
    "description": "* Add 1 to this WARLORD’s Attacks characteristic.\n* While this WARLORD is within 3\" of 6 or more enemy models, add 1 to this WARLORD’s Attacks characteristic.\n* While this WARLORD is within 3\" of 11 or more enemy models, add 1 to this WARLORD’s Attacks characteristic."
  },
  {
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "type": "Khorne Warlord Traits",
    "roll": "3",
    "name": "DEVASTATING BLOW",
    "legend": "So monstrous is the strength behind this warlords blows and so unstoppable their hatred that they can lay victims low with but a single strike.",
    "description": "Each time this WARLORD makes a melee attack, rules that ignore wounds cannot be used."
  },
  {
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "type": "Khorne Warlord Traits",
    "roll": "2",
    "name": "BRAZEN HIDE",
    "legend": "This daemon’s warpflesh is infused with rune-wrought brass that shatters blades and turns aside even the most powerful enemy blows.",
    "description": "Each time this WARLORD would lose a wound, roll one D6: on a 5+, that wound is not lost."
  },
  {
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "type": "Khorne Warlord Traits",
    "roll": "1",
    "name": "ASPECT OF DEATH (AURA)",
    "legend": "Such is the palpable aura of dread this daemon emanates that its enemies may die of sheer terror.",
    "description": "While an enemy unit is within 6\" of this WARLORD:  \n* Subtract 1 from the Leadership characteristic of models in that unit.\n* Each time a Combat Attrition test is taken for that unit, subtract 1 from that Combat Attrition test."
  },
  {
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "type": "Tzeentch Warlord Traits",
    "roll": "6",
    "name": "TYRANT OF THE WARP",
    "legend": "The sheer ensorcelled might of this daemons presence in the warp is enough to dissuade rival entities and predatory sentiences from attempting to assail it on the metaphysical battleground.",
    "description": "* This WARLORD never suffers Perils of the Warp.\n* Each time this WARLORD would lose a wound as the result of a mortal wound, roll one D6: on a 5+, that wound is not lost."
  },
  {
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "type": "Tzeentch Warlord Traits",
    "roll": "5",
    "name": "LOREKEEPER OF TZEENTCH",
    "legend": "Like some malevolent arachnid, this daemon extends its web ever further, ensnaring mortal wisdom and arcane lore and devouring it.",
    "description": "Each time this WARLORD successfully manifests a psychic power from the **Pandaemoniac discipline**, add 6\" to the range of that psychic power. If that psychic power specifies more than one range, only add 6\" to the first range specified."
  },
  {
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "type": "Tzeentch Warlord Traits",
    "roll": "4",
    "name": "WARP TETHER",
    "legend": "This daemon embeds its essence into realspace like a thorn, then exudes tendrils of energy that anchor its minions within corporeal reality.",
    "description": "* This WARLORD has the WARP LOCUS keyword.\n* This WARLORD has the following ability:\nWarp Tether (Aura)**:** While a friendly LEGIONES DAEMONICA TZEENTCH unit is within 12\" of this model, each time a Morale test is taken for that unit, you can re-roll the result."
  },
  {
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "type": "Tzeentch Warlord Traits",
    "roll": "3",
    "name": "FRACTAL MIND",
    "legend": "This daemon’s consciousness is a many-faceted tangle of infinite complexity that allows it to divide its perceptions and attention in a way that would drive mortal minds to madness.",
    "description": "If this WARLORD attempts to perform a psychic action in your Psychic phase, it can still attempt to manifest one psychic power during that phase without that psychic action failing."
  },
  {
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "type": "Tzeentch Warlord Traits",
    "roll": "2",
    "name": "INCORPOREAL FORM",
    "legend": "This daemon’s body flickers constantly in and out of reality, making it difficult for adversaries to land a telling blow against it.",
    "description": "Each time an attack is made against this WARLORD, subtract 1 from that attack’s wound roll."
  },
  {
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "type": "Tzeentch Warlord Traits",
    "roll": "1",
    "name": "BORN OF SORCERY",
    "legend": "Tapping into the infinite power of the warp comes as easily to this daemon as breathing air does to a mortal.",
    "description": "Add 1 to Psychic tests taken for this WARLORD."
  },
  {
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "type": "Nurgle Warlord Traits",
    "roll": "6",
    "name": "PESTILENT MIASMA",
    "legend": "Those who venture too close to this daemon find their injuries blackening in seconds and their infected flesh swiftly turning to rancid soup.",
    "description": "At the start of the Fight phase, roll one D6 for each enemy unit within Engagement Range of this WARLORD:  \n* On a 2-5, that enemy unit suffers 1 mortal wound.\n* On a 6, that enemy unit suffers D3 mortal wounds."
  },
  {
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "type": "Nurgle Warlord Traits",
    "roll": "5",
    "name": "OVERFLOWING FECUNDITY",
    "legend": "This daemon’s hurts are swiftly unmade amidst swift-clotting filth and rotten regrowth.",
    "description": "Each time an attack is made against this WARLORD, an unmodified wound roll of 1-3 for that attack automatically fails, irrespective of any abilities that the weapon or the model making the attack may have."
  },
  {
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "type": "Nurgle Warlord Traits",
    "roll": "4",
    "name": "PLAGUE FLY HIVE (AURA)",
    "legend": "This daemon’s hole-riddled hide supports a colony of plague flies that crawl busily in and out of its flesh, and swarm forth to bedevil the foe.",
    "description": "While an enemy unit is within 6\" of this WARLORD:  \n* Each time a model in that unit makes a melee attack, subtract 1 from that attack’s hit roll.\n* That unit cannot start to perform any actions."
  },
  {
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "type": "Nurgle Warlord Traits",
    "roll": "3",
    "name": "VIRULENT TOUCH",
    "legend": "So saturated with noxious toxins and poisons is this daemon that its merest touch causes its victims to erupt into spreading masses of buboes and sores that burst and redouble until their bodies collapse under the repugnant strain.",
    "description": "Each time this WARLORD makes a melee attack (excluding attacks made against TITANIC units), if a hit is scored, that attack automatically wounds the target."
  },
  {
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "type": "Nurgle Warlord Traits",
    "roll": "2",
    "name": "ACIDIC ICHOR",
    "legend": "Those that pierce this daemon’s straining flesh are sprayed with sizzling bile that melts through armour, flesh and bone.",
    "description": "Each time this WARLORD loses a wound as a result of a melee attack made by an enemy unit, after the attacking model’s unit has finished making its attacks, roll one D6: on a 4+, that enemy unit suffers 1 mortal wound. Each unit can only suffer a maximum of 6 mortal wounds per phase as a result of this ability."
  },
  {
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "type": "Nurgle Warlord Traits",
    "roll": "1",
    "name": "HEAVING MASS",
    "legend": "Saturated with corruption and fatted upon a diet of mortal souls, this daemon’s swollen frame seethes with unclean vitality.",
    "description": "Add 2 to this WARLORD’s Wounds characteristic."
  },
  {
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "type": "Slaanesh Warlord Traits",
    "roll": "6",
    "name": "AURA OF BEWITCHMENT (AURA)",
    "legend": "Even the most disciplined warriors succumb to this daemon’s beguilements, all thoughts lost in a haze of hallucinatory desire.",
    "description": "While an enemy unit is within 6\" of this WARLORD, that unit cannot perform actions. If that unit is performing an action when it comes into range of this ability, it immediately fails."
  },
  {
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "type": "Slaanesh Warlord Traits",
    "roll": "5",
    "name": "SAVAGE HEDONIST",
    "legend": "This daemon is a glutton for violence, striking ever harder to maintain the thrill of combat.",
    "description": "At the start of each battle round, add 1 to this WARLORD’s Strength characteristic (to a maximum of +3)."
  },
  {
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "type": "Slaanesh Warlord Traits",
    "roll": "4",
    "name": "QUICKSILVER DUELLIST",
    "legend": "A corporeal embodiment of arrogance, this daemon redoubles its efforts when humbling an enemy champion.",
    "description": "Each time this WARLORD makes a melee attack:  \n* You can re-roll the hit roll.\n* If that attack is made against an enemy CHARACTER model, you can re-roll the wound roll."
  },
  {
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "type": "Slaanesh Warlord Traits",
    "roll": "3",
    "name": "THE MURDERDANCE",
    "legend": "A performer in the maniacal dance of death, this daemon hacks and cavorts its way through the enemy ranks without ever missing a step.",
    "description": "Each time this WARLORD fights, if it made a charge move this turn, then until that fight is resolved, add D3 to its Attacks characteristic."
  },
  {
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "type": "Slaanesh Warlord Traits",
    "roll": "2",
    "name": "FATAL CARESS",
    "legend": "With a swift flick of a blade or razor-sharp claw, this daemon can inflict agonising pleasures that drive the1 victim instantly insane.",
    "description": "Each time this WARLORD makes a melee attack, on an unmodified successful wound roll of 5+, invulnerable saving throws cannot be made against that attack."
  },
  {
    "faction_id": "CD",
    "faction_name": "Chaos Daemons",
    "type": "Slaanesh Warlord Traits",
    "roll": "1",
    "name": "WARP MISTS",
    "legend": "The stuff of the warp clings to this daemon’s form, swirling around it like iridescent silks.",
    "description": "At the end of each battle round, if this WARLORD is on the battlefield, you can retain up to 2 unspent Warp Storm points."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Word Bearers",
    "roll": "1",
    "name": "THE VOICE OF LORGAR",
    "legend": "This warlord speaks with the authority of his Primarch; when he commands, others follow without question or hesitation.",
    "description": "* Add 3\" to the range of this WARLORD’s aura abilities (excluding aura abilities that are psychic powers).\n* Each time this WARLORD chants a prayer or uses an ability in your Command phase that specifies a range, until the end of the phase, you can add 3\" to the range of that prayer or ability."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Word Bearers",
    "roll": "2",
    "name": "EXALTED POSSESSION",
    "legend": "This warlord shares his flesh with a particularly powerful daemon. Physically stronger and faster than mere mortals, he venerates the Chaos pantheon with this union.",
    "description": "* This WARLORD gains the DAEMON and DAEMONKIN keywords (if it doesn’t already have them).\n* This WARLORD has a 4+ invulnerable save against ranged attacks.\n* Add 1 to the Strength, Attacks and Wounds characteristics of this WARLORD.\n* Add 2\" to the Move characteristic of this WARLORD."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Word Bearers",
    "roll": "3",
    "name": "DAEMONIC WHISPERS",
    "legend": "Insidious voices seeping form the empyrean promise boons to this warlord, but such power must be earned.",
    "description": "Each time this WARLORD chants a prayer that is heard, completes an action or psychic action, or manifests a psychic power, roll one D6: if the result is greater than the current battle round number, you gain 1 Command point."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Word Bearers",
    "roll": "4",
    "name": "MASTER OF THE UNION",
    "legend": "This warlord leads his daemonic brethren with fearsome influence, drawing forth the unholy emotions of the corrupted.",
    "description": "In your Command phase, you can select one friendly WORD BEARERS DAEMONKIN unit within 6\" of this WARLORD. Until the start of your next Command phase:  \n* Add 1 to the Strength characteristic of models in that unit.\n* Each time a model in that unit makes a melee attack, improve the Armour Penetration characteristic of that attack by 1."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Word Bearers",
    "roll": "5",
    "name": "DIABOLIST",
    "legend": "This warlord etches diabolical incantations into his armour and skin to channel the protection of the warp.",
    "description": "* Each time an attack is made against this WARLORD, your opponent cannot re-roll the wound roll.\n* Each time this WARLORD would lose a wound, roll one D6: on a 5+, that wound is not lost."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Word Bearers",
    "roll": "6",
    "name": "HATE-FUELLED DEMAGOGUE",
    "legend": "Raw vitriol and inspirational oratory spill from this warlord’s cracked lips, irrefutable rhetoric tinged with daemonic malice. His commands stoke the hatred in his minions’ hearts to incandescent levels.",
    "description": "In your Command phase, you can select one friendly WORD BEARERS unit within 6\" of this WARLORD. Until the start of your next Command phase:  \n* If that unit is a CULTISTS unit, it gains the Let the Galaxy Burn ability, and models in that unit are considered to have the HERETIC ASTARTES keyword for the purposes of that ability.\n* Each time a model in that unit makes an attack, if your army is engaged in either Wanton Destruction or Wanton Massacre, that unit is considered to be engaged in Wanton Slaughter for that attack instead."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Night Lords",
    "roll": "1",
    "name": "NIGHT HAUNTER’S CURSE",
    "legend": "Some Night Lords warlords share the same curse of foresight that plagued their Primarch.",
    "description": "Once per turn, you can change the result of a single Advance roll, hit roll, wound roll or saving throw made for this WARLORD to be a 6\\. This counts as an unmodified 6 for all rules purposes."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Night Lords",
    "roll": "2",
    "name": "ONE PIECE AT A TIME",
    "legend": "This warlord prefers to toy with his prey, striking hard and fast then slipping through the foe’s lines to strike from another unexpected angle, his injured and terrified victims completely at his mercy.",
    "description": "* Each time this WARLORD is selected to fight, after it has finished making its attacks, if any enemy models were destroyed by those attacks but their unit was not destroyed, select one of those enemy units. Until the end of the next Morale phase, subtract 1 from Combat Attrition tests taken for that enemy unit.\n* Each time this WARLORD makes a consolidation move, models in its unit can move in any direction, and can do so even if they are already touching an enemy model, provided each model finishes its move within 3\" of an enemy unit."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Night Lords",
    "roll": "3",
    "name": "MURDEROUS REPUTATION (AURA)",
    "legend": "Even amongst a breed of murderers, this warlord has gained a notorious reputation for his mastery of the killing art, such that his mere presence erodes the stoutest heart and robs stalwart warriors of their willingness to fight.",
    "description": "While an enemy unit with the Objective Secured ability is within 6\" of this WARLORD, it loses that ability."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Night Lords",
    "roll": "4",
    "name": "KILLING FURY",
    "legend": "This warlord launches himself into the heart of enemy lines to slake his thirst for butchery.",
    "description": "* Each time this WARLORD is selected to fight, if it made a charge move, was charged or performed a Heroic Intervention this turn, until that fight is resolved, add D3 to the Attacks characteristic of this WARLORD.\n* Each time this WARLORD makes a melee attack, it is considered to be engaged in Wanton Slaughter for that attack, instead of any other wanton act it is engaged in."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Night Lords",
    "roll": "5",
    "name": "ONE WITH THE SHADOWS",
    "legend": "So skilled at blending into darkness is this warlord that it is difficult to discern where his corporeal form ends and the shadows begin.",
    "description": "Each time an attack is made against this WARLORD:  \n* Your opponent cannot re-roll the hit roll.\n* Subtract 1 from that attack’s hit roll."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Night Lords",
    "roll": "6",
    "name": "DIRTY FIGHTER",
    "legend": "To this warlord, the very notion of fighting fair is alien. He will use any dishonourable trick and underhand tactic there is to gain an advantage.",
    "description": "At the start of the Fight phase, you can select one enemy unit within 3\" of this WARLORD. That unit is not eligible to fight this phase until after all eligible units from your army have done so."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Alpha Legion",
    "roll": "1",
    "name": "I AM ALPHARIUS",
    "legend": "The Alpha Legion are experts in the art of deception, and none more so than this warlord.",
    "description": "* After nominating this model to be your WARLORD, randomly determine one additional Warlord Trait for them (re-rolling duplicate results) from a Warlord Traits table of your choice that this model has access to.\n* If this WARLORD is destroyed, you can immediately select one other ALPHA LEGION CHARACTER model from your army that does not have a Warlord Trait, and select a Warlord Trait for that model to gain (this must be a Warlord Trait no other model from your army has, it must be one that model can have, and it cannot be I Am Alpharius). Until the end of the battle, that model counts as your WARLORD for all rules purposes. If any mission objective, secondary objective or Agenda rules are triggered when your WARLORD is destroyed, those rules are not triggered until this new WARLORD is destroyed."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Alpha Legion",
    "roll": "2",
    "name": "CLANDESTINE",
    "legend": "This warlord blends in with his surroundings effortlessly, an esteemed agent of discord and anarchy with millennia of infiltration experience.",
    "description": "* Each time an attack is made against this WARLORD, an unmodified hit roll of 1-3 for that attack fails, irrespective of any abilities that the weapon or the model making the attack may have.\n* Each time an attack is allocated to this WARLORD while it is receiving the benefits of cover, add an additional 1 to any armour saving throw made against that attack."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Alpha Legion",
    "roll": "3",
    "name": "HEADHUNTER",
    "legend": "No target is safe in the sights of this warlord. Enemy commanders, rallying zealots and specialist officers alike fall to pinpoint headshots, sowing confusion amongst their fragmenting army.",
    "description": "Each time you select a target for an attack made with a ranged weapon by this WARLORD, if that weapon is a Rapid Fire or Pistol weapon:  \n* You can ignore the Look Out, Sir rule.\n* You can re-roll that attack’s wound roll.\n* On an unmodified wound roll of 6, the target suffers 1 mortal wound in addition to any normal damage."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Alpha Legion",
    "roll": "4",
    "name": "MASTER OF DIVERSION",
    "legend": "A venerated tactician, this warlord makes use of feints, false signals, holo-projectors and a host of strategic diversions in their battle plans.",
    "description": "After both sides have deployed, in the Resolve Pre-battle Abilities step of the mission you are playing, you can select up to three ALPHA LEGION units from your army that are wholly within your deployment zone. Remove those units from the battlefield, then set them up anywhere on the battlefield that is wholly within your deployment zone and more than 9\" away from any enemy models. If the mission uses the Strategic Reserves rules, any of those units can be placed into Strategic Reserves without having to spend any additional CPs, regardless of how many units are already in Strategic Reserves."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Alpha Legion",
    "roll": "5",
    "name": "CULT LEADER",
    "legend": "This warlord directs the local cults personally, having trained and honed their skills during countless undercover operations of rebellion and insurgency.",
    "description": "In your Command phase, you can select one friendly ALPHA LEGION CULTISTS unit within 9\" of this WARLORD. Until the start of your next Command phase, each time a model in that unit makes an attack:  \n* Add 1 to that attack’s hit roll.\n* Improve the Armour Penetration characteristic of that attack by 1."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Alpha Legion",
    "roll": "6",
    "name": "COVERT CONTROL",
    "legend": "This warlord has led innumerable covert actions in every imaginable war zone, always stealing their prize from under their opponents nose before they realise it.",
    "description": "In your Command phase, you can select one friendly ALPHA LEGION CORE unit within 6\" of this WARLORD. Until the start of your next Command phase:  \n* That unit can shoot while performing an action without that action failing.\n* That unit has the Objective Secured ability. If a model in that unit already has this ability, that model counts as one additional model when determining control of an objective marker."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Iron Warriors",
    "roll": "1",
    "name": "SIEGE LORD",
    "legend": "This warlord has perfected siege warfare over countless millennia in the most brutal war zones. He has studied the arcane learnings of heretek reductors, uncovered the structural analyses of xenos war masons and prised STC secrets from the ragged bionic fingers of dying techmagi, so that no means of sundering enemy defences are beyond him.",
    "description": "In your Command phase, select one friendly IRON WARRIORS CORE or IRON WARRIORS VEHICLE unit within 6\" of this WARLORD. Until the start of your next Command phase, each time a model in that unit makes an attack against an enemy VEHICLE or BUILDING unit, if that attack is made with a weapon with a Strength characteristic of 7 or more, add 1 to the Damage characteristic of that attack."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Iron Warriors",
    "roll": "2",
    "name": "DAEMONSMITH",
    "legend": "This warlord has an innate understanding of the relationship between the daemon and the machine, and will use this to its full potential on the battlefield.",
    "description": "In your Command phase, select one friendly IRON WARRIORS DAEMON ENGINE, IRON WARRIORS CULT OF DESTRUCTION or IRON WARRIORS MACHINE SPIRIT unit within 6\" of this WARLORD. Until the start of your next Command phase, each time a model in that unit makes an attack, add 1 to that attack’s hit roll."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Iron Warriors",
    "roll": "3",
    "name": "UNYIELDING METTLE",
    "legend": "Warp-powered bionics, battle-damaged armour and countless ugly scars adorn this warlord, all marking incidents that would have felled lesser warriors.",
    "description": "* Add 1 to the Toughness characteristic of this WARLORD.\n* Each time this WARLORD would lose a wound, roll one D6: on a 5+, that wound is not lost."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Iron Warriors",
    "roll": "4",
    "name": "BASTION",
    "legend": "This warlord is an iron bulwark of implacable tenacity. Under his threatening gaze his warriors will hold any and all available positions, bolstering them against enemy counter-attack.",
    "description": "In your Command phase, you can select one friendly IRON WARRIORS CORE unit within 6\" of this WARLORD. Until the start of your next Command phase:  \n* Each time an enemy unit declares a charge against that unit, if that unit is not within Engagement Range of any enemy units, it can either Hold Steady or Set to Defend.\n* That unit has the Objective Secured ability. If a model in that unit already has this ability, that model counts as one additional model when determining control of an objective marker."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Iron Warriors",
    "roll": "5",
    "name": "ARCHITECT OF DESTRUCTION",
    "legend": "When destroying an enemy position calls for nothing short of ceaseless firepower, this warlord will deliver.",
    "description": "In your Command phase, you can select one friendly IRON WARRIORS CORE or IRON WARRIORS VEHICLE unit within 6\" of this WARLORD. Until the start of your next Command phase, each time a model in that unit makes an attack, if your army is engaged in either Wanton Massacre or Wanton Slaughter, that unit is considered to be engaged in Wanton Destruction for that attack instead."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Iron Warriors",
    "roll": "6",
    "name": "IMPLACABLE TASKMASTER (AURA)",
    "legend": "This warlord advances with bitter resolve and, led by his example, his followers do the same.",
    "description": "While a friendly IRON WARRIORS CORE unit is within 6\" of this WARLORD, each time that unit is selected to shoot, if that unit made a Normal Move in your previous Movement phase, then until its shooting attacks have been resolved, it counts as having Remained Stationary."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Emperor’s Children",
    "roll": "1",
    "name": "STIMULATED BY PAIN",
    "legend": "The warlords of the Emperor’s Children thrive on pain. The more grievous their injuries, the deadlier they become.",
    "description": "* Each time this WARLORD loses a wound, add 1 to its Attacks characteristic (to a maximum of +3). Each time this WARLORD regains a lost wound, subtract 1 from its Attacks characteristic.\n* When this WARLORD is destroyed, if it is within Engagement Range of any enemy units and it has not already fought this phase, do not remove it from play: it can, after the attacking model’s unit has finished making its attacks, be selected to fight. After that fight has been resolved, this WARLORD is then removed from play."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Emperor’s Children",
    "roll": "2",
    "name": "INTOXICATING MUSK (AURA)",
    "legend": "A sickly-sweet aroma emanates from this warlord, both delightful and disgusting at once. A perfumed assault on the senses intoxicates those in its vicinity.",
    "description": "While an enemy unit is within 3\" of this WARLORD, each time a model in that unit makes a melee attack, subtract 1 from that attack’s hit roll."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Emperor’s Children",
    "roll": "3",
    "name": "UNBOUND ARROGANCE",
    "legend": "This warlord’s hubris is both his greatest strength and his biggest weakness.",
    "description": "Each time this WARLORD is selected to fight, you and your opponent secretly choose a number from 1 to 3 on a D6 (we suggest turning a D6 to show the number, but concealing it behind your hand), then reveal your choices simultaneously. If the chosen numbers differ, then until that fight is resolved, add the number you chose to the Attacks characteristic of this WARLORD."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Emperor’s Children",
    "roll": "4",
    "name": "FAULTLESS DUELLIST",
    "legend": "A peerless swordsman and an exquisite example of fighting form, those who lock swords with this warlord do so at their peril.",
    "description": "* Each time this WARLORD makes a melee attack, you can re-roll the hit roll.\n* While an enemy model is within Engagement Range of this WARLORD, subtract 1 from the Attacks characteristic of that enemy model."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Emperor’s Children",
    "roll": "5",
    "name": "GLUTTON FOR PUNISHMENT",
    "legend": "This warlord revels in every sensation - even ones that would slay a lesser mortal outright.",
    "description": "* Each time an attack is allocated to this WARLORD, if this WARLORD does not have the VEHICLE keyword, subtract 1 from the Damage characteristic of that attack (to a minimum of 1).\n* Each time this WARLORD would lose a wound as the result of a mortal wound, roll one D6: on a 5+, that wound is not lost."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Emperor’s Children",
    "roll": "6",
    "name": "LOATHSOME GRACE",
    "legend": "Blessed by Slaanesh to further accentuate his perverse elegance, this warlord’s warped movements are nimble, striking and utterly abhorrent.",
    "description": "* Add 2\" to the Move characteristic of this WARLORD.\n* You can re-roll Advance and charge rolls made for this WARLORD."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "World Eaters",
    "roll": "1",
    "name": "SLAUGHTERBORN",
    "legend": "This warlord bears the favour of Khorne, his murderous prowess growing with each worthy skull claimed in his master’s name.",
    "description": "Each time an enemy CHARACTER, MONSTER or TITANIC model is destroyed by an attack made by this WARLORD, until the end of the battle, add 1 to this WARLORD’s Attacks and Strength characteristics."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "World Eaters",
    "roll": "2",
    "name": "ARCH-SLAUGHTERER",
    "legend": "When surrounded by foes to kill, this warlord is truly in his element and gives in to the Butcher’s Nails.",
    "description": "At the start of the Fight phase, if there are more enemy models than friendly models within 3\" of this WARLORD, until the end of the phase, add D3 to this WARLORD’s Attacks characteristic."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "World Eaters",
    "roll": "3",
    "name": "DISCIPLE OF KHORNE",
    "legend": "Many claim to hold the title of one of Khorne’s eight foremost champions, but any pretenders are swiftly proven false, for none can rival one of their number in the art of single combat.",
    "description": "Each time a melee attack is made by this WARLORD against a CHARACTER unit or a unit that contains any models with a Wounds characteristic of 5 or more, you can re-roll the hit roll and you can re-roll the wound roll."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "World Eaters",
    "roll": "4",
    "name": "VIOLENT URGENCY (AURA)",
    "legend": "This warlords bloodlust is palpable and pushes the Butcher’s Nails of those around him into overdrive. This, in turn, fuels a desperate need to spill blood.",
    "description": "While a friendly WORLD EATERS unit is within 6\" of this WARLORD, add 1 to Advance and charge rolls made for that unit."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "World Eaters",
    "roll": "5",
    "name": "TRUE BERZERKER",
    "legend": "When this warlord meets his foes face-to-face, his fury is such that he will brush aside even fatal wounds, the better to claim more skulls for Lord Khorne.",
    "description": "Each time an attack is allocated to this WARLORD, halve the Damage characteristic of that attack (rounding up)."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "World Eaters",
    "roll": "6",
    "name": "BATTLE-LUST",
    "legend": "This warlord’s lust for battle draws him into any and all fights, his thirst driving him to new heights of battlefield frenzy.",
    "description": "* This WARLORD is eligible to perform a Heroic Intervention if it is within 6\" horizontally and 5\" vertically of any enemy unit, instead of 3\" horizontally and 5\" vertically. Each time this WARLORD makes a Heroic Intervention move, it can move up to 6\" instead of 3\". All other rules for Heroic Interventions still apply.\n* At the start of the Fight phase, if this WARLORD is within Engagement Range of any enemy units, it can fight first that phase."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Warlord Traits",
    "roll": "1",
    "name": "FLAMES OF SPITE",
    "legend": "This warlords bitterness burns so fiercely that his weapons flicker with the fires of Chaos.",
    "description": "* Each time this WARLORD makes a melee attack, you can re-roll that attack’s wound roll.\n* Each time this WARLORD makes an attack, on an unmodified wound roll of 6, the target suffers 1 mortal wound in addition to any normal damage."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Warlord Traits",
    "roll": "2",
    "name": "UNHOLY FORTITUDE",
    "legend": "Whether it is the power of the warp flowing through this warlord’s veins that imbues him with unnatural resilience, or simply the whims of destiny and fate, he has so far proven impossible to slay.",
    "description": "Each time this WARLORD would lose a wound, roll one D6: on a 5+, that wound is not lost."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Warlord Traits",
    "roll": "3",
    "name": "HATRED INCARNATE",
    "legend": "The intense animosity that festers in this warlords soul lends his strikes a terrible, hate-fuelled strength.",
    "description": "* Each time this WARLORD fights, if it made a charge move or performed a Heroic Intervention this turn, until that fight is resolved, add 1 to the Strength and Attacks characteristics of this WARLORD.\n* Each time this WARLORD makes a melee attack, you can re-roll that attack’s hit roll."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Warlord Traits",
    "roll": "4",
    "name": "LORD OF TERROR (AURA)",
    "legend": "The aura of despair and hopelessness that surrounds this warlord brings all of his victims worst nightmares to their minds.",
    "description": "While an enemy unit is within 6\" of this WARLORD:  \n* Each time a Morale test is taken for that unit, your opponent must roll one additional D6 and discard the lowest result.\n* If that unit fails a Morale test, until the end of the phase, it is considered to be below Half-strength for the purposes of Combat Attrition tests."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Warlord Traits",
    "roll": "5",
    "name": "ETERNAL VENDETTA (AURA)",
    "legend": "This warlord has sworn never to rest in his dark crusade against his most hated foes.",
    "description": "At the start of the first battle round, before the first turn begins, select one enemy unit. Until the end of the battle, while a friendly LEGION> CORE or LEGION> CHARACTER unit is within 6\" of this WARLORD, each time a model in that LEGION> unit makes an attack against that enemy unit, you can re-roll that attack’s wound roll."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Warlord Traits",
    "roll": "6",
    "name": "GAZE OF THE GODS",
    "legend": "Favoured amongst the Dark Gods, this exalted warlord is bequeathed the immortal fury of the warp itself.",
    "description": "* This WARLORD has a 4+ invulnerable save.\n* Each time this WARLORD makes an attack, it is considered to be engaged in Wanton Slaughter, Wanton Destruction and Wanton Massacre."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Red Corsairs",
    "roll": "1-2",
    "name": "REAVER LORD",
    "legend": "This martial genius has forged an empire of cruelty from his raids.",
    "description": "At the start of your Command phase, if this WARLORD is on the battlefield, roll one D6: on a 4+, you gain 1 Command point."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Red Corsairs",
    "roll": "3-4",
    "name": "ANGEL OF HATRED",
    "legend": "This once noble warlord now revels in his deepest hatreds.",
    "description": "Each time this WARLORD fights, if it made a charge move, was charged or performed a Heroic Intervention this turn, then until that fight is resolved, add 1 to the Strength and Attacks characteristics of this WARLORD."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Red Corsairs",
    "roll": "5-6",
    "name": "DARK RAIDER",
    "legend": "The raids this warlord leads are as rapid as they are deadly.",
    "description": "Once per turn, in your Shooting phase, after shooting with a friendly RED CORSAIRS CORE unit within 6\" of this WARLORD, that unit can make a Normal Move. If it does so, that unit is not eligible to declare a charge this turn."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Creations of Bile",
    "roll": "1-2",
    "name": "SURGICAL PRECISION",
    "legend": "This warlord’s knowledge of natural and augmented anatomy is unparalleled, and their every strike is deliberate, cruel and lethal.",
    "description": "Each time this WARLORD makes a melee attack, on an unmodified hit roll of 4+, that attack automatically wounds the target and the Armour Penetration characteristic of that attack is improved by 1."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Creations of Bile",
    "roll": "3-4",
    "name": "PRIME TEST SUBJECT",
    "legend": "Only the strongest test subjects long survive the rampant cell transformations associated with Biles mysterious bio-alchemy.",
    "description": "Add 1 to the Strength, Toughness and Wounds characteristics of this WARLORD."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Creations of Bile",
    "roll": "5-6",
    "name": "TWISTED REGENERATION",
    "legend": "Not even death is able to lay the most vile of Biles creations low.",
    "description": "Once per battle, when this WARLORD is destroyed, you can choose for them to regenerate instead of using any other rules that are triggered when this WARLORD is destroyed. If you do so, mark this WARLORD’s position then remove this WARLORD from the battlefield. At the end of the phase, roll one D6: on a 2+, set this WARLORD back up on the battlefield as close as possible to the position you marked and not within Engagement Range of any enemy units, with D3 wounds remaining."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Black Legion",
    "roll": "1",
    "name": "VETERAN RAIDER",
    "legend": "A consummate raider both in the Eye of Terror and on countless worlds in realspace, this warlord knows when to strike and when to retreat.",
    "description": "In your Command phase, you can select one friendly BLACK LEGION CORE or BLACK LEGION CHARACTER unit within 6\" of this WARLORD. Until the end of the turn, that unit is eligible to shoot and declare a charge in a turn in which it Fell Back."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Black Legion",
    "roll": "2",
    "name": "INDOMITABLE",
    "legend": "This warlord has done little but fight in the millennia since Horus defeat, and he grows more resilient with each battle.",
    "description": "Each time an attack is allocated to this WARLORD, halve the Damage characteristic of that attack (rounding up)."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Black Legion",
    "roll": "3",
    "name": "MERCILESS OVERSEER",
    "legend": "This warlord is a formidable orchestrator of kill zones, expertly directing his warriors close-range firepower to scythe down any who opposes him.",
    "description": "In your Command phase, you can select one friendly BLACK LEGION unit within 6\" of this WARLORD. Until the start of your next Command phase, each time a model in that unit makes an attack, if your army is engaged in either Wanton Destruction or Wanton Slaughter, that unit is considered to be engaged in Wanton Massacre for that attack instead."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Black Legion",
    "roll": "4",
    "name": "SOUL-EATER",
    "legend": "This warlord is a peerless fighter, imbibing the very life essence of his defeated foes in a constant quest for greater power.",
    "description": "* Each time this WARLORD makes a melee attack, you can re-roll the wound roll.\n* Each time this WARLORD fights, after it has finished making its attacks, if one or more enemy models were destroyed by those attacks, this WARLORD regains up to D3 lost wounds."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Black Legion",
    "roll": "5",
    "name": "TRUSTED WAR LEADER",
    "legend": "This warlord is a high-ranking member of the Black Legion and part of the Despoilers inner circle - one of few who are permitted to call Abaddon by name and offer him advice.",
    "description": "While this WARLORD is on the battlefield, each time you spend a Command point to use a Stratagem you can roll one D6: on a 5+, that Command point is refunded."
  },
  {
    "faction_id": "CSM",
    "faction_name": "Chaos Space Marines",
    "type": "Black Legion",
    "roll": "6",
    "name": "PARAGON OF HATRED",
    "legend": "This exemplar of undying bitterness has sworn never to rest in their eternal vendetta against the Imperium as they vent their loathing against their most hated foes.",
    "description": "* You can re-roll charge rolls made for this WARLORD.\n* Each time this WARLORD fights, if it is within Engagement Range of any enemy units, then until that fight is resolved, add 1 to the Attacks characteristic of this WARLORD (if any of those enemy units have the IMPERIUM keyword, add D3 instead of 1)."
  },
  {
    "faction_id": "DG",
    "faction_name": "Death Guard",
    "type": "Warlord Traits",
    "roll": "1",
    "name": "REVOLTINGLY RESILIENT",
    "legend": "So vast and bloated has this warlord become that he is all but immune to the pain of injury.",
    "description": "Each time this WARLORD would lose a wound, roll one D6: on a 5+, that wound is not lost."
  },
  {
    "faction_id": "DG",
    "faction_name": "Death Guard",
    "type": "Warlord Traits",
    "roll": "2",
    "name": "LIVING PLAGUE (AURA)",
    "legend": "Saturated as he is with Nurgle’s contagious blessings, merely to stand before this warlord is to be assailed by an oppressive aura of plague.",
    "description": "While an enemy unit is within 3\" of this WARLORD, that unit cannot be affected by the aura abilities (excluding those that are psychic powers) of units from your opponents army."
  },
  {
    "faction_id": "DG",
    "faction_name": "Death Guard",
    "type": "Warlord Traits",
    "roll": "3",
    "name": "HULKING PHYSIQUE",
    "legend": "This Warlord’s body has become swollen with Nurgle’s divine blessings, and stands all but inviolate as a veritable behemoth of rancid flesh.",
    "description": "* Add 1 to the Wounds characteristic of this WARLORD.\n* Each time an attack is made against this WARLORD, an unmodified wound roll of 1-3 for that attack fails, irrespective of any abilities that the weapon or the model making the attack may have."
  },
  {
    "faction_id": "DG",
    "faction_name": "Death Guard",
    "type": "Warlord Traits",
    "roll": "4",
    "name": "ARCH-CONTAMINATOR (AURA)",
    "legend": "Such are this Warlord’s virulent emanations that his very presence is enough to make even the most lethal toxins and venoms deadlier still.",
    "description": "While a friendly PLAGUE COMPANY> CORE unit is within 6\" of this WARLORD:  \n* Each time a model in that unit makes a melee attack with a plague weapon, you can re-roll the wound roll.\n* Each time a model in that unit makes a ranged attack with a plague weapon that targets a unit within 12\", you can re-roll the wound roll."
  },
  {
    "faction_id": "DG",
    "faction_name": "Death Guard",
    "type": "Warlord Traits",
    "roll": "5",
    "name": "ROTTEN CONSTITUTION",
    "legend": "Nurgle’s favour takes many forms, and this Warlord’s flesh has become so rotinfested that vast chunks of it can be torn free without risk of lasting harm.",
    "description": "* Add 1 to the Toughness characteristic of this WARLORD.\n* Each time an attack with an Armour Penetration characteristic of -1 or -2 is allocated to this WARLORD, that attack has an Armour Penetration characteristic of 0 instead."
  },
  {
    "faction_id": "DG",
    "faction_name": "Death Guard",
    "type": "Warlord Traits",
    "roll": "6",
    "name": "FOUL EFFLUENTS (AURA)",
    "legend": "Liquid toxins pour from crevices in the Warlords armour, creating a miasma of filth around him that spreads all around.",
    "description": "While an enemy unit is within 6\" of this WARLORD, at the end of your Movement phase, roll one D6 for that unit: on a 4+, that unit suffers 1 mortal wound."
  },
  {
    "faction_id": "DRU",
    "faction_name": "Drukhari",
    "type": "Army of Renown: Coteries of the Haemonculi",
    "roll": "1",
    "name": "CALCULATING GAZE (AURA)",
    "legend": "A Haemonculus always keeps a close eye over their followers. Knowing they will be punished severely for failure, the Haemonculus’ lackeys work and fight all the harder.",
    "description": "While a friendly HAEMONCULUS COVEN> CORE unit is within 6\" of this WARLORD, each time a model in that unit makes an attack, re-roll a hit roll of 1."
  },
  {
    "faction_id": "DRU",
    "faction_name": "Drukhari",
    "type": "Army of Renown: Coteries of the Haemonculi",
    "roll": "2",
    "name": "SCHEMER SUPREME",
    "legend": "Haemonculi meticulously plan their schemes, anticipating every enemy movement.",
    "description": "While this WARLORD is on the battlefield, each time your opponent spends a Command point to use a Stratagem you can roll one D6: on a 5+, you gain 1 Command point."
  },
  {
    "faction_id": "DRU",
    "faction_name": "Drukhari",
    "type": "Army of Renown: Coteries of the Haemonculi",
    "roll": "3",
    "name": "ARTIST OF DARK ALCHEMY",
    "legend": "The Haemonculus is supremely skilled in developing the most effective chemicals, effluents and other foul solutions for their warriors’ weaponry.",
    "description": "Once per turn, after rolling to determine the number of attacks made with a weapon by a friendly HAEMONCULUS COVEN> CORE model whose unit is within 6\" of this WARLORD, this WARLORD can use this ability. If it does so, you can re-roll the number of attacks made with that weapon and, until the end of the phase, each time you roll to determine the number of attacks made with a weapon by a model in that unit, you can re-roll the result."
  },
  {
    "faction_id": "DRU",
    "faction_name": "Drukhari",
    "type": "Codex Supplement: Cult of Strife",
    "roll": "1",
    "name": "COMPETITIVE EDGE",
    "legend": "This Succubus trains and tests herself at every opportunity, maintaining a consistent rate of murder lest she lose her razor-sharp competitiveness.",
    "description": "Each time this WARLORD fights, if all of its attacks target one enemy unit, after resolving all of those attacks, it can make a number of additional attacks against that enemy unit equal to the number of attacks that did not reach the inflict damage step of the attack sequence during that fight."
  },
  {
    "faction_id": "DRU",
    "faction_name": "Drukhari",
    "type": "Codex Supplement: Cult of Strife",
    "roll": "2",
    "name": "UNPARALLELED AGILITY",
    "legend": "This Succubus moves with preternatural speed, even compared to the famed fighters of Commorragh’s arenas. She dances and flits around her foes, evading every clumsy blow dealt by her foes.",
    "description": "Each time an attack is made against this WARLORD, subtract 1 from that attack’s hit roll and wound roll."
  },
  {
    "faction_id": "DRU",
    "faction_name": "Drukhari",
    "type": "Codex Supplement: Cult of Strife",
    "roll": "3",
    "name": "MASTER EXECUTIONER",
    "legend": "Every blow this Warlord lands, every cut she makes and every darting strike are perfectly placed to inflict the maximum bodily trauma upon her foes.",
    "description": "Each time this WARLORD makes an attack, you can re-roll the wound roll."
  },
  {
    "faction_id": "DRU",
    "faction_name": "Drukhari",
    "type": "Warlord Traits",
    "roll": "1",
    "name": "HATRED ETERNAL",
    "legend": "This warlord is disgusted by the younger races that infest the galaxy, sickened by the unwashed and unrefined multitudes. They will take any opportunity to exterminate such vermin.",
    "description": "Each time this WARLORD makes an attack, you can re-roll the hit roll and the wound roll."
  },
  {
    "faction_id": "DRU",
    "faction_name": "Drukhari",
    "type": "Warlord Traits",
    "roll": "2",
    "name": "SOUL THIRST",
    "legend": "In place of a soul, this warlord plays host to a howling chasm of horror and madness. They must swallow thousands of souls each day to stave off complete degeneration, yet this thirst lends them a lethal ferocity.",
    "description": "* Add 1 to the Attacks characteristic of this WARLORD.\n* Once per turn, when an enemy model that is within 6\" of this WARLORD is destroyed, this model regains 1 lost wound."
  },
  {
    "faction_id": "DRU",
    "faction_name": "Drukhari",
    "type": "Warlord Traits",
    "roll": "3",
    "name": "ANCIENT EVIL",
    "legend": "So long has this warlord lived, steeped in horror and cruelty, that their very gaze is said to be capable of paralysing their foes with fear.",
    "description": "At the start of the Fight phase, you can select one enemy unit within Engagement Range of this WARLORD. That unit is not eligible to fight this phase until after all eligible units from your army have done so."
  },
  {
    "faction_id": "DRU",
    "faction_name": "Drukhari",
    "type": "Warlord Traits",
    "roll": "1",
    "name": "QUICKSILVER FIGHTER",
    "legend": "This warlord strikes with preternatural speed, slaying their foes before they even realise the fight has begun.",
    "description": "Add 2 to the Attacks characteristic of this WARLORD."
  },
  {
    "faction_id": "DRU",
    "faction_name": "Drukhari",
    "type": "Warlord Traits",
    "roll": "2",
    "name": "STIMM ADDICT",
    "legend": "Though it entails all manner of horrific side effects, this warlord is addicted to using artificial stimulants to boost their combat effectiveness.",
    "description": "When determining the effects of the Combat Drugs ability for this WARLORD before the battle, roll 2 additional dice, re-rolling results of 6 or results that are already in effect. This WARLORD’s Combat Drugs ability has these benefits in addition to any others."
  },
  {
    "faction_id": "DRU",
    "faction_name": "Drukhari",
    "type": "Warlord Traits",
    "roll": "3",
    "name": "PRECISION BLOWS",
    "legend": "This warlord is adept at slaying in a stunning display of violence, every blow placed perfectly to dismember or decapitate.",
    "description": "Each time an unmodified hit roll of 6 is made for a melee attack made by this WARLORD, the target unit suffers a number of mortal wounds equal to the Damage characteristic of the weapon used for that attack, and the attack sequence ends."
  },
  {
    "faction_id": "DRU",
    "faction_name": "Drukhari",
    "type": "Warlord Traits",
    "roll": "1",
    "name": "MASTER REGENESIST",
    "legend": "A master of fleshcrafting, this creature can rejuvenate even the most seriously wounded of minions with a flick of their bladed fingers.",
    "description": "Each time this WARLORD uses their Fleshcraft ability, the target model regains up to 3 lost wounds instead of D3."
  },
  {
    "faction_id": "DRU",
    "faction_name": "Drukhari",
    "type": "Warlord Traits",
    "roll": "2",
    "name": "MASTER NEMESINE",
    "legend": "This warlord knows a variety of ways to kill every realspace species they have ever discovered. There is no weak point unknown to them.",
    "description": "Each time this WARLORD makes an attack, re-roll a wound roll of 1."
  },
  {
    "faction_id": "DRU",
    "faction_name": "Drukhari",
    "type": "Warlord Traits",
    "roll": "3",
    "name": "MASTER ARTISAN",
    "legend": "This warlord is not only gifted in the arts of fleshcrafting and mettalosculpture, but also in the more metaphysical arts. Irrespective of the medium they work with, it is their own twisted body that bears the greatest hallmarks of their dark genius.",
    "description": "Add 1 to the Toughness and Wounds characteristics of this WARLORD."
  },
  {
    "faction_id": "GC",
    "faction_name": "Genestealer Cults",
    "type": "Warlord Traits",
    "roll": "",
    "name": "INSCRUTABLE CUNNING",
    "legend": "Those warlords who serve the Four-armed Emperor prepare the battlefield on which they fight with inhuman levels of focus.",
    "description": "Once per battle round, when you use a Genestealer Cults Strategic Ploy Stratagem or Battle Tactic Stratagem, if that Stratagem is used on a CULT OF THE FOUR-ARMED EMPEROR unit within 12\" of this WARLORD, you can reduce the CP cost of that Stratagem by 1CP (to a minimum of 0CP). Note that the CP cost is only reduced by 1CP for that use of the Stratagem, any future usages of it cost the normal amount of CPs. You can only use this ability on each Stratagem once."
  },
  {
    "faction_id": "GC",
    "faction_name": "Genestealer Cults",
    "type": "Warlord Traits",
    "roll": "",
    "name": "HIVELORD (AURA)",
    "legend": "The warlords of the Hivecult often hail from gunrunning gangs and black market military groups in which firepower is valued above all else.",
    "description": "While a friendly HIVECULT CORE unit is within 6\" of this WARLORD, each time a model in that unit makes a ranged attack, an unmodified hit roll of 6 scores 1 additional hit."
  },
  {
    "faction_id": "GC",
    "faction_name": "Genestealer Cults",
    "type": "Warlord Traits",
    "roll": "",
    "name": "SINGLE-MINDED OBSESSION (AURA)",
    "legend": "The warlords of the Bladed Cog share their host civilisation’s hyper-focused attitude to war, identifying the most threatening or valuable target amongst the enemy ranks and seeking their destruction above all else.",
    "description": "Before the battle, select one enemy unit from your opponent’s army. While a friendly BLADED COG CORE unit is within 6\" of this WARLORD, each time a model in that unit makes an attack against that enemy unit, you can re-roll the wound roll."
  },
  {
    "faction_id": "GC",
    "faction_name": "Genestealer Cults",
    "type": "Warlord Traits",
    "roll": "",
    "name": "XENOPROPHET",
    "legend": "Any one of this warlords numerous faithful would take a bullet for their prophet without hesitation.",
    "description": "* Each time you take an Unquestioning Loyalty test after a saving throw made for this WARLORD is failed, do not roll the dice; it is automatically passed.\n* Each time a saving throw made for this WARLORD is failed, for the purposes of the Unquestioning Loyalty ability, you can select one other friendly PAUPER PRINCES or BROOD BROTHERS model with that ability within 6\" of this WARLORD instead of 3\".\n* While a friendly PAUPER PRINCES CORE unit is within 6\" of this WARLORD, models in that unit can use this model’s Leadership characteristic instead of their own."
  },
  {
    "faction_id": "GC",
    "faction_name": "Genestealer Cults",
    "type": "Warlord Traits",
    "roll": "",
    "name": "BIO-ALCHEMIST",
    "legend": "From syringes and blades to their own claws, this warlord coats their tools and weapons with bioagents of their own brewing that deliver a potent electro-toxic shock to their victims.",
    "description": "Add 1 to the Damage characteristic of melee weapons this WARLORD is equipped with (excluding Relics)."
  },
  {
    "faction_id": "GC",
    "faction_name": "Genestealer Cults",
    "type": "Warlord Traits",
    "roll": "1",
    "name": "FOCUS OF ADORATION",
    "legend": "This warlord inspires such insane devotion that their minions will leap headlong into battle in order to win their favour.",
    "description": "While a friendly CULT> CORE or CULT> PURESTRAIN GENESTEALERS unit is within 6\" of this WARLORD, that unit is eligible to perform Heroic Interventions as if it were a CHARACTER unit."
  },
  {
    "faction_id": "GC",
    "faction_name": "Genestealer Cults",
    "type": "Warlord Traits",
    "roll": "2",
    "name": "SHADOW STALKER",
    "legend": "The gloom seems to cling to this warlord like a shroud as they emerge grinning from the darkness, claws flexing in anticipation of the kill.",
    "description": "Each time an attack is made against this WARLORD, subtract 1 from that attack’s hit roll."
  },
  {
    "faction_id": "GC",
    "faction_name": "Genestealer Cults",
    "type": "Warlord Traits",
    "roll": "3",
    "name": "BIOMORPH ADAPTATION",
    "legend": "The power of the Broodmind flows through this warlord’s veins, their physiology showing monstrous gifts and lethal enhancements.",
    "description": "Add 1 to the Attacks and Toughness characteristics of this WARLORD."
  },
  {
    "faction_id": "GC",
    "faction_name": "Genestealer Cults",
    "type": "Warlord Traits",
    "roll": "4",
    "name": "PROWLING AGITANT",
    "legend": "No matter how often the oppressors seek to trap or silence this warlord, they always find themselves left empty-handed and foolish, their elusive quarry long gone.",
    "description": "Once per turn, when this WARLORD is selected as the target of a charge, before the charge roll is made and after firing any Overwatch, it can make a Normal Move of up to 6\". Your opponent can then select new targets for that charge if they wish."
  },
  {
    "faction_id": "GC",
    "faction_name": "Genestealer Cults",
    "type": "Warlord Traits",
    "roll": "5",
    "name": "ALIEN MAJESTY",
    "legend": "An aura of palpable grandeur surrounds this warlord, making their mere presence a powerful stimulant to their followers.",
    "description": "* Add 3\" to the range of this WARLORD’s aura abilities (to a maximum of 9\").\n* Add 3\" to the range of the following abilities this WARLORD has (if any): Meticulous Planner; Priority Target."
  },
  {
    "faction_id": "GC",
    "faction_name": "Genestealer Cults",
    "type": "Warlord Traits",
    "roll": "6",
    "name": "PRETERNATURAL SPEED",
    "legend": "Uncannily fast in thought and deed, this warlord makes blisteringly quick attacks as its best form of defence.",
    "description": "* Each time this WARLORD makes a melee attack, you can re-roll the hit roll.\n* At the start of the Fight phase, if this WARLORD is within Engagement Range of any enemy units, it can fight first that phase."
  },
  {
    "faction_id": "GK",
    "faction_name": "Grey Knights",
    "type": "Warlord Traits",
    "roll": "1",
    "name": "DAEMON-SLAYER",
    "legend": "The warlord is a master of the rituals of banishing and unbinding, able to sever his daemonic foes’ connection to the warp and crush their mortal forms.",
    "description": "* Each time this WARLORD fights, if it made a charge move this turn, then until that fight is resolved, add 1 to its Attacks characteristic.\n* Each time this WARLORD makes a melee attack against a DAEMON unit, invulnerable saving throws cannot be made against that attack."
  },
  {
    "faction_id": "GK",
    "faction_name": "Grey Knights",
    "type": "Warlord Traits",
    "roll": "2",
    "name": "HAMMER OF RIGHTEOUSNESS",
    "legend": "Fortified by the un flagging will of his battle-brothers, the warlord lays into the foe like the hammer of the Emperor.",
    "description": "Each time this WARLORD makes a melee attack, if it made a charge move, was charged or performed a Heroic Intervention this turn, add 1 to that attack’s wound roll."
  },
  {
    "faction_id": "GK",
    "faction_name": "Grey Knights",
    "type": "Warlord Traits",
    "roll": "3",
    "name": "UNYIELDING ANVIL (AURA)",
    "legend": "The inspiring presence of the warlord reminds the Grey Knights that there can be no retreat, no matter the odds arrayed against them.",
    "description": "While a friendly GREY KNIGHTS CORE or GREY KNIGHTS CHARACTER unit is within 6\" of this WARLORD, that unit has the Objective Secured ability. If a model in such a unit already has this ability, that model counts as one additional model when determining control of an objective marker."
  },
  {
    "faction_id": "GK",
    "faction_name": "Grey Knights",
    "type": "Warlord Traits",
    "roll": "4",
    "name": "FIRST TO THE FRAY",
    "legend": "The warlord is an eager, hot-blooded warrior, ever the first to leap into the fray. Inspired by such zealous bravery, his battle-brothers are never far behind.",
    "description": "* Add 1 to Advance and charge rolls made for this WARLORD.\n* If this WARLORD has made a charge move this turn, then until the end of the turn, each time a friendly GREY KNIGHTS CORE unit declares a charge against an enemy unit that is within Engagement Range of this WARLORD, add 1 to the charge roll made for that unit."
  },
  {
    "faction_id": "GK",
    "faction_name": "Grey Knights",
    "type": "Warlord Traits",
    "roll": "5",
    "name": "NEMESIS LORD",
    "legend": "Over the course of countless battles the warlord has mastered the art of single combat. He is a force of destruction upon the battlefield, wielding his Nemesis weapon with preternatural skill.",
    "description": "Each time this WARLORD makes a melee attack with a Nemesis weapon, an unmodified hit roll of 6 automatically wounds the target."
  },
  {
    "faction_id": "GK",
    "faction_name": "Grey Knights",
    "type": "Warlord Traits",
    "roll": "6",
    "name": "PSYCHIC EPITOME",
    "legend": "The warlord employs his immense psychic potential as a conduit for his battle-brothers’ empyric powers, channelling greater energy into their sorcerous strikes.",
    "description": "At the start of each of your Psychic phases, select one friendly GREY KNIGHTS PSYKER unit within 6\" of this WARLORD. Until the end of the phase, each time that unit manifests a Witchfire psychic power, when resolving that psychic power, if an enemy unit suffers any mortal wounds, that enemy unit suffers 1 additional mortal wound."
  },
  {
    "faction_id": "HAR",
    "faction_name": "Harlequins",
    "type": "Warlord Traits",
    "roll": "",
    "name": "Nemesis of the Damned",
    "legend": "This Warlord has honed their martial skills in countless battles against the followers of the Dark Gods.",
    "description": "Each hit roll of 6+ for your Warlord in the Fight phase scores 2 hits instead of 1\\. In addition, add 1 to hit rolls made by your Warlord against CHAOS units."
  },
  {
    "faction_id": "HAR",
    "faction_name": "Harlequins",
    "type": "Warlord Traits",
    "roll": "",
    "name": "Webway Walker",
    "legend": "This Warlord steps into reality like a lie becoming truth.",
    "description": "During deployment, you can set your Warlord up in the webway instead of placing them on the battlefield. Your Warlord can emerge at the end of any of your Movement phases – set them up anywhere on the battlefield more than 9\" from any enemy units. Furthermore, you can use the Webway Assault Stratagem twice."
  },
  {
    "faction_id": "HAR",
    "faction_name": "Harlequins",
    "type": "Warlord Traits",
    "roll": "",
    "name": "Our Kin Shall Rise Again",
    "legend": "This Warlord’s sheer determination keeps them in the fight.",
    "description": "Roll a D6 each time a model from a FROZEN STARS unit from your army within 6\" of your Warlord loses its final wound; on a 6 that wound is not lost, and the model not slain. This Warlord Trait has no effect if the unit is under the effects of the Webway Dance psychic power."
  },
  {
    "faction_id": "HAR",
    "faction_name": "Harlequins",
    "type": "Warlord Traits",
    "roll": "",
    "name": "Warden of the Dead",
    "legend": "This Warlord is a gatekeeper for unquiet spirits.",
    "description": "Add 1 to any Sombre Sentinels rolls made for DREAMING SHADOW units from your army within 6\" of your Warlord (add 2 instead whilst there are any NECRONS units on the battlefield)."
  },
  {
    "faction_id": "HAR",
    "faction_name": "Harlequins",
    "type": "Warlord Traits",
    "roll": "",
    "name": "Skystrider",
    "legend": "This Warlord is one with the way of the Weaver Serpents.",
    "description": "Your Warlord can disembark from a TRANSPORT even after it has moved."
  },
  {
    "faction_id": "HAR",
    "faction_name": "Harlequins",
    "type": "Warlord Traits",
    "roll": "",
    "name": "The Final Joke",
    "legend": "Even in death, this Warlord reaches out to slay their hated foes.",
    "description": "If your Warlord is slain in the Fight phase, roll a D6\\. On a 2+, the unit that killed your Warlord suffers D3 mortal wounds after it has finished making all its attacks. On a 6, the enemy unit suffers D6 mortal wounds instead."
  },
  {
    "faction_id": "HAR",
    "faction_name": "Harlequins",
    "type": "Warlord Traits",
    "roll": "1",
    "name": "LUCK OF THE LAUGHING GOD",
    "legend": "To be possessed of supernatural fortune is a sure sign of Cegorach’s favour.",
    "description": "Re-roll hit rolls, wound rolls and damage rolls of 1 for your Warlord."
  },
  {
    "faction_id": "HAR",
    "faction_name": "Harlequins",
    "type": "Warlord Traits",
    "roll": "2",
    "name": "FRACTAL STORM",
    "legend": "In the cut and thrust of battle, this Warlord performs rapid movements that maximise the effect of their holo-suit to better evade their enemy’s blows.",
    "description": "Your Warlord has a 3+ invulnerable save against melee weapons."
  },
  {
    "faction_id": "HAR",
    "faction_name": "Harlequins",
    "type": "Warlord Traits",
    "roll": "3",
    "name": "A FOOT IN THE FUTURE",
    "legend": "The Warlord flows like starlight across the field of battle, time itself seeming to part before their otherworldly grace.",
    "description": "Add 2\" to your Warlord’s Move characteristic. In addition, add 1\" to the distance your Warlord can move each time it Advances, Falls Back, charges, performs a Heroic Intervention, piles in or consolidates."
  },
  {
    "faction_id": "HAR",
    "faction_name": "Harlequins",
    "type": "Warlord Traits",
    "roll": "4",
    "name": "PLAYER OF THE LIGHT",
    "legend": "Players of the Light hurl themselves into battle like the headstrong heroes of myth.",
    "description": "Re-roll failed charge rolls made for your Warlord and any friendly units whilst they are within 6\" of your Warlord."
  },
  {
    "faction_id": "HAR",
    "faction_name": "Harlequins",
    "type": "Warlord Traits",
    "roll": "5",
    "name": "PLAYER OF THE DARK",
    "legend": "Players of the Dark are sinister and vindictive, always seeking a flamboyant end for their foes.",
    "description": "Each wound roll of 6+ made for your Warlord’s attacks in the Fight phase inflict one mortal wound in addition to their normal damage."
  },
  {
    "faction_id": "HAR",
    "faction_name": "Harlequins",
    "type": "Warlord Traits",
    "roll": "6",
    "name": "PLAYER OF THE TWILIGHT",
    "legend": "Players of the Twilight see cycles of transition in everything, including the ebb and flow of battle. They often seem needlessly obsessive in their attention to nuance – until their genius is suddenly revealed.",
    "description": "Once per battle you can re-roll a hit roll, wound roll or save roll made for your Warlord. In addition, if your army is Battle-forged and your Warlord is on the battlefield, roll a D6 each time you or your opponent uses a Stratagem. If the result exactly matches the number of Command Points spent to use that Stratagem, then you gain that many Command Points. The limit of gaining or refunding 1 Command point per battle round does not apply to any Command points gained via this Warlord Trait, but once this Warlord Trait has been triggered, no more Command points can be gained via it until the start of the next battle round."
  },
  {
    "faction_id": "INQ",
    "faction_name": "Inquisition",
    "type": "Warlord Traits",
    "roll": "1",
    "name": "RADICAL",
    "legend": "They have no qualms about employing tools deemed heretical if it serves Humanity’s interests.",
    "description": "Once per battle round, you can re-roll one hit roll, wound roll, damage roll, saving throw, Psychic test or Deny the Witch test made for this WARLORD."
  },
  {
    "faction_id": "INQ",
    "faction_name": "Inquisition",
    "type": "Warlord Traits",
    "roll": "2",
    "name": "PURITAN",
    "legend": "Their sheer faith in their own righteousness armours them against the horrors of the galaxy.",
    "description": "Improve this WARLORD’s invulnerable save by 1 (to a maximum of 3+)."
  },
  {
    "faction_id": "INQ",
    "faction_name": "Inquisition",
    "type": "Warlord Traits",
    "roll": "3",
    "name": "FORMIDABLE RESOLVE",
    "legend": "The unshakeable will of this warlord is enough to steel the hearts of Humanity’s warriors.",
    "description": "* Add 1 to this WARLORD’s Leadership characteristic.\n* Increase the range of this WARLORD’s Unquestionable Wisdom ability by 6\"."
  },
  {
    "faction_id": "INQ",
    "faction_name": "Inquisition",
    "type": "Warlord Traits",
    "roll": "4",
    "name": "ORDO HERETICUS: NO ESCAPE",
    "legend": "None can slip their grasp.",
    "description": "* This WARLORD is eligible to perform a Heroic Intervention if it is within 6\" horizontally and 5\" vertically of any enemy unit, instead of 3\" horizontally and 5\" vertically. Each time this WARLORD makes a Heroic Intervention move, it can move up to 6”. All other rules for Heroic Interventions still apply.\n* When an enemy unit within Engagement Range of this WARLORD is chosen to Fall Back, you can roll one D6; unless any models in that unit have a minimum Move characteristic, on a 4+ that unit cannot Fall Back this turn."
  },
  {
    "faction_id": "INQ",
    "faction_name": "Inquisition",
    "type": "Warlord Traits",
    "roll": "5",
    "name": "ORDO XENOS: ESOTERIC LORE",
    "legend": "Their travels have prepared them for anything.",
    "description": "Whilst this WARLORD is on the battlefield, roll one D6 each time your opponent uses a Stratagem; on a 5+ you gain 1 Command Point."
  },
  {
    "faction_id": "INQ",
    "faction_name": "Inquisition",
    "type": "Warlord Traits",
    "roll": "6",
    "name": "ORDO MALLEUS: PSYCHIC MASTERY",
    "legend": "The warp bows to their will.",
    "description": "* This WARLORD knows one additional psychic power from the **Telethesia discipline**.\n* This WARLORD can attempt to manifest one additional psychic power in your Psychic phase and attempt to deny one additional psychic power in your opponent’s Psychic phase."
  },
  {
    "faction_id": "NEC",
    "faction_name": "Necrons",
    "type": "Warlord Traits",
    "roll": "",
    "name": "MEPHRIT: MERCILESS TYRANT",
    "legend": "Warlords of the Mephrit Dynasty will suffer no threats to their rule, annihilating any who dare to oppose them.",
    "description": "Add 1 to the Strength and Attacks characteristics of this WARLORD."
  },
  {
    "faction_id": "NEC",
    "faction_name": "Necrons",
    "type": "Warlord Traits",
    "roll": "",
    "name": "NEPHREKH: SKIN OF LIVING GOLD",
    "legend": "Those who gaze upon this Nephrekh warlord are blinded by his radiant glory.",
    "description": "Each time an attack is made against this WARLORD, subtract 1 from that attacks hit roll."
  },
  {
    "faction_id": "NEC",
    "faction_name": "Necrons",
    "type": "Warlord Traits",
    "roll": "",
    "name": "NIHILAKH: PRECOGNITIVE STRIKE",
    "legend": "This Nihilakh warlord has foreseen his moment of glorious victory - or rather, the Yyth Seer has done so.",
    "description": "At the start of the Fight phase, if this WARLORD is within Engagement Range of any enemy units, it can fight first that phase."
  },
  {
    "faction_id": "NEC",
    "faction_name": "Necrons",
    "type": "Warlord Traits",
    "roll": "",
    "name": "NOVOKH: BLOOD-FUELLED FURY",
    "legend": "Warlords of the Novokh Dynasty are awakened and empowered by the gushing blood of the foe.",
    "description": "Each time this WARLORD makes a melee attack, an unmodified wound roll of 6 inflicts 1 mortal wound on the target in addition to any normal damage."
  },
  {
    "faction_id": "NEC",
    "faction_name": "Necrons",
    "type": "Warlord Traits",
    "roll": "",
    "name": "SAUTEKH: HYPERLOGICAL STRATEGIST",
    "legend": "Sautekh warlords can apply a filter of infallible logic to develop unbeatable strategies.",
    "description": "While this WARLORD is on the battlefield, each time you spend a Command point to use a Stratagem you can roll one D6: on a 5+, that Command point is refunded."
  },
  {
    "faction_id": "NEC",
    "faction_name": "Necrons",
    "type": "Warlord Traits",
    "roll": "",
    "name": "SZAREKHAN: THE TRIARCH’S WILL",
    "legend": "Certain in the knowledge that they act as arbiters of the Final Triarch, this Szarekhan warlord exercises overwhelming strategic authority.",
    "description": "If your WARLORD has this Warlord Trait, then when assigning command protocols for the battle, you can select four command protocols instead of five, and then one of those command protocols can be assigned to two battle rounds instead of one."
  },
  {
    "faction_id": "NEC",
    "faction_name": "Necrons",
    "type": "Warlord Traits",
    "roll": "1",
    "name": "ENDURING WILL",
    "legend": "No mortal weaponry will break this warlords iron resolve.",
    "description": "Each time an attack is allocated to this WARLORD, subtract 1 from the Damage characteristic of that attack (to a minimum of 1)."
  },
  {
    "faction_id": "NEC",
    "faction_name": "Necrons",
    "type": "Warlord Traits",
    "roll": "2",
    "name": "ETERNAL MADNESS",
    "legend": "This warlords sanity suffered during the Great Sleep, and now he is driven by a wrathful zeal.",
    "description": "Each time this WARLORD makes a melee attack, you can re-roll the wound roll."
  },
  {
    "faction_id": "NEC",
    "faction_name": "Necrons",
    "type": "Warlord Traits",
    "roll": "3",
    "name": "IMMORTAL PRIDE",
    "legend": "This warlord refuses to allow his warriors a single step backwards even in the face of intense psychic onslaught.",
    "description": "* Each time this WARLORD would lose a wound as the result of a mortal wound, roll one D6: on a 5+, that wound is not lost.\n* This WARLORD has the following ability: ‘Immortal Pride (Aura): While a friendly DYNASTY> CORE unit is within 6\" of this model, each time a Combat Attrition test is taken for that unit, ignore any or all modifiers’."
  },
  {
    "faction_id": "NEC",
    "faction_name": "Necrons",
    "type": "Warlord Traits",
    "roll": "4",
    "name": "THRALL OF THE SILENT KING",
    "legend": "This warlord pursues the agenda of the Silent King, and so commands his legions with unparalleled authority.",
    "description": "Add 3\" to the range of this WARLORDs aura abilities (to a maximum of 9\"). In addition, when this WARLORD uses its My Will Be Done, The Lord's Will or Adaptive Strategy abilities, you can select one friendly DYNASTY> CORE unit within 12\" of this WARLORD, instead of 9\"."
  },
  {
    "faction_id": "NEC",
    "faction_name": "Necrons",
    "type": "Warlord Traits",
    "roll": "5",
    "name": "IMPLACABLE CONQUEROR (AURA)",
    "legend": "This warlord strides at the head of his legions.",
    "description": "While a friendly DYNASTY> CORE unit is within 6\" of this WARLORD, you can re-roll charge rolls made for that unit."
  },
  {
    "faction_id": "NEC",
    "faction_name": "Necrons",
    "type": "Warlord Traits",
    "roll": "6",
    "name": "HONOURABLE COMBATANT",
    "legend": "This warlord is a strict adherent to the ancient codes.",
    "description": "In the Fight phase, each time this WARLORD is selected to fight, it can engage in honourable combat. If it does, select one enemy CHARACTER unit; until the end of the phase, add 2 to the Attacks characteristic of this WARLORD, but it can only make attacks that target that enemy CHARACTER unit."
  },
  {
    "faction_id": "ORK",
    "faction_name": "Orks",
    "type": "Codex Supplement: Blood Axes",
    "roll": "1",
    "name": "EXTRA KUNNIN’",
    "legend": "Some Orks have more know-wotz than others.",
    "description": "Once per battle round, when you use a Strategic Ploy Stratagem if this WARLORD is on the battlefield, you can reduce the CP cost of that Stratagem by 1CP. Note that the CP cost is only reduced by 1CP for that use of the Stratagem, any future usages of it cost the normal amount of CPs."
  },
  {
    "faction_id": "ORK",
    "faction_name": "Orks",
    "type": "Codex Supplement: Blood Axes",
    "roll": "2",
    "name": "COUNTA-TAKTICS (AURA)",
    "legend": "This warlord bellows orders for his ladz to react to enemy movements.",
    "description": "While a friendly BLOOD AXES CORE unit is within 6\" of this WARLORD, that unit is eligible to perform Heroic Interventions as if it were a CHARACTER."
  },
  {
    "faction_id": "ORK",
    "faction_name": "Orks",
    "type": "Codex Supplement: Blood Axes",
    "roll": "3",
    "name": "DUK AN’ KUVVA",
    "legend": "This warlord is exceptionally skilled at camouflaging and taking cover and passes on his knowledge to nearby greenskins.",
    "description": "At the start of your opponents Shooting phase, if this WARLORD is wholly within an Area Terrain feature, select one friendly BLOOD AXES BOYZ or BLOOD AXES KOMMANDOS unit wholly within that terrain feature. Until the end of the phase, that unit cannot be selected as the target of ranged attacks made by enemy models that are not within 12\" of that terrain feature."
  },
  {
    "faction_id": "ORK",
    "faction_name": "Orks",
    "type": "Army of Renown: Speed Freeks Speed Mob",
    "roll": "",
    "name": "SPEED KING",
    "legend": "This warlord’s fanatical devotion to speedcraft is inspirational to all the ladz around him.",
    "description": "While a friendly SPEED FREEKS unit (excluding CHARACTER units) is within 6\" of this WARLORD, each time a model in that unit makes an attack, re-roll a wound roll of 1."
  },
  {
    "faction_id": "ORK",
    "faction_name": "Orks",
    "type": "Warlord Traits",
    "roll": "1",
    "name": "BIGKILLA BOSS",
    "legend": "This boss has spent his lifetime hunting the largest prey.",
    "description": "* Each time this WARLORD fights, if it is within Engagement Range of any enemy VEHICLE or MONSTER units, then until that fight is resolved, add 2 to this WARLORD’s Attacks characteristic.\n* Each time this WARLORD makes a melee attack against a VEHICLE or MONSTER unit, add 1 to that attack’s wound roll."
  },
  {
    "faction_id": "ORK",
    "faction_name": "Orks",
    "type": "Warlord Traits",
    "roll": "2",
    "name": "BEASTGOB (AURA)",
    "legend": "This boss’ mere presence riles up nearby squigs into a biting frenzy.",
    "description": "While a friendly CLAN> SQUIG unit is within 6\" of this WARLORD, each time a model in that unit makes a melee attack with squighog jaws, smasha squig jaws or a squigosaur’s jaws, add 1 to that attack’s Damage characteristic."
  },
  {
    "faction_id": "ORK",
    "faction_name": "Orks",
    "type": "Warlord Traits",
    "roll": "3",
    "name": "HALF-CHEWED",
    "legend": "This boss’ many bionic limbs attest to a lifetime of confronting the most dangerous beasts he can find, and coming out victorious.",
    "description": "While this WARLORD is within Engagement Range of an enemy CHARACTER or MONSTER unit, each time this model would lose a wound, roll one D6: on a 4+, that wound is not lost."
  },
  {
    "faction_id": "ORK",
    "faction_name": "Orks",
    "type": "Warlord Traits",
    "roll": "1",
    "name": "ROADKILLA",
    "legend": "This warlord loves to drive as fast as possible at the biggest group of enemies he can and crash straight through them.",
    "description": "After this WARLORD makes a charge move, you can select one enemy unit within 1\" of it and roll one D6: on a 2+, that unit suffers D3 mortal wounds."
  },
  {
    "faction_id": "ORK",
    "faction_name": "Orks",
    "type": "Warlord Traits",
    "roll": "2",
    "name": "GET UP IN THEIR FACES",
    "legend": "This boss weaves through the foes’ lines, guns blazing point-blank.",
    "description": "This WARLORD is eligible to shoot in a turn in which they Fell Back."
  },
  {
    "faction_id": "ORK",
    "faction_name": "Orks",
    "type": "Warlord Traits",
    "roll": "3",
    "name": "JUNKBOSS",
    "legend": "This warlord’s ride is covered in extra gubbinz, making it remarkably hard to land a meaningful blow.",
    "description": "This WARLORD has a 4+ invulnerable save."
  },
  {
    "faction_id": "ORK",
    "faction_name": "Orks",
    "type": "Warlord Traits",
    "roll": "1",
    "name": "FOLLOW ME LADZ (AURA)",
    "legend": "Always found at the forefront of an assault, this Ork likes to be the first into the fray.",
    "description": "If this WARLORD has made a charge move this turn, until the end of the turn, each time a friendly CLAN> ORKS unit declares a charge against an enemy unit that is within Engagement Range of this WARLORD, add 1 to the charge roll for that unit."
  },
  {
    "faction_id": "ORK",
    "faction_name": "Orks",
    "type": "Warlord Traits",
    "roll": "2",
    "name": "BIG GOB",
    "legend": "This warlord’s bellowing voice is so loud that it can be heard over the thickest of fighting.",
    "description": "Add 3\" to the range of this WARLORD’s aura abilities (to a maximum of 9\")."
  },
  {
    "faction_id": "ORK",
    "faction_name": "Orks",
    "type": "Warlord Traits",
    "roll": "3",
    "name": "’ARD AS NAILS",
    "legend": "This greenskin has a hide as thick as a Squiggoth’s. It takes a blow of truly phenomenal strength to even give him pause.",
    "description": "Each time an attack is made that targets this WARLORD, subtract 1 from that attack’s wound roll."
  },
  {
    "faction_id": "ORK",
    "faction_name": "Orks",
    "type": "Warlord Traits",
    "roll": "4",
    "name": "BRUTAL BUT KUNNIN’",
    "legend": "This Ork has a particular talent for close-quarters choppa work, even amongst his brutal kin.",
    "description": "Each time this WARLORD fights, if all of its attacks target one enemy unit, after resolving all of those attacks, it can make a number of additional attacks against that enemy unit equal to the number of attacks that did not reach the Inflict Damage step of the attack sequence during that fight."
  },
  {
    "faction_id": "ORK",
    "faction_name": "Orks",
    "type": "Warlord Traits",
    "roll": "5",
    "name": "KUNNIN’ BUT BRUTAL",
    "legend": "Feigning weakness, this warlord allows his foes to close in before delivering a brutal flurry of attacks.",
    "description": "At the start of the Fight phase, if this WARLORD is within Engagement Range of any enemy units, it can fight first that phase."
  },
  {
    "faction_id": "ORK",
    "faction_name": "Orks",
    "type": "Warlord Traits",
    "roll": "6",
    "name": "MIGHT IS RIGHT",
    "legend": "A solid slab of muscle and aggression, this Ork’s strength is unsurpassed.",
    "description": "Add 1 to this WARLORD’s Strength and Attacks characteristics."
  },
  {
    "faction_id": "QI",
    "faction_name": "Imperial Knights",
    "type": "Warlord Traits",
    "roll": "",
    "name": "CHAMPION OF THE HOUSEHOLD",
    "legend": "Terryn’s rulers can always be found at the forefront of their house’s armies.",
    "description": "You can re-roll Advance and charge rolls made for this WARLORD."
  },
  {
    "faction_id": "QI",
    "faction_name": "Imperial Knights",
    "type": "Warlord Traits",
    "roll": "",
    "name": "MASTER OF THE JOUST",
    "legend": "The lords of Griffith are experts at striking pinpoint blows while at full stride.",
    "description": "This WARLORD is eligible to declare a charge in a turn in which it Advanced."
  },
  {
    "faction_id": "QI",
    "faction_name": "Imperial Knights",
    "type": "Warlord Traits",
    "roll": "",
    "name": "VETERAN OF GRYPHONNE IV",
    "legend": "Those Knights of Cadmus who survived the destruction of Gryphonne IV by Hive Fleet Leviathan proved their endurance time and again.",
    "description": "Each time a melee attack is allocated to this WARLORD, subtract 1 from the Damage characteristic of that attack (to a minimum of 1). This is not cumulative with any other rules that reduce the Damage characteristic of an attack."
  },
  {
    "faction_id": "QI",
    "faction_name": "Imperial Knights",
    "type": "Warlord Traits",
    "roll": "",
    "name": "DUTY OF THE FORSWORN",
    "legend": "The champions of Hawkshroud often take to the field having sworn a binding oath to slay a particular foe.",
    "description": "At the start of your first Command phase, select one unit in your opponent’s army. Each time this WARLORD makes an attack against that unit, add 1 to that attack’s hit roll."
  },
  {
    "faction_id": "QI",
    "faction_name": "Imperial Knights",
    "type": "Warlord Traits",
    "roll": "",
    "name": "LEGACY OF THE BLACK PALL",
    "legend": "The gloom of their home world of Kimdaria seems to cling to the Knights of House Mortan.",
    "description": "Each time a ranged attack is made against this WARLORD, if the attacker is more than 18\" away, subtract 1 from that attack’s hit roll."
  },
  {
    "faction_id": "QI",
    "faction_name": "Imperial Knights",
    "type": "Warlord Traits",
    "roll": "",
    "name": "MASTER OF THE TRIAL",
    "legend": "Those elite Nobles who emerge triumphant from House Ravens Trial of the Companions are forever hardened by the experience.",
    "description": "Each time an attack is allocated to this WARLORD, if that Attack has an Armour Penetration characteristic of -1 or -2, the Armour Penetration characteristic of that attack is reduced by 1."
  },
  {
    "faction_id": "QI",
    "faction_name": "Imperial Knights",
    "type": "Warlord Traits",
    "roll": "",
    "name": "KNIGHT OF MARS",
    "legend": "The data-manifolds of House Taranis’ lords are thrice-blessed by the priests of the Red Planet.",
    "description": "* Once per battle, after rolling a D6 or a D3 when making an Advance roll, hit roll, wound roll, damage roll, charge roll or saving throw for this WARLORD, after any re-rolls (if any) have been made, you can change the result of one of those dice to be a 6 (or, in the case of a D3, a 3).  \n_**Example:** After rolling 2D6 to see what the charge distance is when making a charge roll, you can turn one of the dice into a 6\\. If you rolled a 4 and a 1, you could change the 1 into a 6 to change its charge distance into 10\"._\n* While your army is Virtuous, this WARLORD can use the above rule once per turn, instead of once per battle."
  },
  {
    "faction_id": "QI",
    "faction_name": "Imperial Knights",
    "type": "Warlord Traits",
    "roll": "",
    "name": "FIRST KNIGHT",
    "legend": "As exemplars of the first rediscovered Noble house, the leaders of Krast constantly strive to uphold a long and glorious history.",
    "description": "* Improve this WARLORD’s Weapon Skill characteristic by 1 (to a maximum of 2+).\n* At the end of each of your Command phases, if your army is Honoured, you can select one Virtuous Chivalric ability from one of your selected Oaths. Until the end of your next Command phase, that Virtuous ability is active for this WARLORD. This may mean that different Chivalric abilities are active for this WARLORD than are active for other IMPERIAL KNIGHTS models in your army."
  },
  {
    "faction_id": "QI",
    "faction_name": "Imperial Knights",
    "type": "Warlord Traits",
    "roll": "",
    "name": "ADAMANTINE KNIGHT",
    "legend": "The most accomplished of House Vulker s Knights are fitted with a sub-layer of adamantine weave.",
    "description": "Each time an attack is made against this WARLORD, an unmodified wound roll of 1-3 for that attack fails, irrespective of any abilities that the weapon or the model making the attack may have."
  },
  {
    "faction_id": "QI",
    "faction_name": "Imperial Knights",
    "type": "Warlord Traits",
    "roll": "",
    "name": "ECHOES FROM THE PAST",
    "legend": "Though this Noble is in exile, they still cling to the vestiges of honour from their former household.",
    "description": "This WARLORD gains and the Glorified History Martial Tradition (if it has the QUESTOR IMPERIALIS keyword) or the Fealty to the Cog Martial Tradition (if it has the QUESTOR MECHANICUS keyword) even though they are a FREEBLADE. This WARLORD will only gain the Martial Tradition of the selected house, however - it will not gain access to the selected Noble Household Relic, Noble Household Warlord Trait or Noble Household Stratagem. Write down your selected tradition on your army roster or Crusade card when this Warlord Trait is selected."
  },
  {
    "faction_id": "QI",
    "faction_name": "Imperial Knights",
    "type": "Codex Supplement: House Raven",
    "roll": "1",
    "name": "LORD OF THE TRIALS",
    "legend": "This Warlord did not only survive the Trial of the Companions, they emerged through them with such honour as has not been witnessed in several generations.",
    "description": "Each time an attack is made by this WARLORD, an unmodified hit roll of 6 automatically wounds the target."
  },
  {
    "faction_id": "QI",
    "faction_name": "Imperial Knights",
    "type": "Codex Supplement: House Raven",
    "roll": "2",
    "name": "INVIOLATE",
    "legend": "This Warlord stands firm no matter what warp craft or esoteric weaponry the enemy brings to bear against them, standing as unyielding as the Keep Inviolate itself.",
    "description": "Each time this WARLORD would lose a wound as the result of a mortal wound, roll one D6: on a 4+, that wound is not lost."
  },
  {
    "faction_id": "QI",
    "faction_name": "Imperial Knights",
    "type": "Codex Supplement: House Raven",
    "roll": "3",
    "name": "BLESSED BY METALICA",
    "legend": "This Warlord has fought alongside their allied forge world for countless campaigns, and enjoys the highest blessings and ministrations that Metalica can provide.",
    "description": "* Add 2 to this WARLORD’S Wounds characteristic.\n* This WARLORD can be repaired by METALICA TECH-PRIEST units as if it were a METALICA VEHICLE model."
  },
  {
    "faction_id": "QI",
    "faction_name": "Imperial Knights",
    "type": "Warlord Traits",
    "roll": "1",
    "name": "CUNNING COMMANDER",
    "legend": "A master tactician, this warlord instinctively knows how best to use the battlefield.",
    "description": "At the start of your Command phase, if this WARLORD is on the battlefield, roll one D6: on a 5+, you gain 1 Command point."
  },
  {
    "faction_id": "QI",
    "faction_name": "Imperial Knights",
    "type": "Warlord Traits",
    "roll": "2",
    "name": "BLESSED BY THE SACRISTANS",
    "legend": "This warlord bears a token of favour from Sacristans in the form of an artificer weapon of unrivalled quality.",
    "description": "Each time this WARLORD makes a ranged attack, on an unmodified wound roll of 6 that attack inflicts 1 mortal wound on the target in addition to the normal damage (to a maximum of 6 mortal wounds per unit per phase)."
  },
  {
    "faction_id": "QI",
    "faction_name": "Imperial Knights",
    "type": "Warlord Traits",
    "roll": "3",
    "name": "ION BULWARK",
    "legend": "A survivor of countless battles, this warlord has learnt to angle their Knight suits ion shield with exceptional deftness.",
    "description": "This WARLORD has a 4+ invulnerable save against ranged attacks."
  },
  {
    "faction_id": "QI",
    "faction_name": "Imperial Knights",
    "type": "Warlord Traits",
    "roll": "4",
    "name": "KNIGHT SENESCHAL",
    "legend": "Veteran warriors who have proved themselves worthy time and again are awarded the rank of Knight Seneschal. To be named so is an honour.",
    "description": "* Add 1 to this WARLORD’s Attacks characteristic.\n* Even if your army is Dishonoured, the Honoured Chivalric ability from your selected Oaths are still active for this WARLORD. This may mean that different Chivalric abilities are active for this WARLORD than are active for other IMPERIAL KNIGHTS models from your army."
  },
  {
    "faction_id": "QI",
    "faction_name": "Imperial Knights",
    "type": "Warlord Traits",
    "roll": "5",
    "name": "LANDSTRIDER",
    "legend": "This warlord has fought across hundreds of battlefields, and is an expert at reading strat-map inloads and coordinating their forces’ advance.",
    "description": "* Add 2\" to this WARLORD’s Move characteristic.\n* Each time an Advance roll is made for this WARLORD, treat a dice roll of 1-2 as 3 instead.\n* Each time a charge roll is made for this WARLORD, treat each dice roll of 1-2 as 3 instead."
  },
  {
    "faction_id": "QI",
    "faction_name": "Imperial Knights",
    "type": "Warlord Traits",
    "roll": "6",
    "name": "REVERED KNIGHT",
    "legend": "Never hesitating before tyrannical invaders, the warlord is beheld as the very epitome of honour - a towering and monolithic incarnation of the Imperium made manifest.",
    "description": "* At the start of the Fight phase, if this WARLORD is within Engagement Range of any enemy units, it can fight first that phase.\n* If every unit from your army has the IMPERIAL KNIGHTS keyword (excluding units with the AGENT OF THE IMPERIUM or UNALIGNED keywords), and this WARLORD is part of your army, then you start the battle with 1 additional Honour point but, if this WARLORD is destroyed, you lose 1 Honour point."
  },
  {
    "faction_id": "QT",
    "faction_name": "Chaos Knights",
    "type": "Warlord Traits",
    "roll": "",
    "name": "BOW TO NONE",
    "legend": "This warlord has stared down even the most terrifying daemons of the warp. They are as unwilling to yield or bend the knee before the ineffable as before any other mortal.",
    "description": "* This WARLORD can ignore any or all modifiers to their characteristics profile (the only exceptions are characteristics changes incurred as a result of Damage suffered, as shown on this WARLORD’s datasheet).\n* Each time this WARLORD makes an attack, you can ignore any or all modifiers to its hit rolls, wound rolls or damage rolls.\n* Each time this WARLORD Advances or declares a charge, you can ignore any or all modifiers to its Advance rolls or charge rolls."
  },
  {
    "faction_id": "QT",
    "faction_name": "Chaos Knights",
    "type": "Warlord Traits",
    "roll": "",
    "name": "STRIKE FIRST, STRIKE OFTEN",
    "legend": "The knightly lords of House Lucaris vie with each other for the honour of being the first to spill the blood of the enemy. In battle, they strike with a lightning speed unexpected of such large war machines.",
    "description": "At the start of the Fight phase, if this WARLORD is within Engagement Range of any enemy units, it can fight first that phase."
  },
  {
    "faction_id": "QT",
    "faction_name": "Chaos Knights",
    "type": "Warlord Traits",
    "roll": "",
    "name": "MADDENED CRIES (AURA)",
    "legend": "The warlords hideously twisted Knight suit broadcasts their deranged rantings as they crash into the enemy line, sending their foes fleeing in terror.",
    "description": "While an enemy unit is within 9\" of this WARLORD, at the start of each Morale phase, it must take a Dread test. If that test is failed, that unit suffers 1 mortal wound."
  },
  {
    "faction_id": "QT",
    "faction_name": "Chaos Knights",
    "type": "Warlord Traits",
    "roll": "",
    "name": "FAVOUR OF THE DARK MECHANICUM",
    "legend": "This warlord has been bionically augmented with a series of mechatendrils that permeate the mechanisms of their Knight suit. If damaged, they can effect simple repairs without breaking their focus.",
    "description": "* If this WARLORD is a WAR DOG-CLASS model, add 1 to its Wounds characteristic.\n* If this WARLORD is a TITANIC model, add 2 to its Wounds characteristic.\n* At the start of each of your Command phases, this WARLORD regains D3 lost wounds."
  },
  {
    "faction_id": "QT",
    "faction_name": "Chaos Knights",
    "type": "Warlord Traits",
    "roll": "",
    "name": "DREAD HUNTER",
    "legend": "This warlord has hunted the most abhorrent daemonic prey, lining up the perfect aim before unleashing the killing shot.",
    "description": "Once per battle, at the start of your Shooting phase, this WARLORD can make a killing strike. If it does so, select one ranged weapon this WARLORD is equipped with. Until the end of the phase, each time an attack is made with that weapon, you can re-roll the hit roll, you can re-roll the wound roll and you add 1 to the Damage characteristic of that attack."
  },
  {
    "faction_id": "QT",
    "faction_name": "Chaos Knights",
    "type": "Warlord Traits",
    "roll": "",
    "name": "LORD OF DREAD",
    "legend": "This tyrannical Knight is the epitome of dread power, instilling as much fear in their minions as they do over the enemy, ensuring unwavering obedience.",
    "description": "* Add 3\" to the range of this WARLORD’s Aura abilities (to a maximum of 12\").\n* Add 3\" to the range of this WARLORD’s Dreaded abilities."
  },
  {
    "faction_id": "QT",
    "faction_name": "Chaos Knights",
    "type": "Warlord Traits",
    "roll": "1",
    "name": "EAGER FOR THE KILL",
    "legend": "It is said this Knight has led the charge across a thousand battlefields on a hundred worlds, and each time laid waste to all in their path.",
    "description": "* Add 1 to Advance and charge rolls made for this WARLORD.\n* While this WARLORD is within your opponent’s deployment zone, add 1 to its Attacks characteristic."
  },
  {
    "faction_id": "QT",
    "faction_name": "Chaos Knights",
    "type": "Warlord Traits",
    "roll": "2",
    "name": "HARBINGER OF SCRAPCODE",
    "legend": "This Fallen Noble has given their Knights hull over to the heretical powers of the Dark Mechanicum, becoming a carrier for deadly scrapcode.",
    "description": "In the Morale phase, select one enemy VEHICLE unit within 18\" of this WARLORD. That unit must take a Dread test. If the test is failed:  \n* That unit suffers 3 mortal wounds.\n* Until the start of the next Morale phase, models in that unit whose characteristics can change as they suffer damage are considered to have half the number of wounds remaining for the purposes of determining what those characteristics are (models in that unit whose characteristics do not change as they suffer damage instead reduce their Ballistic Skill and Weapon Skill characteristics by 1)."
  },
  {
    "faction_id": "QT",
    "faction_name": "Chaos Knights",
    "type": "Warlord Traits",
    "roll": "3",
    "name": "WARP-HAUNTED HULL",
    "legend": "The nightmarish visages of warp-gheists are emblazoned upon the armour panels of this warlord’s Knight, imbuing it with empyric power.",
    "description": "* Once per turn, this WARLORD can attempt to Deny the Witch as if it were a PSYKER. If this unit is a PSYKER, then in each enemy Psychic phase, it can instead attempt to Deny the Witch one additional time.\n* Each time this WARLORD loses a wound in the Psychic phase, roll one D6: on a 5+, that wound is not lost."
  },
  {
    "faction_id": "QT",
    "faction_name": "Chaos Knights",
    "type": "Warlord Traits",
    "roll": "4",
    "name": "KNIGHT DIABOLUS",
    "legend": "This warlord has perfected their martial skill in apocalyptic duels with Greater Daemons.",
    "description": "* Add 1 to this WARLORD’s Attacks characteristic.\n* Each time this WARLORD makes a melee attack, re-roll a hit roll of 1."
  },
  {
    "faction_id": "QT",
    "faction_name": "Chaos Knights",
    "type": "Warlord Traits",
    "roll": "5",
    "name": "INFERNAL QUEST",
    "legend": "Having sworn an oath to the Dark Gods, this Knight will not stop spreading carnage across the galaxy until either they have honoured it, or they are slain.",
    "description": "This WARLORD has the Objective Secured ability."
  },
  {
    "faction_id": "QT",
    "faction_name": "Chaos Knights",
    "type": "Warlord Traits",
    "roll": "6",
    "name": "AURA OF TERROR (DREADED)",
    "legend": "This towering Knight is wreathed in tendrils of warp energy that caress the minds of any enemy who draws near, driving those touched into a state of abject fear.",
    "description": "While an enemy unit is within Dread range of this WARLORD, each time a Morale test or Dread test is taken for that unit, your opponent must roll one additional D6 and discard the lowest result."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Raven Guard Warlord Traits",
    "roll": "1",
    "name": "SHADOWMASTER",
    "legend": "As a follower of the Path of Shadow, this warlord strikes from the darkness without warning, granting his foes no chance to react.",
    "description": "Enemy units cannot fire Overwatch at this WARLORD."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Raven Guard Warlord Traits",
    "roll": "2",
    "name": "MASTER OF AMBUSH",
    "legend": "Those who walk the Path of Ambush guide their forces into the perfect positions from which to launch surprise assaults on the enemy.",
    "description": "At the start of the first battle round, before the first turn begins, if this WARLORD is on the battlefield you can select one other friendly RAVEN GUARD INFANTRY unit (excluding a CENTURION unit) on the battlefield. Remove that unit and this WARLORD (if it is also INFANTRY) from the battlefield, and set them up anywhere on the battlefield that is more than 9\" from the enemy deployment zone and more than 9\" from any enemy models (if both players have abilities that redeploy units before the first turn begins, roll off; the winner chooses who redeploys their units first)."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Raven Guard Warlord Traits",
    "roll": "3",
    "name": "SWIFT AND DEADLY (AURA)",
    "legend": "The Astartes under this warlord’s command seize every opportunity to strike while the initiative is theirs.",
    "description": "While a friendly RAVEN GUARD CORE or RAVEN GUARD CHARACTER unit is within 6\" of this WARLORD, that unit is eligible to declare a charge within a turn in which it Advanced."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Raven Guard Warlord Traits",
    "roll": "4",
    "name": "MASTER OF VIGILANCE",
    "legend": "Guided by the Path of Vigilance, each of this commander’s strikes seeks out the enemy’s weakest points.",
    "description": "When resolving an attack made with a melee weapon by this Warlord, an unmodified hit roll of 6 inflicts 1 mortal wound on the target in addition to any other damage."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Raven Guard Warlord Traits",
    "roll": "5",
    "name": "FEIGNED FLIGHT",
    "legend": "This warrior uses misdirection as a weapon, turning even retreat into an opportunity for renewed attack.",
    "description": "When this WARLORD Falls Back, they can move across models and terrain as if the models and terrain were not there. In addition, this WARLORD can shoot and charge in a turn in which they Fell Back."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Raven Guard Warlord Traits",
    "roll": "6",
    "name": "ECHO OF THE RAVENSPIRE",
    "legend": "This warlord can vanish from sight with seemingly supernatural skill and suddenness.",
    "description": "Once per battle, at the end of your Movement phase, this WARLORD can vanish into the gloom if they are more than 6\" from any enemy models. When it does, remove it from the battlefield; you then set this WARLORD up again at the end of your next Movement phase anywhere that is more than 9\" from any enemy models. If the battle ends and this WARLORD is not on the battlefield, it is destroyed."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Iron Hands Warlord Traits",
    "roll": "1",
    "name": "ADEPT OF THE OMNISSIAH",
    "legend": "This warlord is a master of both the art of war and the rites of the machine.",
    "description": "* At the end of your Movement phase, unless this WARLORD is a TECHMARINE, it can repair one friendly IRON HANDS VEHICLE model within 1\" of it. That VEHICLE model regains 1 lost wound. Each model can only be repaired once per turn.\n* If this WARLORD is a TECHMARINE, then each time it uses its Blessing of the Omnissiah ability, the model it is repairing regains up to D3+1 lost wounds instead of D3."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Iron Hands Warlord Traits",
    "roll": "2",
    "name": "WILL OF IRON",
    "legend": "Even under the most desperate circumstances, this warlord’s will remains as unyielding as adamantium.",
    "description": "This Warlord can attempt to resist one psychic power in your opponent’s Psychic phase in the same manner as a PSYKER by taking a Deny the Witch test, if this WARLORD is within 24\" of the enemy model manifesting that psychic power. If this WARLORD is a LIBRARIAN, they instead can attempt to deny one additional psychic power in your opponent’s Psychic phase."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Iron Hands Warlord Traits",
    "roll": "3",
    "name": "ALL FLESH IS WEAKNESS",
    "legend": "This warlord bears so extraordinary a number of cybernetic enhancements that there is little true flesh left.",
    "description": "When this WARLORD would lose a wound, roll one D6; on a 5+ that wound is not lost."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Iron Hands Warlord Traits",
    "roll": "4",
    "name": "STUDENT OF HISTORY",
    "legend": "This warlord’s knowledge of historic victories and defeats allows him to perceive unerringly when to fight on and when to withdraw.",
    "description": "When this WARLORD consolidates, they can move up to 6\" instead of 3\", and do not have to end this move closer to the nearest enemy model."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Iron Hands Warlord Traits",
    "roll": "5",
    "name": "MERCILESS LOGIC",
    "legend": "To the Iron Hands, and this warlord in particular, mercy is for the weak.",
    "description": "When resolving an attack made by this WARLORD, on an unmodified hit roll of 6 you can make one additional attack against the same unit using the same weapon. This additional attack cannot generate another attack."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Iron Hands Warlord Traits",
    "roll": "6",
    "name": "TARGET PROTOCOLS",
    "legend": "This warlord uses his advanced augmetics to distribute targeting data and direct the fire of his battle-brothers.",
    "description": "At the start of your Shooting phase, select one friendly IRON HANDS unit within 6\" of this WARLORD. Once that phase, when resolving an attack made with a ranged weapon by a model from that unit, you can re-roll the hit roll. Once that phase, when resolving an attack made with a ranged weapon by a model from that unit, you can re-roll the wound roll. Once that phase, when resolving an attack made with a ranged weapon by a model from that unit, you can re-roll the damage roll."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Salamanders Warlord Traits",
    "roll": "1",
    "name": "ANVIL OF STRENGTH",
    "legend": "Vulkan was renowned as the strongest of the Primarchs, and his genetic heritage lends this son of Nocturne great physical might.",
    "description": "Add 2 to the Strength characteristic of this WARLORD."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Salamanders Warlord Traits",
    "roll": "2",
    "name": "MIRACULOUS CONSTITUTION",
    "legend": "This Salamander’s body seems able to recover from injuries that should prove fatal to even a Space Marine.",
    "description": "When this WARLORD would lose a wound, roll one D6; on a 6, that wound is not lost. In addition, at the start of your Movement phase, this WARLORD regains 1 lost wound."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Salamanders Warlord Traits",
    "roll": "3",
    "name": "NEVER GIVE UP",
    "legend": "This warrior is dogged in the extreme, refusing to yield even in hopeless situations. Such stoicism in the face of adversity inspires fellow Salamanders to do their duty.",
    "description": "At the end of your Command phase, you can select one friendly SALAMANDERS CORE or SALAMANDERS CHARACTER unit within 6\" of this WARLORD. Until the end of your next Command phase, that unit has the Objective Secured ability."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Salamanders Warlord Traits",
    "roll": "4",
    "name": "FORGE MASTER",
    "legend": "Like many Salamanders, this champion has personally crafted his own armour, and it provides far greater protection than normal battle-plate.",
    "description": "Add 2 to the Toughness characteristic of this WARLORD."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Salamanders Warlord Traits",
    "roll": "5",
    "name": "LORD OF FIRE (AURA)",
    "legend": "There are no secrets of flame and fire unknown to this Salamander, and he uses them in battle like no other.",
    "description": "You can re-roll the dice to determine the number of attacks made with flame weapons by friendly SALAMANDERS models whilst their unit is within 6\" of this WARLORD."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Salamanders Warlord Traits",
    "roll": "6",
    "name": "PATIENT AND DETERMINED",
    "legend": "This commander places great value on patience, and his every action is measured and determined, his every blow placed with perfect precision.",
    "description": "Once per Shooting phase and/or once per Fight phase, when resolving an attack made by this WARLORD, do not make a hit roll: it automatically scores a hit."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Imperial Fists Warlord Traits",
    "roll": "1",
    "name": "SIEGE MASTER",
    "legend": "There are few who have a deeper understanding of the tenets of siege warfare than this son of Dorn.",
    "description": "When resolving an attack made by this WARLORD against a BUILDING or VEHICLE unit, add 1 to the wound roll."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Imperial Fists Warlord Traits",
    "roll": "2",
    "name": "INDOMITABLE",
    "legend": "This Imperial Fist refuses to yield whilst foes remain before him.",
    "description": "When resolving an attack made against this WARLORD, an unmodified wound roll of 1-3 always fail, irrespective of any abilities that the weapon or the model making that attack may have."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Imperial Fists Warlord Traits",
    "roll": "3",
    "name": "FLEETMASTER",
    "legend": "Orbital firepower is often called upon by this leader.",
    "description": "Once per battle, at the end of your Fight phase, if this WARLORD remained stationary and did not make any attacks this turn it can call down an orbital strike. If it does, select one point on the battlefield and roll one D6 for each unit within D6\" of that point, subtracting 1 from the result if the unit being rolled for is a CHARACTER. On a 4+ the unit being rolled for suffers D3 mortal wounds."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Imperial Fists Warlord Traits",
    "roll": "4",
    "name": "STUBBORN HEROISM",
    "legend": "Unyielding are the Imperial Fists, refusing to relent and exacting the bloody price of victory from their foes even when retreat might prove more prudent.",
    "description": "This WARLORD cannot Fall Back. When resolving an attack against this WARLORD, halve any damage inflicted (rounding up)."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Imperial Fists Warlord Traits",
    "roll": "5",
    "name": "ARCHITECT OF WAR (AURA)",
    "legend": "Imperial Fist leaders have a gift for bolstering defensive positions.",
    "description": "While a friendly IMPERIAL FISTS CORE unit that is receiving the benefits of cover is within 6\" of this WARLORD, each time an attack with an Armour Penetration characteristic of -1 is allocated to a model in that unit, that attack has an Armour Penetration characteristic of 0 instead."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Imperial Fists Warlord Traits",
    "roll": "6",
    "name": "HAND OF DORN",
    "legend": "This champion of the Chapter is a true inheritor of the tactical acumen of his Primarch.",
    "description": "Before the battle, if your army is Battle-forged, roll one D3; you gain a number of Command Points equal to the result."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Imperial Fists Warlord Traits",
    "roll": "1-2",
    "name": "REFUSE TO DIE",
    "legend": "Like the Chapter itself, this Crimson Fists champion defies death against all odds.",
    "description": "The first time this WARLORD it destroyed, you can choose to roll one D6 at the end of the phase instead of using any rules that are triggered when a model is destroyed (e.g. the Only in Death Does Duty End Stratagem) If you do, then on a 4+, set this WARLORD back up on the battlefield as close as possible to where they were destroyed and more than 1\" away from any enemy models, with D3 wounds remaining."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Imperial Fists Warlord Traits",
    "roll": "3-4",
    "name": "TENACIOUS OPPONENT",
    "legend": "This champion fights all the harder when he is outnumbered by his foes.",
    "description": "When you choose this WARLORD to fight with, if there are at least five enemy models within 6\" of them, add D3 to this WARLORD’s Attacks characteristic until the end of the phase."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Imperial Fists Warlord Traits",
    "roll": "5-6",
    "name": "STOIC DEFENDER (AURA)",
    "legend": "This leader and his warriors hold their ground no matter the odds.",
    "description": "While a friendly CRIMSON FISTS CORE or CRIMSON FISTS CHARACTER unit is within 6\" of this WARLORD, that unit has the Objective Secured ability. If a unit already has this ability, each model in that unit counts as one additional model for the purposes of determining control of objective markers."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Black Templars Warlord Traits",
    "roll": "1",
    "name": "EPITOME OF PIETY",
    "legend": "So intense is the warlords devotion to the God-Emperor that they are able to throw off the malign influence of the warp.",
    "description": "* In your opponent s Psychic phase, this WARLORD can attempt to deny one psychic power as if it were a PSYKER.\n* Add 1 to Deny the Witch tests taken for this WARLORD."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Black Templars Warlord Traits",
    "roll": "2",
    "name": "PARAGON OF FURY",
    "legend": "This warlord’s hatred for the heretic and the unbeliever burns with the fury of a newborn star.",
    "description": "After this WARLORD finishes a charge move:  \n* Until the end of the turn, add 1 to this WARLORD’s Strength characteristic.\n* Roll one D6 for each enemy model that is within Engagement Range of it: on a 5+, that model’s unit suffers 1 mortal wound."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Black Templars Warlord Traits",
    "roll": "3",
    "name": "MASTER OF ARMS",
    "legend": "The warlord has devoted their existence to the rigorous perfection of the blade, becoming a force of righteous destruction upon the battlefield.",
    "description": "* At the start of the Fight phase, if this WARLORD is within Engagement Range of any enemy units, it can fight first that phase.\n* Add 1 to this WARLORD’s Attacks characteristic."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Black Templars Warlord Traits",
    "roll": "4",
    "name": "INSPIRATIONAL FIGHTER (AURA)",
    "legend": "The warlords exemplary martial prowess galvanises the battle-brothers around them to reach new heights of righteous ferocity.",
    "description": "While a friendly BLACK TEMPLARS CORE unit is within 6\" of this WARLORD, each time a model in that unit makes a melee attack, on an unmodified wound roll of 6, improve the Armour Penetration characteristic of that attack by 1\\. This is cumulative with the bonus gained from the Assault Doctrine if it is active for your army."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Black Templars Warlord Traits",
    "roll": "5",
    "name": "FRONT-LINE COMMANDER",
    "legend": "Leading from the heart of the battle, the warlord pushes their brethren to ever more fervent acts of courage in the face of the enemy’s guns.",
    "description": "* Add 1 to Advance and charge rolls made for this WARLORD.\n* Each time a friendly BLACK TEMPLARS CORE unit declares a charge against an enemy unit that is within Engagement Range of this WARLORD, add 1 to the charge roll made for that unit."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Black Templars Warlord Traits",
    "roll": "6",
    "name": "OATHKEEPER",
    "legend": "The fury of a Black Templars warlord cannot be stayed until the foe lies ruined at his feet.",
    "description": "* This WARLORD is eligible to perform a Heroic Intervention if it is within 6\" horizontally and 5\" vertically of any enemy unit.\n* Each time this WARLORD makes a Heroic Intervention move, it can move up to 6\" instead of 3\". All other rules for Heroic Interventions still apply."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Warlord Traits",
    "roll": "1",
    "name": "SHOOT AND FADE",
    "legend": "This warrior harries the foe before returning to the shadows.",
    "description": "Once per turn, in your Shooting phase, after shooting with a friendly CHAPTER> PHOBOS unit within 6\" of this WARLORD, that unit can make a Normal Move or it can Advance; in either case, if it does, that unit is not eligible to declare a charge with this turn."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Warlord Traits",
    "roll": "2",
    "name": "LORD OF DECEIT",
    "legend": "This leader is adept at subterfuge and spreading misinformation.",
    "description": "After both players have deployed their armies, select up to three CHAPTER> PHOBOS units from your army and redeploy them. If the mission uses the Strategic Reserves rules, any of those units can be placed into Strategic Reserves without having to spend any additional CPs, regardless of how many units are already in Strategic Reserves. If both players have abilities that redeploy units, roll off; the winner chooses who redeploys their units first."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Warlord Traits",
    "roll": "3",
    "name": "MASTER OF THE VANGUARD (AURA)",
    "legend": "This living legend of the Vanguard is an inspiration to his brothers.",
    "description": "While a friendly CHAPTER> PHOBOS unit is within 6\" of this WARLORD:  \n* Add 1 to charge rolls made for that unit.\n* Each time that unit is selected to make a Normal Move, Advance or Fall Back, add 1\" to that unit’s Move characteristic until the end of the phase."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Warlord Traits",
    "roll": "4",
    "name": "STEALTH ADEPT",
    "legend": "This warlord slips through enemy territory like a spectre.",
    "description": "Unless this WARLORD is the closest eligible target, enemy models cannot target it with ranged attacks."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Warlord Traits",
    "roll": "5",
    "name": "TARGET PRIORITY",
    "legend": "This tactician is constantly seeking prime targets.",
    "description": "In your Command phase, you can select one friendly CHAPTER> PHOBOS unit within 6\" of this WARLORD. Until the start of your next Command phase, each time a model in that unit makes a ranged attack, add 1 to that attack’s hit roll."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Warlord Traits",
    "roll": "6",
    "name": "MASTER MARKSMAN",
    "legend": "This warlord is one of the finest sharpshooters in the galaxy.",
    "description": "Add 1 to the Damage characteristic of ranged weapons this WARLORD is equipped with (excluding Grenades and Relics)."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Codex Supplement: Castellans of the Rift",
    "roll": "1",
    "name": "Hit-and-Run Master",
    "legend": "Even when pulling back, this warlord ensures that the enemy pay in blood for every inch of ground they take.",
    "description": "In your Command phase, select one friendly CASTELLANS OF THE RIFT unit within 9\" of this WARLORD. Until the end of the turn, that unit is eligible to shoot in a turn in which it Fell Back."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Codex Supplement: Castellans of the Rift",
    "roll": "2",
    "name": "Exemplar of the Chapter",
    "legend": "This warlord embodies each of the Chapters ideals; they are a furious fighter in the attack, and nigh impossible to bring down when defending.",
    "description": "* Add 1 to the Attacks characteristic of this WARLORD.\n* Each time an attack is made against this WARLORD, an unmodified wound roll of 1-3 always fails, irrespective of any abilities that the weapon or the attacker may have."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Codex Supplement: Castellans of the Rift",
    "roll": "3",
    "name": "Tip of the Sword",
    "legend": "This warlord never hesitates in taking the fight directly to the enemy, inspiring warriors around them to do the same.",
    "description": "At the end of your Movement phase, select one enemy unit within 12\" of and visible to this WARLORD. Until the end of the turn:  \n* Each time a friendly CASTELLANS OF THE RIFT CORE unit declares a charge, if that enemy unit is one of the targets of that charge, you can re-roll the charge roll.\n* Each time a friendly CASTELLANS OF THE RIFT CORE model makes a melee attack against that enemy unit, add 1 to the Strength characteristic of that attack."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Codex Supplement: Wolfspear",
    "roll": "1",
    "name": "STRIKE FOR THE THROAT",
    "legend": "This warlord embodies the Chapter’s battle tactics, striking hard and true where the enemy is weakest.",
    "description": "Each time this WARLORD makes a melee attack:  \n* You can re-roll the hit roll.\n* Improve the Armour Penetration characteristic of that attack by 1."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Codex Supplement: Wolfspear",
    "roll": "2",
    "name": "HUNT FROM AFAR",
    "legend": "This warlord is a danger in the shadows, its designated prey never safe from its gunsight.",
    "description": "Each time this WARLORD makes a ranged attack against a non-VEHICLE, non-MONSTER unit, an unmodified hit roll of 2+ is successful and an unmodified wound roll of 2+ is successful."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Codex Supplement: Wolfspear",
    "roll": "3",
    "name": "HOWLING BEAST",
    "legend": "This warlord is terror made manifest, a beast that feasts on the fear of lesser souls.",
    "description": "While this WARLORD is within Engagement Range of any enemy models with a Leadership characteristic of 7 or less, add 2 to its Attacks characteristic."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Codex Supplement: Emperor’s Spears",
    "roll": "1",
    "name": "BLOODIED BUT UNBROKEN",
    "legend": "Since the opening of the Great Rift, this Warlord has faced hardship and adversity at every turn. Even in turmoil, they will prevail through strength of will.",
    "description": "* Add 1 to the Attacks characteristic of this WARLORD.\n* While this WARLORD has fewer than its starting number of Wounds remaining, add 1 to its Attacks characteristic."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Codex Supplement: Emperor’s Spears",
    "roll": "2",
    "name": "TRIBAL HERITAGE",
    "legend": "This Warlord holds to the traditions of their tribe from Nemeton, proudly honouring their heritage as they fight their enemies.",
    "description": "* Once per battle, you can re-roll a failed hit roll, wound roll or saving throw made for this WARLORD.\n* Once per battle, if your army is Battle-forged, you can use a valid Epic Deed Stratagem on this WARLORD without spending any Command Points."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Codex Supplement: Emperor’s Spears",
    "roll": "3",
    "name": "SENTINEL OF THE VEIL",
    "legend": "This Warlord has persecuted many a war across the Veil and personifies the Chapter’s moniker.",
    "description": "* This WARLORD is eligible to perform a Heroic Intervention if it is within 6\" horizontally and 5\" vertically of any enemy unit, instead of 3\" horizontally and 5\" vertically. Each time it makes a Heroic Intervention move, it can move up to 6\" instead of 3\" (all other rules for Heroic Interventions still apply).\n* This WARLORD fights first in the Fight phase."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Codex Supplement: Exorcists",
    "roll": "1",
    "name": "ENOCHIAN GUARD",
    "legend": "As a member of this most prestigious Orison cult, this warlord imbues themself with righteous strength by adorning their weapons and wargear with excerpts from the hallowed writings of the Chapter.",
    "description": "* Once per battle, you can modify the result of a hit roll, wound roll or saving throw made for this WARLORD to a 6.\n* Once per battle, you can use an ADEPTUS ASTARTES Epic Deed Stratagem without spending any CPs if this WARLORD is the model specified by that Stratagem’s keyword."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Codex Supplement: Exorcists",
    "roll": "2",
    "name": "KNOW THY ENEMY",
    "legend": "This warlord is learned in the wealth of archived lore the Chapter has collected over centuries of warfare against their enemies, and applies this knowledge with effectiveness upon the battlefield.",
    "description": "Before the battle, select one unit in your opponent’s army. Until the end of the battle, this WARLORD has the following ability: ‘Know Thy Enemy (Aura)**:** While a friendly EXORCISTS CORE or EXORCISTS CHARACTER unit is within 6\" of this WARLORD, each time a model in that unit makes an attack against the enemy unit you selected, add 1 to that attack’s hit roll.’"
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Codex Supplement: Exorcists",
    "roll": "3",
    "name": "ERUDITE IN THE VERSES",
    "legend": "This warlord is well versed in the Liber Exorcismus, reciting its rites to banish enemies and defeat their sorceries.",
    "description": "* This WARLORD can attempt to Deny the Witch as if it were a PSYKER. If this WARLORD is a PSYKER, in each of your opponent’s Psychic phases, this WARLORD can attempt to Deny the Witch one additional time.\n* In each of your Shooting phases, instead of shooting with this WARLORD, if it is not within Engagement Range of any enemy units, you can attempt a banishment. If you do so, roll one D6: on a 3+, the closest enemy unit within 12\" of and visible to this WARLORD suffers D3 mortal wounds."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Codex Supplement: Crimson Fists",
    "roll": "1",
    "name": "Tenacious Opponent",
    "legend": "This Warlord fights all the harder when he is outnumbered by his foes and all seems lost.",
    "description": "If there are at least 10 enemy models within 6\" of this WARLORD when he fights in the Fight phase, add D3 to his Attacks characteristic until the end of the phase."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Codex Supplement: Crimson Fists",
    "roll": "2",
    "name": "Refuse to Die",
    "legend": "Countless times have the enemies of Mankind tried to slay this stoic Warlord in battle. None have succeeded.",
    "description": "The first time this WARLORD is reduced to 0 wounds, roll one D6\\. On a 4+ set him up again at the end of the phase, as close as possible to his previous position and more than 1\" from any enemy models, with D3 wound remaining."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Codex Supplement: Crimson Fists",
    "roll": "3",
    "name": "Stoic Defender",
    "legend": "When this Warlord plants his feet, he and his warriors will hold their ground with implacable determination.",
    "description": "All friendly CRIMSON FISTS INFANTRY, BIKER and DREADNOUGHT units have the Defenders of Humanity ability whilst they are within 6\" of this WARLORD. If a Crimson Fists unit already has this ability, then each model in that unit counts as two models for the purposes of determining who controls objective markers, whilst that unit is within 6\" of this WARLORD."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Dark Angels Warlord Traits",
    "roll": "1",
    "name": "BRILLIANT STRATEGIST",
    "legend": "Only the most able commanders can take the guidance of the Codex Astartes and adapt it further to secure victory.",
    "description": "In your Command phase, you can select one friendly DARK ANGELS unit within 6\" of this WARLORD. Until the start of your next Command phase:  \n* Each time a model in that unit makes an attack, if the Tactical Doctrine is active for your army, then the Devastator Doctrine is considered to be active for that attack instead.\n* Each time a model in that unit makes an attack, if the Assault Doctrine is active for your army, then the Tactical Doctrine considered to be active for that attack instead."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Dark Angels Warlord Traits",
    "roll": "2",
    "name": "FURY OF THE LION (AURA)",
    "legend": "This leader inspires his battle-brothers through his actions, throwing himself into the fray knowing his warriors will follow.",
    "description": "While a friendly DARK ANGELS unit is within 6\" of this WARLORD, if this WARLORD has made a charge move, was charged or performed a Heroic Intervention this turn, add 1 to the Strength characteristic of models in that unit."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Dark Angels Warlord Traits",
    "roll": "3",
    "name": "CALIBANITE KNIGHT",
    "legend": "The warlord has studied what little remains of old Calibanite lore to perfect ancient sword-wielding techniques.",
    "description": "Each time this WARLORD makes a melee attack against an INFANTRY or BIKER unit, an unmodified wound roll of 2+ is always successful."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Dark Angels Warlord Traits",
    "roll": "4",
    "name": "STUBBORN TENACITY",
    "legend": "This warlord is an exemplar of the tenacity that characterises his Chapter, fighting on through even serious injuries.",
    "description": "When this WARLORD is destroyed, if it does not explode, you can use this Warlord Trait instead of using any other abilities that take effect as a result of this model being destroyed (e.g. Astartes Banner). If you do, this WARLORD is not removed from play until the start of the next turn or the end of the battle (whichever comes first). Until that happens, it is still considered to be in play, but any further wounds this WARLORD would lose are not lost."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Dark Angels Warlord Traits",
    "roll": "5",
    "name": "DECISIVE TACTICIAN (AURA)",
    "legend": "This warlord is known for his ability to swiftly move his forces into ideal attack positions and urge them on to crushing charges.",
    "description": "While a friendly DARK ANGELS CORE unit is within 6\" of this WARLORD, add 1 to Advance and charge rolls made for that unit."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Dark Angels Warlord Traits",
    "roll": "6",
    "name": "HONOUR OF THE FIRST LEGION",
    "legend": "Valour and nobility define this warlord, who seeks to honour his brotherhood through deeds of great heroism.",
    "description": "* This WARLORD is eligible to perform a Heroic Intervention if it is within 6\" horizontally and 5\" vertically of an enemy unit.\n* Each time this WARLORD makes a Heroic Intervention move, so long as it ends that move closer to the closest enemy model, it can move up to 6\". All other rules for Heroic Interventions still apply."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Blood Angels Warlord Traits",
    "roll": "1",
    "name": "SPEED OF THE PRIMARCH",
    "legend": "Such is this warlords speed, it is as if the Primarch himself fights alongside his sons.",
    "description": "At the start of the Fight phase, if this WARLORD is within Engagement Range of any enemy units, it can fight first that phase."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Blood Angels Warlord Traits",
    "roll": "2",
    "name": "ARTISAN OF WAR",
    "legend": "This warlord is a true artist both on and off the battlefield. His talents are reflected in the exquisite workmanship of his wargear, for he insists upon personally crafting his weapons of war.",
    "description": "This WARLORD can be given one of the following Special-issue Wargear Relics: Adamantine Mantle; Artificer Armour; Master-crafted Weapon; Digital Weapons. This is in addition to any other Relics they may have, and each Relic in your army must be unique."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Blood Angels Warlord Traits",
    "roll": "3",
    "name": "SOULWARDEN (AURA)",
    "legend": "This warlord is possessed of an iron will, his sheer mental determination ensuring that neither his own Red Thirst nor the evils of enemy sorcerers can easily find purchase upon his or his brothers’ souls.",
    "description": "While a friendly BLOOD ANGELS unit is within 6\" of this WARLORD, each time a model in that unit would lose a wound as the result of a mortal wound, roll one D6: on a 5+, that wound is not lost."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Blood Angels Warlord Traits",
    "roll": "4",
    "name": "HEROIC BEARING",
    "legend": "This warlord is a beacon of hope in a hateful galaxy. No matter the odds, friendly forces are inspired by his presence.",
    "description": "* Add 3\" to the range of this WARLORD s Rites of Battle, Tactical Precision, Chapter Master and Spiritual Leaders abilities (to a maximum of 9\").\n* This Warlord has the following ability: ‘Heroic Bearing (Aura)**:** While a friendly BLOOD ANGELS CORE unit is within 9\" of this WARLORD, add 1 to the Leadership characteristic of models in that unit.’"
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Blood Angels Warlord Traits",
    "roll": "5",
    "name": "GIFT OF FORESIGHT",
    "legend": "This heroic warrior bears a glimmering of Sanguinius’prophetic gifts. Flashes of foresight allow him to parry and weave around his enemy’s blows with supernatural speed and skill.",
    "description": "In each turn, you can re-roll one hit roll, one wound roll and one saving throw made for this WARLORD."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Blood Angels Warlord Traits",
    "roll": "6",
    "name": "SELFLESS VALOUR",
    "legend": "This warlord is courageous and noble. He leaps into battle without a moment’s thought for his own safety.",
    "description": "This WARLORD is eligible to perform a Heroic Intervention if it is within 6\" horizontally of an enemy unit, and when performing a Heroic Intervention with this WARLORD, you can move them up to 6\" instead of 3\". All other rules for Heroic Interventions still apply."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Flesh Tearers Warlord Traits",
    "roll": "1",
    "name": "MERCILESS BUTCHER",
    "legend": "This warlord is but a single, blood-fuelled moment away from succumbing to the Black Rage. In battle they are lost to the pursuit of slaughter, hacking apart all before them with unrelenting savagery.",
    "description": "Each time this WARLORD is selected to fight, make 1 additional attack with one of its melee weapons for every five enemy models within 3\" of it (to a maximum of 3 additional attacks)."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Flesh Tearers Warlord Traits",
    "roll": "2",
    "name": "OF WRATH AND RAGE",
    "legend": "With snarls of hate and a bellow of rage, this warlord fires the blood of his brothers.",
    "description": "Each time this WARLORD makes a melee attack, an unmodified hit roll of 6 scores 1 additional hit."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Flesh Tearers Warlord Traits",
    "roll": "3",
    "name": "CRETACIAN BORN",
    "legend": "To survive on the death world of Cretacia, a hunter must be swifter than the murderous beasts around him. A son of this brutal world, this warlord acts with ferocious swiftness, rushing into combat before his prey has time to react.",
    "description": "* Each time this WARLORD declares a charge, enemy units that were targeted by that charge cannot fire Overwatch or Set to Defend against that charge.\n* You can re-roll charge rolls made for this WARLORD."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Codex Supplement: Silver Templars",
    "roll": "1",
    "name": "ACCOMPLISHED DUELLIST",
    "legend": "Martial excellence is integral to advancement within the Silver Templars, for the Chapter’s tenets of strategy and spiritual philosophy employ it as their foundation. Many of the Silver Templars’ greatest heroes are thus also their greatest swordsmen.",
    "description": "* At the start of the Fight phase, if this model is within Engagement Range of any enemy units, it can fight first that phase.\n* Each time this WARLORD makes a melee attack, if it made a charge move, was charged or performed a Heroic Intervention this turn, you can re-roll the wound roll."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Codex Supplement: Silver Templars",
    "roll": "2",
    "name": "PRECISION COMMANDER",
    "legend": "When a Silver Templars commander sets their mind to the destruction of the enemy, their pursuit of that goal becomes allencompassing, not resting until that threat to the Imperium has been destroyed.",
    "description": "In your Command phase, you can select one friendly SILVER TEMPLARS PRIMARIS CORE unit within 6\" of this WARLORD. Until the start of your next Command phase, each time that unit is selected to shoot or fight, you can re-roll one hit roll and you can re-roll one wound roll."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Codex Supplement: Silver Templars",
    "roll": "3",
    "name": "SPIRITUAL SYNERGY",
    "legend": "Over many years of fighting, this warrior’s bond with their chosen weapon’s machine spirit has become so strong the two have become almost intertwined, a singular, lethal entity.",
    "description": "Select one weapon this WARLORD is equipped with (excluding Relics). Each time this WARLORD makes an attack with that weapon, an unmodified wound roll of 6 inflicts 1 mortal wound on the target in addition to any normal damage."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Space Wolves Warlord Traits",
    "roll": "1",
    "name": "BEASTSLAYER",
    "legend": "This warlord has slain some of the worst creatures that the galaxy has to offer. Such a hero embodies Russ’ ferocity and courage.",
    "description": "* While this WARLORD is within Engagement Range of any enemy MONSTER or VEHICLE units, add 1 to its Attacks characteristic.\n* Each time this WARLORD makes an attack against a MONSTER or VEHICLE unit, add 1 to that attacks hit roll and wound roll."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Space Wolves Warlord Traits",
    "roll": "2",
    "name": "WOLFKIN",
    "legend": "The warlord has a primal potency, unleashing his bestial predatory instinct and sending his savagery into overdrive until not a single enemy stands before him.",
    "description": "For the purposes of its Shock Assault ability, this WARLORD is always treated as having made a charge move, and makes D3 additional attacks instead of 1 as a result of that ability."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Space Wolves Warlord Traits",
    "roll": "3",
    "name": "WARRIOR BORN",
    "legend": "Endowed with preternatural prowess, the warlord strikes swift and savage at all who stand before him.",
    "description": "At the start of the Fight phase, if this WARLORD is within Engagement Range of any enemy units, it can fight first that phase."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Space Wolves Warlord Traits",
    "roll": "4",
    "name": "HUNTER",
    "legend": "A master of the chase, ever is this hero on the move, tracking and running down his prey with the speed and inevitability of an alpha predator. Such a warrior exemplifies his Primarch’s hunting instincts.",
    "description": "* Add 1 to Advance and charge rolls made for this WARLORD.\n* This WARLORD is eligible to charge in a turn in which it Advanced or Fell Back."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Space Wolves Warlord Traits",
    "roll": "5",
    "name": "AURA OF MAJESTY",
    "legend": "The warlord speaks with the wisdom of the ages and the deep growl of long years of experience, inspiring his packs to acts of valour and greatness.",
    "description": "* Add 3\" to the range of this WARLORD’s Rites of Battle, Tactical Precision, Chapter Master and Spiritual Leaders abilities (to a maximum of 9\").\n* Add 3\" to the range of any litanies recited by this WARLORD (to a maximum of 9\")."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Space Wolves Warlord Traits",
    "roll": "6",
    "name": "RESOLVE OF THE BEAR",
    "legend": "When this hero plants his feet firmly, he stands as enduring as the mountains of Asaheim.",
    "description": "* Each time this WARLORD would lose a wound, roll one D6; on a 6, that wound is not lost.\n* Each time an attack is made against this WARLORD, your opponent cannot re-roll the wound roll and cannot re-roll the damage roll."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Dark Angels Warlord Traits",
    "roll": "1-3",
    "name": "WATCHED",
    "legend": "Strange, hooded creatures watch this warlord from afar and, at times, lend aid.",
    "description": "Once per battle, in your opponent’s Psychic phase, this WARLORD can attempt to resist one additional psychic power, even if it is not a PSYKER and even if it is not within 24\" of the enemy model manifesting that psychic power. When taking that Deny the Witch test, do not roll the dice; it is automatically passed."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Dark Angels Warlord Traits",
    "roll": "4-6",
    "name": "INEXORABLE",
    "legend": "Through force of will alone this warlord shrugs off the most grievous wounds.",
    "description": "Each time an attack is allocated to this WARLORD, subtract 1 from that attacks Damage characteristic (to a minimum of 1)."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Dark Angels Warlord Traits",
    "roll": "1-3",
    "name": "LIGHTNING-FAST REACTIONS",
    "legend": "The warlord is so fast he can dodge strikes and incoming fire.",
    "description": "Each time an attack is made against this WARLORD, subtract 1 from that attack’s hit roll."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Dark Angels Warlord Traits",
    "roll": "4-6",
    "name": "MASTER OF MANOEUVRE",
    "legend": "The warlord moves across the battlefield seamlessly to exploit opportunities to strike the foe, remaining composed.",
    "description": "This WARLORD is eligible to either shoot or charge in a turn in which it Fell Back."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Deathwatch Warlord Traits",
    "roll": "1",
    "name": "VIGILANCE INCARNATE",
    "legend": "In standing sentinel over a vital swathe of the Imperium, this warlord always knows the appropriate tactics to defeat a foe.",
    "description": "In your Command phase, you can select one friendly DEATHWATCH CORE unit within 6\" of this WARLORD. Each time you do, select one Battlefield Role; until the start of your next Command phase, each time a model in that unit makes an attack against an enemy unit with that Battlefield Role, re-roll a wound roll of 1."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Deathwatch Warlord Traits",
    "roll": "2",
    "name": "PARAGON OF THEIR CHAPTER",
    "legend": "An exemplar of their former brotherhood, the commander is a hero who selflessly upholds their honour in every mission.",
    "description": "Select one Warlord Trait from the Chapter Warlord Traits for this WARLORD. Replace all instances of that Chapter’s keyword on that Warlord Trait with DEATHWATCH. If this WARLORD has the heraldry of one of those Chapters (or, other than Crimson Fists, Black Templars and Flesh Tearers, one of their successor Chapters), you must select that Chapter s Warlord Trait. Note that this cannot be a Chapter Warlord Trait found in a Codex supplement."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Deathwatch Warlord Traits",
    "roll": "3",
    "name": "NOWHERE TO HIDE (AURA)",
    "legend": "This warlord has slain Hrud in their warrens, Kroot guerillas in their jungles and Necrons in their tombs. No alien can hide from his wrath.",
    "description": "In your Command phase, you can select one enemy unit on the battlefield. Until the start of your next Command phase, while a friendly DEATHWATCH CORE unit is within 6\" of this WARLORD, each time a model in that friendly unit makes an attack against that enemy unit, it does not receive the benefit of cover to its saving throw against that attack."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Deathwatch Warlord Traits",
    "roll": "4",
    "name": "OPTIMISED PRIORITY (AURA)",
    "legend": "Endowed with preternatural strategic prowess, this warlord swiftly balances complex threat protocols.",
    "description": "While a friendly DEATHWATCH CORE or DEATHWATCH CHARACTER unit that is performing an action is within 6\" of this WARLORD, that unit can make ranged attacks without that action failing."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Deathwatch Warlord Traits",
    "roll": "5",
    "name": "CASTELLAN OF THE BLACK VAULT",
    "legend": "Within the arsenals of the Death watch are masterpiece artefacts fashioned by the Imperiums greatest smiths and artificers. Those who guard these vaults are not afraid to make use of them.",
    "description": "When mustering your army, you can give one of the following Relics to this WARLORD: Adamantine Mantle; Artificer Armour; Master-crafted Weapon; Digital Weapons. This is in addition to any other Relics they may have, and each Relic in your army must be unique."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Deathwatch Warlord Traits",
    "roll": "6",
    "name": "THE TIES THAT BIND (AURA)",
    "legend": "A legendary war leader whose vast experience has been earned over countless missions, this warlord personally assembles forces that are each a carefully crafted association of expertise, personalities and insight that fight as one.",
    "description": "* While a friendly DEATHWATCH CORE unit is within 6\" of this WARLORD, you can re-roll Morale tests taken for that unit.\n* In your Command phase, you can select one friendly DEATHWATCH CORE unit within 6\" of this WARLORD. Until the start of your next Command phase, that unit gains the Objective Secured ability. If a model in that unit already has this ability, it counts as one additional model when determining control of an objective marker."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Warlord Traits",
    "roll": "1",
    "name": "FEAR MADE MANIFEST (AURA)",
    "legend": "The Emperor’s enemies quail beneath this champion’s wrathful gaze.",
    "description": "While an enemy unit is within 6\" of this WARLORD:  \n* Subtract 1 from the Leadership characteristic of models in that unit.\n* Each time a Combat Attrition test is taken for that unit, subtract 1 from that Combat Attrition test."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Warlord Traits",
    "roll": "2",
    "name": "THE IMPERIUM’S SWORD",
    "legend": "This warlord hurls himself forwards with unbridled ferocity, cutting down the foe like a reaping whirlwind.",
    "description": "* You can re-roll charge rolls made for this WARLORD.\n* Each time this WARLORD fights, if it made a charge move or performed a Heroic Intervention this turn, then until that fight is resolved, add 1 to its Strength and Attacks characteristics."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Warlord Traits",
    "roll": "3",
    "name": "IRON RESOLVE",
    "legend": "Faith and duty drive this warlord relentlessly onwards as he shrugs off injuries that would lay lesser warriors low.",
    "description": "* Add 1 to the Wounds characteristic of this WARLORD.\n* Each time this WARLORD would lose a wound, roll one D6: on a 6, that wound is not lost."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Warlord Traits",
    "roll": "4",
    "name": "CHAMPION OF HUMANITY",
    "legend": "This commander has slain enemy generals beyond counting.",
    "description": "* Each time this WARLORD fights, if it is within Engagement Range of any enemy CHARACTER units, then until that fight is resolved, add 1 to this Warlord’s Attacks characteristic.\n* Each time this WARLORD makes a melee attack against a CHARACTER unit, add 1 to that attack’s hit roll and wound roll."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Warlord Traits",
    "roll": "5",
    "name": "STORM OF FIRE (AURA)",
    "legend": "This warlord expertly guides his warriors’ fire.",
    "description": "While a friendly CHAPTER> CORE unit is within 6\" of this WARLORD, each time a model in that unit makes a ranged attack, on an unmodified wound roll of 6, improve the Armour Penetration characteristic of that attack by 1."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Warlord Traits",
    "roll": "6",
    "name": "RITES OF WAR (AURA)",
    "legend": "This commander and his warriors have vowed to secure victory.",
    "description": "While a friendly CHAPTER> CORE or CHAPTER> CHARACTER unit is within 6\" of this WARLORD, that unit has the Objective Secured ability."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "White Scars Warlord Traits",
    "roll": "1",
    "name": "DEADLY HUNTER",
    "legend": "This son of the Warhawk strikes swiftly and suddenly, a predator whose first kill is claimed before the foe are even aware of their peril.",
    "description": "After this WARLORD finishes a charge move, you can select one enemy unit within 1\" of it and roll one D6; on a 2+ that unit suffers 1 mortal wound."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "White Scars Warlord Traits",
    "roll": "2",
    "name": "CHOGORIAN STORM",
    "legend": "This commander hits the enemy’s lines with all the ferocity of a raging tempest surging in from the desolate steppes.",
    "description": "If this WARLORD makes a charge move or performs a Heroic Intervention, add D3 to their Attacks characteristic until the end of the turn."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "White Scars Warlord Traits",
    "roll": "3",
    "name": "TROPHY TAKER",
    "legend": "For this proud warrior the hunt never ceases, and he is ever seeking another head to take in the name of the Khan.",
    "description": "When this WARLORD destroys an enemy CHARACTER model, add 1 to their Attacks characteristic until the end of the battle."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "White Scars Warlord Traits",
    "roll": "4",
    "name": "MASTER RIDER",
    "legend": "Even before he became a Space Marine this warlord was a master of mounted combat, as swift and elusive as the wind when fighting from the saddle.",
    "description": "BIKER only. If you are randomly generating your WARLORD’s Warlord Trait and your Warlord is not a BIKER, re-roll this result until a different Warlord Trait is generated. When a charge roll is made for this WARLORD, you can re-roll the dice. When resolving an attack against this Warlord, subtract 1 from the hit roll if this WARLORD Advanced in your previous Movement phase."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "White Scars Warlord Traits",
    "roll": "5",
    "name": "HUNTER’S INSTINCTS",
    "legend": "This huntsman takes great delight in facing the deadliest prey imaginable, whether they be mechanical, biological or supernatural.",
    "description": "When resolving an attack made by this Warlord against an enemy MONSTER or VEHICLE unit, add 1 to the hit roll and wound roll."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "White Scars Warlord Traits",
    "roll": "6",
    "name": "MASTER OF SNARES",
    "legend": "This warlord is a skilled trapper, able to entangle his prey in an inescapable thicket of flashing blades.",
    "description": "When an enemy unit (other than a unit that contains a model with a minimum Move characteristic) within Engagement Range of this WARLORD is chosen to Fall Back, you can roll one D6: on a 4+, that unit cannot Fall Back this turn."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Ultramarines Warlord Traits",
    "roll": "1",
    "name": "ADEPT OF THE CODEX",
    "legend": "Ultramarines warlords epitomise the teachings of the Codex Astartes.",
    "description": "Whilst this WARLORD is on the battlefield, you can roll one D6 for each Command Point you spend to use a Stratagem; on a 5+ that Command Point is refunded. You can only have 1 Command Point refunded per battle round by this Warlord Trait."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Ultramarines Warlord Traits",
    "roll": "2",
    "name": "MASTER OF STRATEGY",
    "legend": "This warlord executes deadly and decisive strategies on the battlefield.",
    "description": "Once per battle round, if this Warlord is on the battlefield, you can select one friendly ULTRAMARINES unit within 6\" of this WARLORD. Until the end of that battle round, when a model in that unit makes an attack, the Tactical Doctrine is considered to be active."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Ultramarines Warlord Traits",
    "roll": "3",
    "name": "CALM UNDER FIRE (AURA)",
    "legend": "This warlord directs his troops flawlessly, even deep in the maelstrom of battle.",
    "description": "While a friendly ULTRAMARINES unit is within 6\" of this WARLORD, each time a model in that unit makes a ranged attack in a turn in which it Fell Back, do not subtract 1 from that attack’s hit roll due to the Codex Discipline Chapter Tactic."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Ultramarines Warlord Traits",
    "roll": "4",
    "name": "PARAGON OF WAR",
    "legend": "This warrior knows just where to strike to inflict a killing blow.",
    "description": "When resolving an attack made by this WARLORD, an unmodified wound roll of 6 inflicts 1 mortal wound on the target in addition to any other damage."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Ultramarines Warlord Traits",
    "roll": "5",
    "name": "NOBILITY MADE MANIFEST (AURA)",
    "legend": "The patrician aspect and selfless heroism of this warlord combine to influence greatly the warriors who fight beneath his banner. They fight all the harder to follow his shining example in battle.",
    "description": "Friendly ULTRAMARINES INFANTRY units and ULTRAMARINES BIKER units can perform a Heroic Intervention as if they were CHARACTERS whilst they are within 6\" of this WARLORD."
  },
  {
    "faction_id": "SM",
    "faction_name": "Space Marines",
    "type": "Ultramarines Warlord Traits",
    "roll": "6",
    "name": "WARDEN OF MACRAGGE",
    "legend": "The warlord has sworn mighty oaths to drive back the hordes that threaten Macragge.",
    "description": "This WARLORD can perform a Heroic Intervention if there are any enemy units within 6\" of them instead of 3\", and when doing so can move up to 6\" instead of 3\"."
  },
  {
    "faction_id": "TAU",
    "faction_name": "T’au Empire",
    "type": "Warlord Traits",
    "roll": "1",
    "name": "MASTER OF THE HUNT (AURA)",
    "legend": "This warlord is an accomplished tracker of prey through even the most treacherous terrain or most extreme of weather conditions. They can detect camouflaged foes at fifty paces through a blizzard, employing only fieldcraft and instinct, and direct the warriors under their control to strike and slaughter their hapless quarry accordingly.",
    "description": "While a friendly KROOT unit is within 6\" of this WARLORD, each time a model in that unit makes a ranged attack that targets a unit within 12\", the target does not receive the benefits of cover against that attack."
  },
  {
    "faction_id": "TAU",
    "faction_name": "T’au Empire",
    "type": "Warlord Traits",
    "roll": "2",
    "name": "PACK LEADER (AURA)",
    "legend": "Rugged and rough-mannered, this warlord is more at home amongst the rank and file of their followers than attending high-level briefings. In battle they fight fierce and dirty, leading their warriors from front and centre, and urging them into the fray with a carnivore’s ferocious hunger.",
    "description": "While a friendly KROOT unit is within 6\" of this WARLORD, each time you make a charge roll for that unit, roll one additional D6 and discard one of the dice."
  },
  {
    "faction_id": "TAU",
    "faction_name": "T’au Empire",
    "type": "Warlord Traits",
    "roll": "3",
    "name": "NOMADIC HUNTER (AURA)",
    "legend": "This warlord keeps their warriors always on the move, tracking fresh prey whose bodies may be consumed in order to claim their strength. His followers have become adept at the loping pursuit, snapping off harassing fire even as they tirelessly and mercilessly run their victims to ground.",
    "description": "While a friendly KROOT unit is within 6\" of this WARLORD, each time a model in that unit makes a ranged attack, if that unit did not Fall Back this turn, it counts as having Remained Stationary during its previous Movement phase."
  },
  {
    "faction_id": "TAU",
    "faction_name": "T’au Empire",
    "type": "Warlord Traits",
    "roll": "",
    "name": "STRENGTH OF CONVICTION",
    "legend": "This warlord’s dedication to the T’au’va is so great that they will not allow themselves to die with their duty undone.",
    "description": "Each time this WARLORD would lose a wound, roll one D6: on a 5+, that wound is not lost."
  },
  {
    "faction_id": "TAU",
    "faction_name": "T’au Empire",
    "type": "Warlord Traits",
    "roll": "",
    "name": "STRATEGIC CONQUEROR",
    "legend": "This warlord appreciates the strategic value of seizing static battlefield assets amidst the distinctly un-T’au-like grind of urban warfare.",
    "description": "In your Command phase, select one friendly SA’CEA unit within 9\" of this WARLORD. Until the start of your next Command phase, that unit gains the Objective Secured ability. If that unit already has this ability, models in that unit counts as one additional model when determining control of an objective marker."
  },
  {
    "faction_id": "TAU",
    "faction_name": "T’au Empire",
    "type": "Warlord Traits",
    "roll": "",
    "name": "UNIFYING INFLUENCE",
    "legend": "This warlord is held in the highest favour by the alien auxiliaries serving alongside them.",
    "description": "This WARLORD gains the following abilities:  \n  \nDiplomatic Excellence (Aura)**:** While a friendly DAL’YTH or T’AU AUXILIARY unit (excluding CHARACTER units) is within 6\" of this WARLORD, add 1 to the Leadership characteristic of models in that unit.  \n  \nIntegrated Command Structure (Aura)**:** While a friendly T’AU AUXILIARY unit is within 6\" of this WARLORD, that unit is treated as not having the T’AU AUXILIARY keyword for the purpose of the Markerlights rule."
  },
  {
    "faction_id": "TAU",
    "faction_name": "T’au Empire",
    "type": "Warlord Traits",
    "roll": "",
    "name": "SEEKER OF PERFECTION",
    "legend": "Conscious that they wield the finest tools of war available to any T’au, this warlord seeks to be equal in skill to the weapons it is their privilege to bear.",
    "description": "Each time this WARLORD makes a ranged attack:  \n* Improve the Armour Penetration characteristic of that attack by 1.\n* An unmodified wound roll of 6 inflicts 1 mortal wound on the target in addition to any normal damage (to a maximum of 3 mortal wounds per phase)."
  },
  {
    "faction_id": "TAU",
    "faction_name": "T’au Empire",
    "type": "Warlord Traits",
    "roll": "",
    "name": "MASTER OF THE KILLING BLOW",
    "legend": "This warlord knows that cutting the head from the snake is a sound battlefield tactic in any war, and they pursue enemy commanders and warlords relentlessly. Once they are successful in their hunt, their enemies’ forces collapse into disarray and are easy prey.",
    "description": "Each time this WARLORD makes an attack:  \n* On an unmodified wound roll of 6, improve the Armour Penetration characteristic of that attack by 3.\n* The model that attack is allocated to cannot use any rules to ignore the wounds it loses."
  },
  {
    "faction_id": "TAU",
    "faction_name": "T’au Empire",
    "type": "Warlord Traits",
    "roll": "1",
    "name": "PRECISION OF THE HUNTER",
    "legend": "This warlord prowls the battlefield like a high-tech apex predator, stalking and assessing their quarry before they strike. When they do launch their assault, their every shot and blow is informed by their careful observations, perfectly aimed where they will do the greatest harm.",
    "description": "Each time this WARLORD makes an attack, you can re-roll the hit roll and you can re-roll the wound roll."
  },
  {
    "faction_id": "TAU",
    "faction_name": "T’au Empire",
    "type": "Warlord Traits",
    "roll": "2",
    "name": "THROUGH UNITY, DEVASTATION (AURA)",
    "legend": "Having studied every nuance of the art of applied mass-firepower, this warlord has mastered its deployment. Under their calm tutelage and stern gaze, warriors of the Fire Caste maximise every shot they fire, creating a blizzard of deadly-accurate energy that can pick apart even the most heavily armoured targets.",
    "description": "While a friendly SEPT> CORE unit is within 6\" of this WARLORD, each time a CORE model in that unit makes a ranged attack, on an unmodified wound roll of 6, improve the Armour Penetration characteristic of that attack by 1."
  },
  {
    "faction_id": "TAU",
    "faction_name": "T’au Empire",
    "type": "Warlord Traits",
    "roll": "3",
    "name": "A GHOST WALKS AMONG US",
    "legend": "Whether through application of personalised active camouflage or hard-earned stealth techniques mastered over dozens of missions behind enemy lines, this warlord can become virtually invisible to the foe should they choose to. They reveal themselves only when the moment is right to strike, exploding from the shadows with sudden and shocking ferocity.",
    "description": "* Each time an attack is made against this WARLORD, subtract 1 from that attack’s hit roll.\n* Each time this WARLORD Advances, do not make an Advance roll. Instead, until the end of the phase, add 6\" to the Move characteristic of this WARLORD."
  },
  {
    "faction_id": "TAU",
    "faction_name": "T’au Empire",
    "type": "Warlord Traits",
    "roll": "4",
    "name": "THROUGH BOLDNESS, VICTORY",
    "legend": "This warlord favours courageous, some would say reckless, tactics that see them close swiftly on the foe and eliminate them through violent and decisive action. Enemies fall before their thunderbolt offensive, barely realising they are under attack before they have been slain in the name of the Greater Good.",
    "description": "In your Command phase, select one friendly SEPT> CORE unit within 9\" of this WARLORD. Until the start of your next Command phase, each time a CORE model in that unit makes a ranged attack, an unmodified hit roll of 6 automatically wounds the target."
  },
  {
    "faction_id": "TAU",
    "faction_name": "T’au Empire",
    "type": "Warlord Traits",
    "roll": "5",
    "name": "EXEMPLAR OF THE KAUYON",
    "legend": "Long meditation upon the tenets of the Patient Hunter have seen this warlord master the application of this cunning ambush strategy. When they take to battlefield, they embody the teachings of the Kauyon, much to the dismay of their luckless prey.",
    "description": "After both players have deployed their armies and determined who has the first turn, select up to one friendly SEPT> unit, or up to three friendly SEPT> units if you selected the Kauyon Tactical Philosophy this battle, and redeploy them. If the mission uses the Strategic Reserves rules, any of those units can be placed into Strategic Reserves without having to spend any additional CPs, regardless of how many units are already in Strategic Reserves. If both players have abilities that redeploy units, roll off: the winner chooses who redeploys their units first."
  },
  {
    "faction_id": "TAU",
    "faction_name": "T’au Empire",
    "type": "Warlord Traits",
    "roll": "6",
    "name": "EXEMPLAR OF THE MONT’KA",
    "legend": "This warlord has studied the strategic and tactical precepts of the Mont’ka, the art of the Killing Blow. They both lead and fight accordingly, formulating swift and decisive battle-plans and leading their cadres from the front in aggressive strikes that send the enemy reeling.",
    "description": "In your Command phase, select one friendly SEPT> CORE unit within 9\" of this WARLORD. Until the start of your next Command phase, each time a Core model in that unit makes a ranged attack that targets an enemy unit within 9\", or 12\" if you selected the Mont’ka Tactical Philosophy this battle, you can re-roll the wound roll."
  },
  {
    "faction_id": "TAU",
    "faction_name": "T’au Empire",
    "type": "Warlord Traits",
    "roll": "",
    "name": "ACADEMY LUMINARY",
    "legend": "This Warlord has been marked for greatness by the exacting Fire Caste tutors of Vior’la, exhibiting a swift and decisive grasp of grand strategy that sees them outmanoeuvre their foes with deceptive ease.",
    "description": "While this WARLORD is on the battlefield, each time you spend a Command point to use a T’au Empire Strategic Ploy or T’au Empire Wargear Stratagem, roll one D6: on a 3+, that Command point is refunded."
  },
  {
    "faction_id": "TS",
    "faction_name": "Thousand Sons",
    "type": "Warlord Traits",
    "roll": "",
    "name": "MANIPULATOR OF REALITY",
    "legend": "Some Thousand Sons sorcerers have learned that sometimes, the shortest distance between two points is not a straight line. This knowledge is a great boon when deploying their troops for battle.",
    "description": "At the start of the first battle round, after any units from your army have performed any Normal Moves as a result of the Touched by Tzeentch ability, you can select up to three friendly TZAANGOR units. Remove those units from the battlefield, then set them up anywhere on the battlefield that is wholly within your deployment zone. If the mission you are playing uses the Strategic Reserves rules, you can place any of those units into Strategic Reserves instead, without having to spend any additional CPs, regardless of how many units are already in Strategic Reserves."
  },
  {
    "faction_id": "TS",
    "faction_name": "Thousand Sons",
    "type": "Warlord Traits",
    "roll": "1",
    "name": "ARROGANCE OF AEONS",
    "legend": "This warlord draws strength from a long-harboured hubris - he will take his due, and will not submit to the will of another.",
    "description": "* You can re-roll Deny the Witch tests taken for this WARLORD.\n* If your army is a Cabal of Sorcerers, this WARLORD can benefit from one additional Cabbalistic Ritual in each of your Psychic phases."
  },
  {
    "faction_id": "TS",
    "faction_name": "Thousand Sons",
    "type": "Warlord Traits",
    "roll": "2",
    "name": "SEEKER AFTER SHADOWS",
    "legend": "Neither dread warning nor threat of damnation can stay this champion’s quest for forbidden knowledge. Every such perilous fragment of lore increases their might and cunning both.",
    "description": "* Each time this WARLORD attempts to perform a Psychic action, roll one additional D6 and discard one D6 when taking that Psychic test.\n* If your army is a Cabal of Sorcerers, each time you generate Cabal points, if this WARLORD is on the battlefield you generate 1 additional Cabal point."
  },
  {
    "faction_id": "TS",
    "faction_name": "Thousand Sons",
    "type": "Warlord Traits",
    "roll": "3",
    "name": "UNDYING FORM",
    "legend": "This champion of Tzeentch has been blessed with an ever-shifting and unnatural form, their flesh as much warp-stuff as true matter. To harm such a transmogrified being requires weapons of great power.",
    "description": "Each time an attack is allocated to this WARLORD, subtract 1 from the Damage characteristic of that attack (to a minimum of 1)."
  },
  {
    "faction_id": "TS",
    "faction_name": "Thousand Sons",
    "type": "Warlord Traits",
    "roll": "4",
    "name": "LORD OF FORBIDDEN LORE",
    "legend": "This warlord has committed many a grimoire and unholy tome to memory, giving him unparalleled knowledge of hexes, curses and destructive rites.",
    "description": "Your WARLORD knows one additional psychic power. If your WARLORD is MAGNUS THE RED, it knows all the psychic powers from the disciplines it has access to."
  },
  {
    "faction_id": "TS",
    "faction_name": "Thousand Sons",
    "type": "Warlord Traits",
    "roll": "5",
    "name": "OTHERWORLDLY PRESCIENCE",
    "legend": "This warlord sees the weave of fate laid out before him. He knows when peril comes for him, what form it will take and how best to step aside from its dread grasp.",
    "description": "Once per battle, before making a saving throw for this WARLORD, empyric entities can grant him visions of fate. If they do, until the end of the turn, this WARLORD has a 3+ invulnerable save."
  },
  {
    "faction_id": "TS",
    "faction_name": "Thousand Sons",
    "type": "Warlord Traits",
    "roll": "6",
    "name": "AETHERSTRIDE",
    "legend": "This warlord has mastered the ability to fold time and space, enabling him to cross great distances with a single step and close upon his foes with terrifying speed.",
    "description": "* Add 3\" to the Move characteristic of this WARLORD.\n* This WARLORD is eligible to declare a charge during the same turn it Fell Back.\n* Each time this WARLORD makes a Normal Move, a charge move, an Advance or Falls Back, it moves as though it can FLY."
  },
  {
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "type": "Army of Renown: Crusher Stampede",
    "roll": "1",
    "name": "Raging Influence (Aura)",
    "legend": "When required, this warlord imbues its fellow beasts with a level of savagery that makes them even more dangerous in combat.",
    "description": "While a friendly CRUSHER STAMPEDE MONSTER unit is within 6\" of this WARLORD, each time a model in that unit makes a melee attack, an unmodified hit roll of 6 scores 1 additional hit."
  },
  {
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "type": "Army of Renown: Crusher Stampede",
    "roll": "2",
    "name": "Savage Intimidation (Aura)",
    "legend": "This warlord is even more terrifying to behold than other bioforms of its kind.",
    "description": "While an enemy unit is within 3\" of this WARLORD:  \n* Each time a model in that unit makes a melee attack, subtract 1 from that attack’s hit roll.\n* Each time a Combat Attrition test is taken for that unit, subtract 1 from that Combat Attrition test."
  },
  {
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "type": "Army of Renown: Crusher Stampede",
    "roll": "3",
    "name": "Rampaging Beast",
    "legend": "This warlord has reserves of energy that it unleashes in waves of devastating fury.",
    "description": "Once per turn, when this WARLORD is selected to Fight, it can use this Warlord Trait. If it does so, until the end of the phase, add D3 to this WARLORD’s Attacks characteristic."
  },
  {
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "type": "Warlord Traits",
    "roll": "",
    "name": "MONSTROUS HUNGER",
    "legend": "This warlord embodies the Hive Mind’s eternal hunger, tearing great chunks out of its victims in a feeding frenzy, or even swallowing them whole.",
    "description": "Each time this WARLORD makes a melee attack, an unmodified wound roll of 6 inflicts 1 mortal wound on the target in addition to any normal damage."
  },
  {
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "type": "Warlord Traits",
    "roll": "",
    "name": "ONE STEP AHEAD",
    "legend": "This warlord’s foresight allows it to see the prey’s next move.",
    "description": "Each time your opponent uses a Stratagem, if this WARLORD is on the battlefield, roll one D6: on a 5+, you gain 1 Command point."
  },
  {
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "type": "Warlord Traits",
    "roll": "",
    "name": "PERFECTLY ADAPTED",
    "legend": "This warlord was created for one purpose - to completely eradicate the defenders of the target prey world.",
    "description": "Once per battle round, you can re-roll one of the following rolls made for this WARLORD: hit roll; wound roll; damage roll; Advance roll; charge roll; Psychic test; saving throw."
  },
  {
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "type": "Warlord Traits",
    "roll": "",
    "name": "LETHAL MIASMA",
    "legend": "The air around the warlord churns with microscopic spores that invade the bodies of its foes, devouring them from the inside.",
    "description": "At the start of the Fight phase, roll one D6 for each enemy unit within 3\" of this WARLORD: on a 2-5, that enemy unit suffers 1 mortal wound; on a 6, that enemy unit suffers D3 mortal wounds."
  },
  {
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "type": "Warlord Traits",
    "roll": "",
    "name": "INSIDIOUS THREAT",
    "legend": "This warlord has lurked long on this world, developing an intimate knowledge of its terrain so there is nowhere for the prey to hide.",
    "description": "In your Command phase, select one friendly JORMUNGANDR unit within Synaptic Link range of this WARLORD. Until the start of your next Command phase, each time a model in that unit makes an attack, the target does not receive the benefits of cover against that attack."
  },
  {
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "type": "Warlord Traits",
    "roll": "",
    "name": "SOUL HUNGER (AURA)",
    "legend": "This warlord has an insatiable hunger for psykers, and can manipulate the Shadow in the Warp to drain the life from its favoured prey.",
    "description": "While an enemy PSYKER unit is within 18\" of this WARLORD, each time a Psychic test is taken for that unit, it suffers Perils of the Warp on any dice roll that includes a double, instead of only a double 1 or double 6."
  },
  {
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "type": "Warlord Traits",
    "roll": "",
    "name": "ENDLESS REGENERATION",
    "legend": "Enemy soldiers are horrified to see this warlord’s severed limbs and shattered chitinous plates regrowing before their eyes.",
    "description": "At the start of the Command phase, this WARLORD can regenerate itself. If it does so, it regains up to D3 lost wounds. This WARLORD can only regenerate itself once per turn."
  },
  {
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "type": "Codex Supplement: Leviathan",
    "roll": "1",
    "name": "SWARM LEADER",
    "legend": "This leader-beast can dominate the minds of its lesser warrior-organisms, directing their attacks with devastating precision.",
    "description": "In your Command phase, select one friendly LEVIATHAN INFANTRY, LEVIATHAN BEAST or LEVIATHAN SWARM unit within 9\" of this WARLORD. Until the start of your next Command phase, each time a model in that unit makes an attack, you can re-roll the hit roll."
  },
  {
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "type": "Codex Supplement: Leviathan",
    "roll": "2",
    "name": "STRATEGIC ADAPTATION",
    "legend": "This leader-beast epitomises Leviathans strategy of attacking on all fronts, ensuring that the foe is never sure where the main thrust of an attack will come from.",
    "description": "After both players have deployed their armies, but before the first battle round begins, select up to two LEVIATHAN units from your army that are in your deployment zone and redeploy them (you cannot select this WARLORD). If the mission uses the Strategic Reserves rules, any of those units can be placed into Strategic Reserves without having to spend any additional CPs, regardless of how many units are already in Strategic Reserves. If both players have abilities that redeploy units, roll off; the winner chooses who redeploys their units first."
  },
  {
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "type": "Codex Supplement: Leviathan",
    "roll": "3",
    "name": "GESTALT COMMANDER",
    "legend": "Hive Fleet Leviathan shares the strongest synaptic link with the Hive Mind, and can call upon the experiences of any other Tyranid leader-beast.",
    "description": "At the start of each battle round, select one Warlord Trait from the Hive Fleet Warlord Traits for this WARLORD (you cannot select Perfectly Adapted or any Warlord Trait that a model in your army already has). Until the end of that battle round, this WARLORD has the selected Warlord Trait - replace all instances of a hive fleet’s keyword on that Warlord Trait (if any) with LEVIATHAN."
  },
  {
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "type": "Warlord Traits",
    "roll": "1",
    "name": "ALIEN CUNNING",
    "legend": "This warlord possesses highly sophisticated neural pathways, allowing it to identify priority strategic assets and seize them before the foe even recognise their value.",
    "description": "* This WARLORD has the Objective Secured ability.\n* This WARLORD counts as 5 models when determining control of an objective marker.\n* This WARLORD can start to perform an action, even if it Advanced or Fell Back this turn."
  },
  {
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "type": "Warlord Traits",
    "roll": "2",
    "name": "HEIGHTENED SENSES",
    "legend": "Whether through rows of bristling antennae or clusters of glistening compound eyes, this warlord can sense the location of its prey with unerring accuracy.",
    "description": "* At the start of the Fight phase, if this WARLORD is within Engagement Range of any enemy units, it can fight first that phase.\n* Each time this WARLORD makes an attack, you can re-roll the hit roll."
  },
  {
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "type": "Warlord Traits",
    "roll": "3",
    "name": "SYNAPTIC LINCHPIN",
    "legend": "With a cerebral cortex that pulsates with the irresistible power of the Hive Mind, this warlord acts as a blazing synaptic beacon to the lesser creatures of the swarm.",
    "description": "* Add 3\" to the range of this WARLORD’s aura abilities and Synaptic Imperative abilities.\n* Each time this WARLORD uses an ability in your Command phase that specifies a range, until the end of the phase, add 3\" to the range of that ability."
  },
  {
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "type": "Warlord Traits",
    "roll": "4",
    "name": "DIRECT GUIDANCE",
    "legend": "Projecting a portion of its consciousness directly into the crude ganglia of its lesser warrior organisms allows this warlord to guide their strikes.",
    "description": "In your Command phase, select one friendly HIVE FLEET> CORE unit within Synaptic Link range of this WARLORD. Until the start of your next Command phase, each time a model in that unit makes an attack, add 1 to that attack’s hit roll."
  },
  {
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "type": "Warlord Traits",
    "roll": "5",
    "name": "SYNAPTIC TENDRILS",
    "legend": "This organism is a thrumming node of synaptic energies, a blazing beacon of the Hive Mind’s influence, able to reach out and augment the abilities of its swarm at will.",
    "description": "In your Command phase, if this WARLORD has one of the following abilities, it can use that ability one additional time that phase: Alpha Warrior, Bio-impulses, Brood Progenitor, Vicious Insight, Warp Siphon, Will of the Hive Mind."
  },
  {
    "faction_id": "TYR",
    "faction_name": "Tyranids",
    "type": "Warlord Traits",
    "roll": "6",
    "name": "ADAPTIVE BIOLOGY",
    "legend": "The same weapon rarely works against this warlord twice, as its alien physiology adapts at an astonishing rate to counter the attacks of the foe.",
    "description": "Each time this WARLORD would lose a wound, roll one D6: on a 5+, that wound is not lost."
  },
  {
    "faction_id": "YNN",
    "faction_name": "Ynnari",
    "type": "Warlord Traits",
    "roll": "1",
    "name": "LORD OF REBIRTH",
    "legend": "Some Ynnari have mastered the cycle of death and rebirth.",
    "description": "At the start of the battle round, this Warlord regains up to 1 lost wound. When this Warlord would lose a wound, roll one D6; on a 5+ that wound is not lost."
  },
  {
    "faction_id": "YNN",
    "faction_name": "Ynnari",
    "type": "Warlord Traits",
    "roll": "2",
    "name": "WARDEN OF SOULS",
    "legend": "This warrior of the Reborn is the keeper of many souls; their mastery over deathly energy is unparalleled.",
    "description": "Whilst this Warlord is drawing Strength from Death, add 1 to their Attacks and Strength characteristics."
  },
  {
    "faction_id": "YNN",
    "faction_name": "Ynnari",
    "type": "Warlord Traits",
    "roll": "3",
    "name": "WALKER OF MANY PATHS",
    "legend": "The hard-earned skills of this follower of Ynnead have been honed by walking the many paths of the Aeldari.",
    "description": "Once per turn, when resolving an attack made by this Warlord, you can re-roll one hit roll or you can re-roll one wound roll. Whilst this Warlord is on the battlefield, you can roll one D6 for each Command Point you spend to use a Stratagem; on a 5+ that Command Point is refunded. You can only have 1 Command Point refunded per battle round by this Warlord Trait."
  },
  {
    "faction_id": "YNN",
    "faction_name": "Ynnari",
    "type": "Warlord Traits",
    "roll": "4",
    "name": "FEAR OF THE GRAVE",
    "legend": "Ynnead knows neither mercy nor fear – the same cannot be said of the god’s foes.",
    "description": "Subtract 1 from the Leadership characteristic of models in enemy units whilst their unit is within 6\" of this Warlord; subtract 2 instead if any enemy units have been destroyed as a result of an attack made by this Warlord this turn."
  },
  {
    "faction_id": "YNN",
    "faction_name": "Ynnari",
    "type": "Warlord Traits",
    "roll": "5",
    "name": "FAVOURED OF YNNEAD",
    "legend": "The energies of the dead seek this Aeldari out, swirling around them like a gale and carrying them into the foe.",
    "description": "When this Warlord piles in or consolidates, they can move up to 6\" instead of up to 3\"."
  },
  {
    "faction_id": "YNN",
    "faction_name": "Ynnari",
    "type": "Warlord Traits",
    "roll": "6",
    "name": "MASTER OF DEATH",
    "legend": "This champion of the Reborn has great expertise in severing the cord that binds the body to the soul.",
    "description": "When resolving an attack made with a melee weapon by this Warlord, an unmodified hit roll of 6 scores 1 additional hit."
  }
]