[
  {
    "faction_id": "QI",
    "enhancements": [
      {
        "name": "REVERED KNIGHT (AURA)",
        "description": "Imperial Knights model only. While a friendly Imperial Knights model is within 6\" of the bearer, improve that model’s Leadership characteristic by 1. If your army is Honoured, increase the range of this Aura ability to 12\".",
        "keywords": ["Imperial Knights"]
      },
      {
        "name": "MYSTERIOUS GUARDIAN",
        "description": "Imperial Knights model only. The bearer has the Deep Strike ability. Once per battle, at the end of your opponent’s turn, if the bearer is not within Engagement Range of any enemy units, it can fade away. If it does, remove it from the battlefield then, in the Reinforcements step of your subsequent Movement phase, set it up anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If the battle ends and the bearer is not on the battlefield, it is destroyed",
        "keywords": ["Imperial Knights"]
      },
      {
        "name": "MYTHIC HERO",
        "description": "Questoris model with a Bondsman ability only. Each time the bearer uses its Bondsman ability, you can select one additional friendly Armiger model within 12\" of the bearer that is not already being affected by a Bondsman ability. Until the start of your next Command phase, that model is also affected by that Bondsman ability.",
        "keywords": ["Questoris"]
      },
      {
        "name": "BANNER OF MACHARIUS TRIUMPHANT",
        "description": "Imperial Knights model only. If you control an objective marker at the end of your Command phase and the bearer is within range of that objective marker, that objective marker remains under your control even if you have no models within range of it, until your opponent controls it at the start or end of any turn.",
        "keywords": ["Imperial Knights"]
      },
      {
        "name": "UNYIELDING PARAGON",
        "description": "Questoris model only. Each time an attack is allocated to the bearer, worsen the Armour Penetration characteristic of that attack by 1.",
        "keywords": ["Questoris"]
      }
    ]
  },
  {
    "faction_id": "AC",
    "enhancements": [
      {
        "name": "UNSTOPPABLE DESTROYER",
        "description": "■ Adeptus Custodes model only (excluding Anathema Psykana models). Each time the bearer ends a Charge move, select one enemy unit within Engagement Range of the bearer and roll one D6: on a 2-5, that enemy unit suffers D3 mortal wounds; on a 6, that enemy unit suffers 3 mortal wounds. ■ Once per battle, after the bearer’s unit ends a Charge move, all enemy units within 6\" of the bearer must take a Battle-shock test.",
        "keywords": ["Adeptus Custodes"],
        "exclusions": ["Anathema Psykana"]
      },
      {
        "name": "INSPIRATIONAL EXEMPLAR",
        "description": "■ Adeptus Custodes model only (excluding Anathema Psykana models). The bearer has a Leadership characteristic of 5+. ■ Once per battle, at the start of any phase, you can select one friendly Adeptus Custodes unit that is Battle-shocked and within 12\" of the bearer; that unit is no longer Battle-shocked.",
        "keywords": ["Adeptus Custodes"],
        "exclusions": ["Anathema Psykana"]
      },
      {
        "name": "VEILED BLADE",
        "description": "■ Adeptus Custodes model only (excluding Anathema Psykana models). Add 2 to the Attacks characteristic of the bearer’s melee weapons. ■ Once per battle, at the start of any Command phase, triple the bearer’s Objective Control characteristic until the end of the turn.",
        "keywords": ["Adeptus Custodes"],
        "exclusions": ["Anathema Psykana"]
      },
      {
        "name": "CEASELESS HUNTER",
        "description": "■ Adeptus Custodes model only (excluding Anathema Psykana models). The bearer’s unit is eligible to shoot and declare a charge in a turn in which it Fell Back. ■ Once per battle, when an enemy unit ends a Normal,Advance or Fall Back move within 9\" of the bearer, if the bearer’s unit is not within Engagement Range of one or more enemy units, it can make a Normal move of up to 6\".",
        "keywords": ["Adeptus Custodes"],
        "exclusions": ["Anathema Psykana"]
      }
    ]
  },
  {
    "faction_id": "AS",
    "enhancements": [
      {
        "name": "saintly example",
        "description": "Adepta Sororitas model only. When the bearer is destroyed, you gain an additional D3 Miracle dice.",
        "keywords": ["Adepta Sororitas"]
      }
    ]
  },
  {
    "faction_id": "AS",
    "enhancements": [
      {
        "name": "saintly example",
        "description": "Adepta Sororitas model only. When the bearer is destroyed, you gain an additional D3 Miracle dice.",
        "keywords": ["Adepta Sororitas"]
      },
      {
        "name": "BLADE OF SAINT ELLYNOR",
        "description": "Adepta Sororitas model only. Add 1 to the Attacks, Strength and Damage characteristics of the bearer’s  melee weapons. If the bearer has lost one or more wounds, add 2 to the Attacks, Strength and Damage characteristics of the bearer’s melee weapons instead.",
        "keywords": ["Adepta Sororitas"]
      },
      {
        "name": "LITANIES OF FAITH",
        "description": "Adepta Sororitas model only. At the end of your Command phase, if the bearer is on the battlefield, you can re-roll one Miracle dice from your Miracle dice pool and return it to your Miracle dice pool with the new result you rolled. When doing so, if the bearer has lost one or more wounds or is leading a unit that is Below Half-strength, you can re-roll up to three Miracle dice in this way instead.",
        "keywords": ["Adepta Sororitas"]
      },
      {
        "name": "MANTLE OF OPHELIA",
        "description": "Canoness or Palatine model only. Each time an attack is allocated to the bearer, change the Damage characteristic of that attack to 1.",
        "keywords": ["Canoness", ["Palatine"]]
      }
    ]
  }
]
