{
  "id": "DAUGHTERS_OF_KHAINE",
  "name": "Daughters of Khaine",
  "grandAlliance": "Order",
  "parentFaction": null,
  "isLegends": false,
  "colours": {
    "banner": "#1E5B8C",
    "header": "#2A7AB8"
  },
  "updated": "2025-12-04T20:35:09.299Z",
  "compatibleDataVersion": 363,
  "warscrolls": [
    {
      "id": "80cc8882-41c6-50ac-ac20-21c896c07fbd",
      "name": "Avatar of Khaine",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factions": ["Daughters of Khaine"],
      "keywords": ["Monster", "Ward (6+)"],
      "factionKeywords": ["Grand Alliance Order", "Daughters of Khaine"],
      "fluff": "Many of Morathi’s armies will bear a great iron avatar to battle in the image of Khaine, their ancient murder god. When enemy armies are thick and the odds of victory seem overwhelmingly bleak, Morathi’s priestesses will smother the blood of their victims over one of these massive statues, the blood magic evoked by such offerings seizing its limbs and lending it a ferocious animus. The Avatars of Khaine will stride out from their ceremonial cauldrons to fight alongside their worshippers, swinging falchions as tall as ogors. Even those foes that stay wisely out of reach are not safe: each statue can shoot great gouts of blood from its mouth so hot that they can melt flesh from bone.\n\nThe Avatars of Khaine play a pivotal role in the religion of the murder-cults as conduits of bloody prayer. Any priestess that stands near one finds their connection to Morathi-Khaine strengthened and their chants calling down dark miracles of sizzling ichor. Since Morathi ascended to godhood and claimed to be Khaine reincarnated, some avatars have been recast closer to her image. Not every priestess agrees with such a change – though to give voice to these treasonous thoughts would invite a swift and gory death.",
      "referenceKeywords": "Monster, Ward (6+), Order, Daughters of Khaine",
      "stats": {
        "move": "6\"",
        "save": "3+",
        "control": "2",
        "health": "7",
        "ward": "6+"
      },
      "points": 110,
      "modelCount": 1,
      "baseSize": "40mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Torrent of Burning Blood",
            "type": "ranged",
            "range": "10\"",
            "attacks": "6",
            "hit": "3+",
            "wound": "3+",
            "rend": "1",
            "damage": "1",
            "abilities": ["Shoot in Combat"]
          }
        ],
        "melee": [
          {
            "name": "Avatar’s Sword",
            "type": "melee",
            "range": null,
            "attacks": "5",
            "hit": "3+",
            "wound": "3+",
            "rend": "2",
            "damage": "3",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Wrath of Khaine",
          "phase": "chargePhase",
          "phaseDetails": "Once Per Turn (Army), Any Charge Phase",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Khaine’s subjects channel their faith through a bladed idol of the Murder God, allowing it to carry out acts of monstrous carnage.",
          "declare": "If this unit charged this phase, pick an enemy unit within 1\" of it to be the target.",
          "effect": "Roll a D3. On a 2+, inflict an amount of mortal damage on the target equal to the roll. If the target is a MONSTER, double the amount of mortal damage inflicted.",
          "keywords": ["Rampage"]
        }
      ],
      "notes": null
    },
    {
      "id": "7a08226c-e83e-5995-9c58-ab24d8d580c0",
      "name": "Bladewind",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factions": ["Daughters of Khaine"],
      "keywords": ["Manifestation", "Endless Spell", "Ward (6+)", "Fly"],
      "factionKeywords": ["Grand Alliance Order", "Daughters of Khaine"],
      "fluff": "When Morathi-Khaine or one of her devoted Bloodwrack Medusae are beset by foes, they will summon a whirling cloud of cursed falchions to slice their foes to ribbons. Carried through the air by a crimson tempest of blood, these gleaming swords carve a steaming path through anything in their way. These enchanted blades are summoned from Morathi’s own cauldron for the use of these spellcasters and are possessed of a hateful sentience. They are manifestations coalesced from steaming blood, and contain the life-essence of the countless slain foes that bubbles within the Máthcoir. The desecrated brew bubbles with bloodlust and hatred that, once imbued in the swords of the Bladewind, drive them to slice through armour with unnatural ease to get to the flesh and blood beneath.\n\nThese falchions are sharp enough to pierce even the thickest of iron shields. The blades carve through rock and masonry equally as effortlessly, preying on those who would seek shelter behind them and bisecting enemy after enemy until their summoner deigns to dismiss them.",
      "referenceKeywords": "Manifestation, Endless Spell, Fly, Ward (6+), Order, Daughters of Khaine",
      "stats": {
        "move": "12\"",
        "save": "6+",
        "control": "7+",
        "health": "7",
        "ward": "6+"
      },
      "points": null,
      "modelCount": 1,
      "baseSize": "50mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Bladed Vortex",
            "type": "melee",
            "range": null,
            "attacks": "9",
            "hit": "3+",
            "wound": "3+",
            "rend": "1",
            "damage": "1",
            "abilities": ["Crit (2 Hits)"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Unnatural Edge",
          "phase": "combatPhase",
          "phaseDetails": "Any Combat Phase",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The falchions carve through an enemy’s defences, and the swirling blades prevent them from getting their guard back up.",
          "declare": "If this MANIFESTATION charged this turn, pick an enemy unit in combat with it to be the target.",
          "effect": "Roll a dice. On a 3+, ignore positive modifiers to save rolls for the target for the rest of the turn."
        }
      ],
      "notes": null
    },
    {
      "id": "39bf64f7-61fa-5053-ac05-78d7a52d4eda",
      "name": "Blood Sisters",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factions": ["Daughters of Khaine"],
      "keywords": ["Champion", "Melusai", "Infantry", "Ward (6+)"],
      "factionKeywords": ["Grand Alliance Order", "Daughters of Khaine"],
      "fluff": "Blood Sisters are powerful warriors employed either as bodyguards for High Priestesses or Bloodwrack Medusae, or as a potent vanguard for the war covens. They are renowned for the particular cruelty and spite they display upon the battlefield, for they enjoy agonising their victims for prolonged periods before the killing stroke comes. Each Blood Sister is equipped with a heartshard glaive – a heavy polearm ideal for driving through armour and ribs to impale an enemy’s heart. Their kragath war-masks are crafted to recall the god of murder’s own terrible visage. Each kragath is also layered with illusory enchantments that allow the wearer to take the form of a normal aelf, should the occasion require it.\n\nBlood Sisters can channel the blackness of their tainted souls into a strike known as the scáth touch. The lightest contact from such a blow can transform the victim into an unmoving crystal statue that is still horrifically conscious. The brood nests of the Melusai are lined with these living monuments. As sensualists, the Blood Sisters consider an eternity of sensory deprivation the worst of all possible fates, hence their delight in inflicting it upon others. For a Blood Sister, the ultimate cruelty is to thrust her glaive quickly enough to slice out a foe’s beating heart while transmuting them to still-living crystal.",
      "referenceKeywords": "Infantry, Champion, Ward (6+), Order, Daughters of Khaine, Melusai",
      "stats": {
        "move": "8\"",
        "save": "5+",
        "control": "1",
        "health": "2",
        "ward": "6+"
      },
      "points": 140,
      "modelCount": 5,
      "baseSize": "40mm",
      "cannotBeReinforced": false,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Heartshard Glaive",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "3+",
            "wound": "4+",
            "rend": "1",
            "damage": "2",
            "abilities": ["Crit (Mortal)"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Crystal Touch",
          "phase": "combatPhase",
          "phaseDetails": "Any Combat Phase",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The scáth touch of a Blood Sister can permanently transmute an enemy into an immobile – though still fully conscious – crystal statue.",
          "declare": "Pick an enemy unit in combat with this unit to be the target.",
          "effect": "Roll a dice. If the roll exceeds the target’s Health characteristic, the target has STRIKE-LAST for the rest of the turn."
        }
      ],
      "notes": null
    },
    {
      "id": "ab8ed444-b5fd-5a16-8c8b-5a9d63af85d8",
      "name": "Blood Stalkers",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factions": ["Daughters of Khaine"],
      "keywords": ["Champion", "Melusai", "Infantry", "Ward (6+)"],
      "factionKeywords": ["Grand Alliance Order", "Daughters of Khaine"],
      "fluff": "The Blood Stalkers are Morathi-Khaine’s elite archers, a venomous guard who rain death from afar. Each bears a heartseeker bow that fires arrows blessed by Hag Queens and imbued with guiding enchantments. With uncanny accuracy, these missiles streak across the battlefield to pierce their targets’ hearts. In close combat, Blood Stalkers wield scianlar, long daggers that absorb the energies released when the bearer extracts vital organs from their victims.\n\nIn battle, Melusai communicate via a series of graceful gestures and empathic signals that no enemy can decipher. This allows Blood Stalkers to hunt their prey silently before launching a sudden and deadly ambush. The first their prey knows of the danger is when barbed missiles begin to rain down upon them.\n\nThe leader of a Blood Stalker pack is known as a Krone. Many employ the winged serpents known as Blood Wyrms to track their quarry. Roughly the size of a hunting hawk, they can sniff out a single drop of blood from a hundred leagues.",
      "referenceKeywords": "Infantry, Champion, Ward (6+), Order, Daughters of Khaine, Melusai",
      "stats": {
        "move": "8\"",
        "save": "5+",
        "control": "1",
        "health": "2",
        "ward": "6+"
      },
      "points": 130,
      "modelCount": 5,
      "baseSize": "40mm",
      "cannotBeReinforced": false,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Heartseeker Bow",
            "type": "ranged",
            "range": "18\"",
            "attacks": "3",
            "hit": "3+",
            "wound": "4+",
            "rend": "1",
            "damage": "1",
            "abilities": ["Crit (Auto-wound)"]
          }
        ],
        "melee": [
          {
            "name": "Scianlar",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "3+",
            "wound": "4+",
            "rend": "-",
            "damage": "1",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Heartseekers",
          "phase": "shootingPhase",
          "phaseDetails": "Your Shooting Phase",
          "icon": "shooting",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The blood-blessed arrows loosed by these Melusai unerringly seek out the enemy’s vital organs.",
          "declare": null,
          "effect": "If this unit has not used a MOVE ability this turn and was not set up this turn, this unit’s shooting attacks score critical hits on unmodified hit rolls of 5+ for the rest of the turn."
        }
      ],
      "notes": null
    },
    {
      "id": "3409b015-5bc1-549f-97ce-c7031f705d9d",
      "name": "Bloodwrack Medusa",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factions": ["Daughters of Khaine"],
      "keywords": ["Melusai", "Wizard", "Infantry", "Ward (6+)", "Hero"],
      "factionKeywords": ["Grand Alliance Order", "Daughters of Khaine"],
      "fluff": "It is considered a high honour among Khainite aelves to be selected for the Slith‑onóir. In this gory ritual, their flesh is pierced by the fangs of the hissing serpents that crown the Shadow Queen’s skull. This results in the agonising transformation of the chosen into monstrous beings blessed with a portion of Morathi’s strength and magic – the Bloodwrack Medusae.\n\nBloodwrack Medusae wield sorcerous energies, and their eyes blaze with the power of death. Any who meet a Medusa’s gaze find their body exsanguinated in a welter of gore. Neither does the sorceress shy away from combat; wielding the razor-sharp gauntlet known as a whisperclaw in concert with a Bloodwrack spear, the Medusa can cut a swathe through any foes foolish enough to approach her.\n\nThose selected for the Slith-onóir might be the rising champions of their sect, but some are chosen because they are openly contentious when it comes to Morathi- Khaine’s strictures or her claims of a divine mandate. Regardless, after the ritual, Bloodwrack Medusae become the goddess’s most faithful and loyal servants. Naturally resonant with arcane power, they eagerly absorb every scrap of magical knowledge that she grants them, including all manner of malicious spells and curses.",
      "referenceKeywords": "Hero, Wizard (1), Infantry, Ward (6+), Order, Daughters of Khaine, Melusai",
      "stats": {
        "move": "8\"",
        "save": "5+",
        "control": "2",
        "health": "6",
        "ward": "6+"
      },
      "points": 150,
      "modelCount": 1,
      "baseSize": "40mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Bloodwrack Stare",
            "type": "ranged",
            "range": "12\"",
            "attacks": "1",
            "hit": "2+",
            "wound": "*",
            "rend": "*",
            "damage": "*",
            "abilities": ["Shoot in Combat"]
          }
        ],
        "melee": [
          {
            "name": "Bloodwrack Spear and Whisperclaw",
            "type": "melee",
            "range": null,
            "attacks": "5",
            "hit": "3+",
            "wound": "4+",
            "rend": "1",
            "damage": "2",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Melusai Kin",
          "phase": "combatPhase",
          "phaseDetails": "Reaction: You declared a FIGHT ability for this unit",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": true,
          "lore": "A Bloodwrack Medusa leads her Melusai kin into battle, encouraging them to follow her example and strike down the enemy with brutal swiftness.",
          "declare": null,
          "effect": "Pick a friendly non-HERO MELUSAI unit that has not used a FIGHT ability this turn and is within this unit’s combat range to be the target. The target can be picked to use a FIGHT ability immediately after the FIGHT ability used by this unit has been resolved."
        },
        {
          "name": "Bloodwrack Stare",
          "phase": "shootingPhase",
          "phaseDetails": "Passive",
          "icon": "shooting",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Should a victim’s eyes lock with a Bloodwrack Medusa’s stare for even a second, their lifeblood will violently rebel, flooding from every pore until their body collapses into a pool of gore.",
          "declare": null,
          "effect": "Each time this unit attacks with its Bloodwrack Stare, if the attack scores a hit, roll a number of dice equal to the number of models in the target unit. For each 5+, inflict 1 mortal damage on that unit. You cannot pick the same enemy unit to be targeted by attacks made with a Bloodwrack Stare more than once per phase."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "linkedWarscroll": null
        },
        {
          "points": null,
          "requiredKeywords": ["Khinerai"],
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        },
        {
          "points": null,
          "requiredKeywords": ["Melusai"],
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "673cc7d2-b70d-5b4a-a06e-8c8eea675346",
      "name": "Bloodwrack Shrine",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factions": ["Daughters of Khaine"],
      "keywords": ["Melusai", "War Machine", "Wizard", "Ward (6+)", "Hero"],
      "factionKeywords": ["Grand Alliance Order", "Daughters of Khaine"],
      "fluff": "Honoured are the Khainites chosen to be ritualistically transformed into a Bloodwrack Medusa. These writhing sorceresses have an affinity for the arcane and their eyes blaze with the power of death. Any who meet a Medusa’s gaze find their body exsanguinated in a welter of gore. Neither does this servant of Morathi shy away from combat; wielding the razor-sharp gauntlet known as a whisperclaw in concert with a Bloodwrack spear, the Medusa can cut a swathe through any foes foolish enough to approach her.\n\nSome Bloodwrack Medusae are borne into battle atop mobile shrines. Propelled by unseen magics, the bladed Bloodwrack Shrine grinds forward to crash into the enemy battleline. Two shrineguards armed with long goadstaves strike out, while the writhing Medusa uses her weapons and deadly gaze to join the slaughter. As formidable as the shrine is in close combat, it has another, more sinister purpose. A strange mirror known as a scáthmre stands at the shrine’s centre, reflecting not just the Bloodwrack Medusa’s deadly gaze but also an agonising aura, a shadowy projection of the scathing hatred harboured by the monstrous serpentine creature. Such is the power of this dark emanation that it causes nearby foes to perish in the throes of unbearable torment.",
      "referenceKeywords": "Hero, War Machine, Wizard (1), Ward (6+), Order, Daughters of Khaine, Melusai",
      "stats": {
        "move": "6\"",
        "save": "4+",
        "control": "5",
        "health": "12",
        "ward": "6+"
      },
      "points": 200,
      "modelCount": 1,
      "baseSize": "120 x 92mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Bloodwrack Stare",
            "type": "ranged",
            "range": "12\"",
            "attacks": "1",
            "hit": "2+",
            "wound": "*",
            "rend": "*",
            "damage": "*",
            "abilities": ["Shoot in Combat"]
          }
        ],
        "melee": [
          {
            "name": "Bloodwrack Spear and Whisperclaw",
            "type": "melee",
            "range": null,
            "attacks": "5",
            "hit": "3+",
            "wound": "4+",
            "rend": "1",
            "damage": "2",
            "abilities": []
          },
          {
            "name": "Shrinekeepers’ Goadstaves",
            "type": "melee",
            "range": null,
            "attacks": "6",
            "hit": "3+",
            "wound": "4+",
            "rend": "-",
            "damage": "1",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Bladed Impact",
          "phase": "chargePhase",
          "phaseDetails": "Any Charge Phase",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The bladed carriage of a Bloodwrack Shrine can cleave its way through enemy ranks with ease.",
          "declare": "If this unit charged this phase, pick an enemy unit within 1\" of it to be the target.",
          "effect": "Roll a D3. On a 2+, inflict an amount of mortal damage on the target equal to the roll."
        },
        {
          "name": "Aura of Agony",
          "phase": "heroPhase",
          "phaseDetails": "Your Hero Phase",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Bloodwrack Shrines emit an aura that causes waves of agony to course through the enemy.",
          "declare": "Pick up to 3 different enemy units within 9\" of this unit to be the targets.",
          "effect": "Roll a D3 for each target. On a 2+, inflict an amount of mortal damage on the target equal to the roll."
        },
        {
          "name": "Bloodwrack Stare",
          "phase": "shootingPhase",
          "phaseDetails": "Passive",
          "icon": "shooting",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Should a victim’s eyes lock with a Bloodwrack Medusa’s stare for even a second, their lifeblood will violently rebel, flooding from every pore until their body collapses into a pool of gore.",
          "declare": null,
          "effect": "Each time this unit attacks with its Bloodwrack Stare, if the attack scores a hit, roll a number of dice equal to the number of models in the target unit. For each 5+, inflict 1 mortal damage on that unit. You cannot pick the same enemy unit to be targeted by attacks made with a Bloodwrack Stare more than once per phase."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "requiredKeywords": ["Coven Matriarch"],
          "linkedWarscroll": null
        },
        {
          "points": null,
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "c429f2cc-5177-5711-84fb-68f2d6ee63a3",
      "name": "Bloodwrack Viper",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factions": ["Daughters of Khaine"],
      "keywords": ["Monster", "Manifestation", "Endless Spell", "Ward (6+)"],
      "factionKeywords": ["Grand Alliance Order", "Daughters of Khaine"],
      "fluff": "In times of great need, Morathi-Khaine and her mages will tip the venom of the Shadow Queen into their Cauldron of Blood. It is from this toxic slurry that the Bloodwrack Viper emerges. This enormous serpent is formed from boiling blood and contains a sliver of Morathi’s arcane might, and it is animated by a deeply rooted shard of her malice.\n\nThe Bloodwrack Viper is a magical manifestation of hatred and bitterness. With but a whispered word from its summoner, it will go on a ferocious rampage, killing all in its path. It binds its prey in a crushing embrace, burning mortal skin away with the heat of its ichorous body before squeezing so forcefully that the victim explodes in a shower of gore. Should an enemy be too large to simply splatter open, the serpent curls around them and tightens its coils, holding its prey in place and choking them in torrents of sticky black blood. With its victim immobilised, it will then strike with its monstrous fangs.",
      "referenceKeywords": "Monster, Manifestation, Endless Spell, Ward (6+), Order, Daughters of Khaine",
      "stats": {
        "move": "9\"",
        "save": "4+",
        "control": "7+",
        "health": "10",
        "ward": "6+"
      },
      "points": null,
      "modelCount": 1,
      "baseSize": "100mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Fanged Strikes",
            "type": "melee",
            "range": null,
            "attacks": "3",
            "hit": "4+",
            "wound": "2+",
            "rend": "1",
            "damage": "3",
            "abilities": ["Anti-HERO (+1 Rend)", "Crit (Mortal)"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Crushing Coils",
          "phase": "combatPhase",
          "phaseDetails": "Once Per Turn (Army), Any Combat Phase",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The coils of the Bloodwrack Viper circle around an enemy hero, pinning them in place.",
          "declare": "Pick an enemy INFANTRY HERO in combat with this MANIFESTATION to be the target.",
          "effect": "Roll a dice. On a 3+, the target has STRIKE-LAST for the rest of the turn.",
          "keywords": ["Rampage"]
        }
      ],
      "notes": null
    },
    {
      "id": "5ab5c9cb-a482-5b99-877e-67aa2681c441",
      "name": "Doomfire Warlocks",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factions": ["Daughters of Khaine"],
      "keywords": ["Champion", "Aelf", "Wizard", "Ward (6+)", "Cavalry"],
      "factionKeywords": [
        "Grand Alliance Order",
        "Daughters of Khaine",
        "The Croneseer’s Pariahs"
      ],
      "fluff": "The Doomfire Warlocks are the light cavalry of the war covens. They harass foes with blasts of arcane flame and volleys of black-fletched bolts, harrying the enemy’s flanks and slaying unprotected targets. As the main Khainite formations are engaged, these swift riders charge in, scimitars drawn, to help overwhelm and finish off their distracted victims. Up close, Doomfire Warlocks are gaunt and pallid, their black eyes full of spite. Emblazoned upon their brows are hateful runes that cause them great pain but are also vital in keeping them alive.\n\nThere are few male aelves in the cities of the Daughters of Khaine – fewer still within the war covens. This is by nefarious design. Only the weakest souls retrieved from Slaanesh are used to create male aelves, and all are worked hard, fed poorly and drained of blood in daily rituals. Doomfire Warlocks are at least given a measure of false autonomy, allowing them to ride to battle and wield dark arcane power. However, their dhaimkhyr – the sacred rune that grants Warlocks their magic – keeps them bound to Morathi’s will, and she will also use this connection to siphon off portions of their soul to keep them withered and subservient.",
      "referenceKeywords": "Wizard (1), Cavalry, Champion, Ward (6+), Order, Daughters of Khaine, Aelf",
      "stats": {
        "move": "14\"",
        "save": "5+",
        "control": "1",
        "health": "3",
        "ward": "6+"
      },
      "points": 150,
      "modelCount": 5,
      "baseSize": "60 x 35mm",
      "cannotBeReinforced": false,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Doomfire Crossbow",
            "type": "ranged",
            "range": "10\"",
            "attacks": "2",
            "hit": "3+",
            "wound": "4+",
            "rend": "-",
            "damage": "1",
            "abilities": []
          }
        ],
        "melee": [
          {
            "name": "Cursed Scimitar",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "3+",
            "wound": "4+",
            "rend": "1",
            "damage": "1",
            "abilities": []
          },
          {
            "name": "Dark Steed’s Vicious Bite",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "5+",
            "wound": "3+",
            "rend": "-",
            "damage": "1",
            "abilities": ["Companion"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Outmanoeuvre",
          "phase": "movementPhase",
          "phaseDetails": "Passive",
          "icon": "movement",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Doomfire Warlocks are the light cavalry of the war covens, worrying the enemy’s flanks and engaging unprotected targets.",
          "declare": null,
          "effect": "When this unit uses the ‘Redeploy’ command, if you roll a 1-3 when determining the distance this unit can move, you can use a value of 4 instead."
        }
      ],
      "notes": null
    },
    {
      "id": "6b577f38-62b1-5be5-ace2-e63910315c0a",
      "name": "Gryselle’s Arenai",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factions": ["Daughters of Khaine"],
      "keywords": ["Champion", "Aelf", "Unique", "Infantry", "Ward (6+)"],
      "factionKeywords": [
        "Grand Alliance Order",
        "Daughters of Khaine",
        "The Croneseer’s Pariahs"
      ],
      "fluff": "Gryselle’s Arenai are expert gladiators from the fighting pits of Har Kuron. Each is highly skilled at dispatching numerous enemies in a blur of flashing weapons. The Arenai are each a veteran of countless duels to the death, but they are also peerless performers, their acrobatic leaps and dazzling flourishes making every act of carnage a prayer to their bloody god.",
      "referenceKeywords": "Unique, Infantry, Champion, Ward (6+), Order, Daughters of Khaine, Aelf",
      "stats": {
        "move": "6\"",
        "save": "6+",
        "control": "1",
        "health": "2",
        "ward": "6+"
      },
      "points": 70,
      "modelCount": 5,
      "baseSize": "32mm [1], 28.5mm [4]",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Gladiatorial Weapons",
            "type": "melee",
            "range": null,
            "attacks": "3",
            "hit": "3+",
            "wound": "4+",
            "rend": "-",
            "damage": "1",
            "abilities": ["Crit (Auto-wound)"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Acrobatic Bloodshed",
          "phase": "combatPhase",
          "phaseDetails": "Any Combat Phase",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "As they flip and twist across the battlefield, the Arenai sever arteries and slash exposed throats, leaving any enemies left alive completely disorientated.",
          "declare": "Pick an enemy unit in combat with this unit to be the target.",
          "effect": "For the rest of the turn, while this unit is in combat with the target, its combat attacks must target that enemy unit. In addition, if any of this unit’s attacks score a critical hit on the target this phase, the target has STRIKE-LAST for the rest of the turn."
        }
      ],
      "notes": null
    },
    {
      "id": "5b3b36bb-4bb5-5729-813c-93f0749d2895",
      "name": "Hag Queen",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factions": ["Daughters of Khaine"],
      "keywords": ["Aelf", "Priest", "Infantry", "Ward (6+)", "Hero"],
      "factionKeywords": [
        "Grand Alliance Order",
        "Daughters of Khaine",
        "The Croneseer’s Pariahs"
      ],
      "fluff": "The High Priestesses known as Hag Queens are the guardians of Khaine’s mysteries and the leaders of their temple’s rites. Through Morathi’s teachings, the Hag Queens learn secret rituals, words of power and divine incantations that allow Khaine’s energies to flow like blood from a severed artery. It is the Hag Queens who are responsible for concocting the potion that drives their fellow Khainites into a rapturous battle-rage.\n\nKnown as witchbrew, this sacred concoction is derived from the blood of Slaughter Queens slain in the service of Khaine. Resonant with the fierce exultation that the deceased experienced in their final moments, this holy liquid is refined and blended through a sorcerous process known only to the High Priestesses. The resulting broth has the viscous consistency of clotting blood, and a single draught heightens the senses to supernatural levels, imbuing the drinker with an uncontrollable bloodlust and robbing them of any sense of self preservation. Khainites under the influence of witchbrew will ignore even the most horrific wounds as they carve their foes apart. Hag Queens, of course, do not simply observe their workings from afar; when their sacred duties have been performed, they join the killing as mercilessly as any of their kin.",
      "referenceKeywords": "Hero, Priest (1), Infantry, Ward (6+), Order, Daughters of Khaine, Aelf",
      "stats": {
        "move": "6\"",
        "save": "5+",
        "control": "2",
        "health": "5",
        "ward": "6+"
      },
      "points": 140,
      "modelCount": 1,
      "baseSize": "25mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Blade of Khaine",
            "type": "melee",
            "range": null,
            "attacks": "4",
            "hit": "3+",
            "wound": "4+",
            "rend": "1",
            "damage": "2",
            "abilities": ["Crit (Mortal)"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Witchbrew",
          "phase": "heroPhase",
          "phaseDetails": "Once Per Turn (Army), Any Hero Phase",
          "icon": "defensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Witchbrew drives the imbiber into such an ecstasy of destruction that they will fight on in the face of impossible odds.",
          "declare": "Pick a friendly DAUGHTERS OF KHAINE unit wholly within 12\" of this unit to be the target.",
          "effect": "Roll a dice. On a 3+, the target has WARD (5+) for the rest of the turn."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "requiredKeywords": ["Coven Matriarch"],
          "linkedWarscroll": null
        },
        {
          "points": null,
          "linkedWarscroll": null
        },
        {
          "points": null,
          "requiredKeywords": ["Aelf"],
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "6dc84119-0cbc-585a-9b66-e502d877d60f",
      "name": "Hag Queen on Cauldron of Blood",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factions": ["Daughters of Khaine"],
      "keywords": [
        "Aelf",
        "War Machine",
        "Priest",
        "Cauldron of Blood",
        "Ward (6+)",
        "Hero"
      ],
      "factionKeywords": [
        "Grand Alliance Order",
        "Daughters of Khaine",
        "The Croneseer’s Pariahs"
      ],
      "fluff": "For a battle worthy of their finest ritual offerings, the war covens of the Daughters of Khaine bring forth the greatest of their religion’s icons – the Cauldrons of Blood. Mounted on iron-shod wheels, these arcane devices surge forward, propelled solely by the incantations of their riders, as if the machine itself was lured onwards by the promise of carnage. Each is connected to Morathi’s own cauldron, which drains a portion of each sacrifice poured inside.\n\nWhen a Hag Queen accompanies the altar, she brings the blood within the iron vat to a furious boil until it gives off billowing clouds of crimson steam. This offers strange protections, and Khainites nearby find themselves able to shrug off wounds or dodge blows more easily. Those fortunate enough to be offered a draught of the cauldron’s brew find themselves plunged into an ecstasy of violence, their martial prowess magnified by the Lord of Murder.\n\nBrought to life by blood rituals, the iron statue of Khaine upon the shrine roars its anger in torrents of molten metal blood or swings its massive sword to hack down those who dare close with the cauldron.",
      "referenceKeywords": "Hero, Priest (1), War Machine, Ward (6+), Order, Daughters of Khaine, Aelf, Cauldron of Blood",
      "stats": {
        "move": "6\"",
        "save": "4+",
        "control": "5",
        "health": "12",
        "ward": "6+"
      },
      "points": 330,
      "modelCount": 1,
      "baseSize": "120 x 92mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Torrent of Burning Blood",
            "type": "ranged",
            "range": "10\"",
            "attacks": "6",
            "hit": "3+",
            "wound": "3+",
            "rend": "1",
            "damage": "1",
            "abilities": ["Shoot in Combat"]
          }
        ],
        "melee": [
          {
            "name": "Blade of Khaine",
            "type": "melee",
            "range": null,
            "attacks": "4",
            "hit": "3+",
            "wound": "4+",
            "rend": "1",
            "damage": "2",
            "abilities": ["Crit (Mortal)"]
          },
          {
            "name": "Avatar’s Sword",
            "type": "melee",
            "range": null,
            "attacks": "5",
            "hit": "3+",
            "wound": "3+",
            "rend": "2",
            "damage": "3",
            "abilities": []
          },
          {
            "name": "Witch Aelves’ Sciansá",
            "type": "melee",
            "range": null,
            "attacks": "6",
            "hit": "3+",
            "wound": "4+",
            "rend": "-",
            "damage": "1",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Witchbrew",
          "phase": "heroPhase",
          "phaseDetails": "Once Per Turn (Army), Any Hero Phase",
          "icon": "defensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Witchbrew drives the imbiber into such an ecstasy of destruction that they will fight on in the face of impossible odds.",
          "declare": "Pick a friendly DAUGHTERS OF KHAINE unit wholly within 12\" of this unit to be the target.",
          "effect": "Roll a dice. On a 3+, the target has WARD (5+) for the rest of the turn."
        },
        {
          "name": "Bladed Impact",
          "phase": "chargePhase",
          "phaseDetails": "Any Charge Phase",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The bladed carriage hauling a Cauldron of Blood can cleave its way through enemy ranks with ease.",
          "declare": "If this unit charged this phase, pick an enemy unit within 1\" of it to be the target.",
          "effect": "Roll a D3. On a 2+, inflict an amount of mortal damage on the target equal to the roll."
        },
        {
          "name": "Altar of Khaine",
          "phase": "startOfTurn",
          "phaseDetails": "Passive",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The powerful magic that fuels the Cauldron of Blood grants empowerment and protection to those nearby.",
          "declare": null,
          "effect": "Add 1 to save rolls for friendly DAUGHTERS OF KHAINE INFANTRY units while they are wholly within 9\" of this unit.\nIn addition, add 1 to chanting rolls for friendly DAUGHTERS OF KHAINE PRIESTS while they are wholly within 9\" of this unit."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "requiredKeywords": ["Coven Matriarch"],
          "linkedWarscroll": null
        },
        {
          "points": null,
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "c779798c-bafb-55f0-b68e-c2a3a96000af",
      "name": "Heart of Fury",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factions": ["Daughters of Khaine"],
      "keywords": ["Manifestation", "Invocation", "Ward (6+)"],
      "factionKeywords": ["Grand Alliance Order", "Daughters of Khaine"],
      "fluff": "Many Khainite battle prayers gain their strength from Morathi’s own divine essence, but the ruler of Hagg Nar has also granted her most trusted sorcerers the knowledge to cast new and terrible arcane conjurations of her own devising. Invoked by incantation and sacrifice, the blazing manifestation known as a Heart of Fury has appeared in the skies above many a Khainite war coven, stirring all who look upon it into a delirious frenzy that allows them to shrug off the gravest injuries. The enemies of Hagg Nar have learnt to dread this omen, for it heralds terrible bloodshed. As the heat of battle swells to a burning frenzy, the most devout of Khaine’s priestesses can draw upon Morathi-Khaine’s own power. When these gore-streaked zealots scream a prayer that is as much a war cry as a call of worship, a manifestation of the Heart of Fury crystallises in the firmament in a crimson miasma.\n\nThis blood-dripping icon burns with supernatural rage. It is held aloft by an iron glove above the battlefield, bathing all those below in its wrathful aura. Those Daughters of Khaine so empowered by its light are sent into a frenzy of murder, continuing to fight and kill even when stricken with mortal wounds.",
      "referenceKeywords": "Manifestation, Invocation, Ward (6+), Order, Daughters of Khaine",
      "stats": {
        "move": "-",
        "save": "4+",
        "control": "7+",
        "health": "7",
        "ward": "6+"
      },
      "points": null,
      "modelCount": 1,
      "baseSize": "50mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {},
      "abilities": [
        {
          "name": "Locus of the Murder God",
          "phase": "defensive",
          "phaseDetails": "Passive",
          "icon": "defensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "This prayer takes the form of Khaine’s undying power and bestows death-defying energies upon his faithful.",
          "declare": null,
          "effect": "Subtract 1 from wound rolls for combat attacks that target friendly DAUGHTERS OF KHAINE INFANTRY units while they are wholly within 12\" of this MANIFESTATION."
        }
      ],
      "notes": null
    },
    {
      "id": "ed766e25-d67f-5f64-bb3d-f1e89be62172",
      "name": "High Gladiatrix",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factions": ["Daughters of Khaine"],
      "keywords": ["Coven Matriarch", "Aelf", "Infantry", "Ward (6+)", "Hero"],
      "factionKeywords": [
        "Grand Alliance Order",
        "Daughters of Khaine",
        "The Croneseer’s Pariahs"
      ],
      "fluff": "Those aelves that become High Gladiatrixes are not merely promoted but instead undergo a bloody apotheosis within the gladiatorial arena. They are marked by their ability to overcome ever more perilous contests of arms – and with brutal, exhilarating flair. At the beginning of a night’s death-games, they may fight a single snarling Frost Sabre, but such will soon be followed by a mob of captive orruks and a duo of rampaging Stegadons. They are their deity’s will made manifest, incarnated in each dazzling display of slaughter.\n\nThough High Gladiatrixes hold no formal position amongst the war covens, few of Morathi’s generals would deny their aid. They are one woman armies, wielding serpentine whips and blades to eviscerate their foes with a contemptuous flick of the wrist. Bands of Witch Aelves and Sisters of Slaughter flock to a High Gladiatrix’s presence, fighting with such fervour that it is said they would follow their idols into the Realm of Chaos itself. The crimson blessings that radiate from the High Gladiatrix intensify with each successive act of carnage until the battlefield is awash with gore.",
      "referenceKeywords": "Hero, Infantry, Ward (6+), Order, Daughters of Khaine, Aelf",
      "stats": {
        "move": "6\"",
        "save": "5+",
        "control": "2",
        "health": "5",
        "ward": "6+"
      },
      "points": 100,
      "modelCount": 1,
      "baseSize": "32mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Barbed Whip and Gladiatrix’s Blade",
            "type": "melee",
            "range": null,
            "attacks": "6",
            "hit": "3+",
            "wound": "4+",
            "rend": "1",
            "damage": "2",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Paragon of Slaughter",
          "phase": "combatPhase",
          "phaseDetails": "Any Combat Phase",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The spectacular acts of death-dealing performed by a High Gladiatrix inspire nearby Daughters of Khaine, setting their souls aflame with the power of the Bloody-Handed God.",
          "declare": "If this unit is in combat, pick a visible friendly DAUGHTERS OF KHAINE AELF non-HERO INFANTRY unit wholly within 12\" of this unit to be the target.",
          "effect": "Roll a dice. On a 2+, add 1 to the Rend characteristic of melee weapons used by the target for the rest of the turn."
        },
        {
          "name": "Killing Stroke",
          "phase": "combatPhase",
          "phaseDetails": "Once Per Battle, Any Combat Phase",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "A High Gladiatrix prides herself on slaying enemies with magnificently gory flourishes, killing them with a brutal whip motion or single precise stroke from her blade.",
          "declare": "Pick an enemy HERO in combat with this unit to be the target.",
          "effect": "Roll 2D6. If the roll exceeds the target’s Health characteristic, it is automatically destroyed."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "linkedWarscroll": null
        },
        {
          "points": null,
          "requiredKeywords": ["Aelf"],
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "f4e81a65-3996-5e79-9323-61a704707c97",
      "name": "Khainite Shadowstalkers",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factions": ["Daughters of Khaine"],
      "keywords": ["Champion", "Aelf", "Infantry", "Ward (6+)"],
      "factionKeywords": [
        "Grand Alliance Order",
        "Daughters of Khaine",
        "The Croneseer’s Pariahs"
      ],
      "fluff": "Whenever Morathi-Khaine desires a target discreetly slain, she sends forth her hand-picked agents – the Khainite Shadowstalkers. Each is branded with the mircath, or shademark, woven from Ulguan sorcery that grants supernatural abilities yet leashes the bearer’s soul to Morathi’s service. Able to leap from shadow to shadow and weave tools of murder from darkness, no quarry is safe.\n\nShadowstalkers can transport themselves across vast distances by slipping through the Umbral Web, an intricate pattern of shadowy realmgates that connect the Eight Realms. Some forge pacts with shadow daemons, so thoroughly mingling their blood with these monsters that, if cut, they bleed pure darkness. Using foul sorceries, they can even command a victim’s shadow into murderous animation.\n\nThough their talents are unrivalled, all Shadowstalkers are condemned to a terrible fate: the Umbral Web gradually erodes their soul until they transform into a living shadow. Morathi conceals this horrifying truth from those upon whom she bestows the mircath. Often, these unfortunates are those whom the goddess has marked out as potential dissidents. As Shadowstalkers, they can at least serve her well before they meet their end.",
      "referenceKeywords": "Infantry, Champion (1/9), Ward (6+), Order, Daughters of Khaine, Aelf",
      "stats": {
        "move": "6\"",
        "save": "5+",
        "control": "1",
        "health": "1",
        "ward": "6+"
      },
      "points": 120,
      "modelCount": 9,
      "baseSize": "40mm [1], 28.5mm [8]",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Cursed Missiles",
            "type": "ranged",
            "range": "10\"",
            "attacks": "1",
            "hit": "3+",
            "wound": "3+",
            "rend": "1",
            "damage": "1",
            "abilities": []
          }
        ],
        "melee": [
          {
            "name": "Shadowstalker Blades",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "3+",
            "wound": "4+",
            "rend": "-",
            "damage": "1",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Shadow Leap",
          "phase": "movementPhase",
          "phaseDetails": "Your Movement Phase",
          "icon": "movement",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Shadowstalkers can vanish and reappear at will as they navigate the Umbral Web.",
          "declare": null,
          "effect": "Remove this unit from the battlefield and set it up again on the battlefield more than 9\" from all enemy units.",
          "keywords": ["Core"]
        }
      ],
      "notes": null
    },
    {
      "id": "4b6e9743-a8ae-5196-a33d-f702d1c580d6",
      "name": "Khinerai Heartrenders",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factions": ["Daughters of Khaine"],
      "keywords": ["Champion", "Khinerai", "Infantry", "Ward (6+)", "Fly"],
      "factionKeywords": ["Grand Alliance Order", "Daughters of Khaine"],
      "fluff": "The Khinerai Heartrenders sweep out of the skies, dark streaks that cut swiftly through low clouds. With streams of vapour still clinging to their bodies, they use their momentum to launch cruelly barbed javelins with great force. These missiles travel with such velocity that they can skewer both a mounted warrior and their steed and still embed themselves deep into the ground. The Heartrenders do not stop to watch the gory aftermath of their arrival. Always do they seek new prey, their powerful wings carrying them to another part of the battlefield in moments, javelins materialising out of the mists into their hands. Should a tempting enough target present itself, the Heartrenders will forego their missile assault and dive straight into combat – their spiked shortspears are perfectly weighted for hand-to-hand fighting, and they can swiftly retreat should the enemy bring overpowering numbers.\n\nHeartrenders conceal their faces behind gilded masks, never revealing their true appearance even to their fellow Khainites. Some say that their faces are horrifically deformed and avian, possessing none of the statuesque beauty that the aelves prize. Perhaps this might account for their bloodthirsty nature and the cruel delight with which they pursue and slaughter retreating foes.",
      "referenceKeywords": "Infantry, Champion, Fly, Ward (6+), Order, Daughters of Khaine, Khinerai",
      "stats": {
        "move": "12\"",
        "save": "5+",
        "control": "1",
        "health": "2",
        "ward": "6+"
      },
      "points": 100,
      "modelCount": 5,
      "baseSize": "40mm",
      "cannotBeReinforced": false,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Barbed Javelin",
            "type": "ranged",
            "range": "12\"",
            "attacks": "2",
            "hit": "3+",
            "wound": "4+",
            "rend": "1",
            "damage": "1",
            "abilities": ["Crit (Auto-wound)"]
          }
        ],
        "melee": [
          {
            "name": "Barbed Javelin",
            "type": "melee",
            "range": null,
            "attacks": "1",
            "hit": "3+",
            "wound": "4+",
            "rend": "-",
            "damage": "1",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Death From Above",
          "phase": "movementPhase",
          "phaseDetails": "Your Movement Phase",
          "icon": "movement",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The Khinerai delight in using their leathery wings to descend upon the foe from unexpected vectors.",
          "declare": "Pick this unit if it is in the skies.",
          "effect": "Set up this unit anywhere on the battlefield more than 9\" from all enemy units."
        },
        {
          "name": "Fire and Flight",
          "phase": "shootingPhase",
          "phaseDetails": "Any Shooting Phase",
          "icon": "movement",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Heartrenders are masters of the hit-and-run strike, loosing volleys of sharpened projectiles before darting away.",
          "declare": null,
          "effect": "If this unit used a SHOOT ability this phase, this unit can move D6\". It cannot move into combat during any part of that move."
        },
        {
          "name": "Circling in the Skies Above",
          "phase": "startOfTurn",
          "phaseDetails": "Deployment Phase",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The Khinerai circle high above the battlefield, waiting for the perfect moment to strike.",
          "declare": "Pick this unit if it has not been deployed.",
          "effect": "Set up this unit in reserve in the skies. It has now been deployed.",
          "keywords": ["Deploy"]
        }
      ],
      "notes": null
    },
    {
      "id": "cb0f8be8-7768-5fe1-b52c-71fc48656e2f",
      "name": "Khinerai Lifetakers",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factions": ["Daughters of Khaine"],
      "keywords": ["Champion", "Khinerai", "Infantry", "Ward (6+)", "Fly"],
      "factionKeywords": ["Grand Alliance Order", "Daughters of Khaine"],
      "fluff": "The Khinerai known as Lifetakers are swift-attack specialists and elite ambushers who serve to deliver aerial sneak attacks that blindside the enemy from above. Tucking their wings close, they plummet downwards at high speed. At the last moment, they spread their leathery pinions, halting their descent as they swing their sickleblades with maximum force to scythe down foes. Forged from priceless shadow-metal, these weapons are designed to slice open throats and remove heads with a single blow.\n\nEven as nearby enemies rally to pin the Khinerai Lifetakers in combat, the Khainites rise above the melee in a flurry of beating wings, looking for the next vulnerable targets to strike. Somewhat less frenzied in their ferocity than their Heartrender kin, Lifetakers possess an uncanny ability to read the battlefield. They respond with fearsome speed to enemy breakthroughs or apparent weaknesses in the enemy line, striking home in a spray of viscera.",
      "referenceKeywords": "Infantry, Champion, Fly, Ward (6+), Order, Daughters of Khaine, Khinerai",
      "stats": {
        "move": "12\"",
        "save": "5+",
        "control": "1",
        "health": "2",
        "ward": "6+"
      },
      "points": 100,
      "modelCount": 5,
      "baseSize": "40mm",
      "cannotBeReinforced": false,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Barbed Sickle",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "3+",
            "wound": "4+",
            "rend": "1",
            "damage": "1",
            "abilities": ["Crit (Auto-wound)"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Death From Above",
          "phase": "movementPhase",
          "phaseDetails": "Your Movement Phase",
          "icon": "movement",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The Khinerai delight in using their leathery wings to descend upon the foe from unexpected vectors.",
          "declare": "Pick this unit if it is in the skies.",
          "effect": "Set up this unit anywhere on the battlefield more than 9\" from all enemy units."
        },
        {
          "name": "Fight and Flight",
          "phase": "combatPhase",
          "phaseDetails": "Reaction: You declared a FIGHT ability for this unit",
          "icon": "movement",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": true,
          "lore": "The cults of the Khinerai are masters of the hit-and run strike.",
          "declare": null,
          "effect": "After resolving the effect of that FIGHT ability, this unit can immediately move D6\". It cannot end that move in combat with any units that it was not already in combat with at the start of the move."
        },
        {
          "name": "Circling in the Skies Above",
          "phase": "startOfTurn",
          "phaseDetails": "Deployment Phase",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The Khinerai circle high above the battlefield, waiting for the perfect moment to strike.",
          "declare": "Pick this unit if it has not been deployed.",
          "effect": "Set up this unit in reserve in the skies. It has now been deployed.",
          "keywords": ["Deploy"]
        }
      ],
      "notes": null
    },
    {
      "id": "1733409e-37c5-5077-9db8-50ae03f24e4f",
      "name": "Knives of the Crone",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factions": ["Daughters of Khaine"],
      "keywords": ["Aelf", "Unique", "Infantry", "Ward (6+)"],
      "factionKeywords": [
        "Grand Alliance Order",
        "Daughters of Khaine",
        "The Croneseer’s Pariahs"
      ],
      "fluff": "Fanatical believers in the creed of the prophetic goddess Morai-Heg, the Knives of the Crone exist to serve fate’s will. They are led by the seer Kaerna Vix, who reads the viscera of slain foes to glean her deity’s desires. A cadre of killers ensure Vix’s visions come to pass: Tazari is Kaerna’s strong right hand, while Krieta eagerly butchers those who draw her master’s gaze. Finally, the arbalist Azphel stands ready to put a crossbow bolt through distant foes.",
      "referenceKeywords": "Unique, Infantry, Ward (6+), Order, Daughters of Khaine, Aelf",
      "stats": {
        "move": "6\"",
        "save": "5+",
        "control": "2",
        "health": "3",
        "ward": "6+"
      },
      "points": 220,
      "modelCount": 4,
      "baseSize": "28.5mm [3], 32mm [1]",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Aelven Crossbow",
            "type": "ranged",
            "range": "10\"",
            "attacks": "3",
            "hit": "3+",
            "wound": "4+",
            "rend": "-",
            "damage": "1",
            "abilities": ["Crit (Auto-wound)"]
          }
        ],
        "melee": [
          {
            "name": "Haruspicy Blades",
            "type": "melee",
            "range": null,
            "attacks": "3",
            "hit": "3+",
            "wound": "4+",
            "rend": "1",
            "damage": "D3",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Rituals of Prophecy",
          "phase": "heroPhase",
          "phaseDetails": "Your Hero Phase",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Though blind, the Crone Goddess Morai-Heg sees all. Gifted with a fragment of her oracular powers, the Knives of the Crone are able to navigate the vagaries of battle with uncanny perspicuity by reading fate in the spilled entrails of their foes.",
          "declare": null,
          "effect": "Roll 6 dice:\n\n• For each 1, add 1 to the Attacks characteristic of this unit’s melee weapons until the start of your next turn.\n• For each 3, add 1\" to this unit’s Move characteristic until the start of your next turn.\n• If any of the rolls are a 6, add 1 to save rolls for this unit until the start of your next turn."
        }
      ],
      "notes": null
    },
    {
      "id": "c9a63336-aa5d-559b-8f01-99d400044994",
      "name": "Krethusa the Croneseer",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factions": ["Daughters of Khaine"],
      "keywords": [
        "Aelf",
        "Priest",
        "Unique",
        "Infantry",
        "Ward (6+)",
        "Fly",
        "Hero"
      ],
      "factionKeywords": [
        "Grand Alliance Order",
        "Daughters of Khaine",
        "The Croneseer’s Pariahs"
      ],
      "fluff": "Descending upon pinions of pure darkness, Krethusa is a herald of imminent doom. By peering into the spilt blood and scorched bones of her foes, Krethusa can read the tides of battle. She darts and dives alongside the bubbling Cauldrons of Blood, weaving prophecies and chanting dark prayers.\n\nKrethusa’s supernatural foresight and gift of flight are said to come not from Morathi-Khaine but from a source far darker and more ancient: Morai-Heg, an aelven deity of death and fate that perished in a time long forgotten at the hands of Slaanesh. Upon the advent of Morathi’s ascension, a shard of Morai-Heg’s divinity escaped from the Dark Prince’s gullet to pierce through Krethusa’s very soul, causing ink-black feathers to erupt from her back. Though she is a serious threat to Morathi’s power, the goddess has found herself forced to keep her alive; Krethusa has the trust of Sigmar’s people, to say nothing of a growing retinue of loyal followers who now view Morathi with doubt and suspicion.\n\nBy plucking a feather from her dark wings, Krethusa calls upon Morai-Heg’s power to decimate her foes. Each sanctified pinion can summon a flesh-eating murder of crows to tear apart any enemy foolish enough to defy her.",
      "referenceKeywords": "Unique, Hero, Priest (1), Infantry, Fly, Ward (6+), Order, Daughters of Khaine, Aelf",
      "stats": {
        "move": "12\"",
        "save": "5+",
        "control": "2",
        "health": "6",
        "ward": "6+"
      },
      "points": 160,
      "modelCount": 1,
      "baseSize": "60mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Staff of Morai-Heg",
            "type": "melee",
            "range": null,
            "attacks": "4",
            "hit": "3+",
            "wound": "4+",
            "rend": "1",
            "damage": "D3",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Murder of Crows",
          "phase": "heroPhase",
          "phaseDetails": "Your Hero Phase",
          "icon": "offensive",
          "castingValue": 4,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Several of Krethusa’s feathers transform into eldritch corvids that descend upon her enemies, pecking eyes from sockets and flesh from bone.",
          "declare": "Pick a visible enemy unit within 18\" of this unit to be the target, then make a chanting roll of D6.",
          "effect": "Roll a D3. If the chanting roll was 8+, roll a D6 instead. Inflict an amount of mortal damage on the target equal to the roll. In addition, if the roll exceeds the target’s Health characteristic, subtract 1 from hit rolls for the target’s attacks until the start of your next turn.",
          "keywords": ["Prayer"]
        },
        {
          "name": "Burnt Offerings",
          "phase": "heroPhase",
          "phaseDetails": "Once Per Turn, Any Hero Phase",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Casting blood into her brazier, Krethusa manipulates the twisting coils of smoke to commune with Morai‑Heg.",
          "declare": "If this unit is within the combat range of a friendly CAULDRON OF BLOOD, pick a visible friendly DAUGHTERS OF KHAINE AELF non‑HERO INFANTRY unit wholly within 18\" of this unit to be the target.",
          "effect": "Roll a dice. On a 2+, pick 1 of the following effects to apply to the target.\n\nProphecy of Silence: Until the start of your next turn, enemy units cannot use commands while they are in combat with the target.\n\nProphecy of Dark Wings: The target can use the ‘Normal Move’ ability as if it were your movement phase. That unit counts as having used a RUN ability this turn.\n\nProphecy of Reclamation: For the rest of the turn, while the target is contesting an objective, subtract 10 from the control scores of enemy units contesting that objective that do not have the HERO or MONSTER keyword."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "requiredKeywords": ["Coven Matriarch"],
          "linkedWarscroll": null
        },
        {
          "points": null,
          "requiredKeywords": ["Aelf"],
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "7da1104a-7e74-56fe-a668-ceb970010110",
      "name": "Maleneth Witchblade",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factions": ["Daughters of Khaine"],
      "keywords": ["Aelf", "Unique", "Infantry", "Ward (6+)", "Hero"],
      "factionKeywords": ["Grand Alliance Order", "Daughters of Khaine"],
      "fluff": "A feared assassin of the Bloody-Handed God, Maleneth Witchblade’s mysterious objectives have seen her abandon her duties as an agent of the Order of Azyr and accompany the legendary Gotrek Gurnisson into battle, where she turns her murderous talents upon the servants of ruin and darkness.",
      "referenceKeywords": "Unique, Hero, Infantry, Ward (6+), Order, Daughters of Khaine, Aelf",
      "stats": {
        "move": "6\"",
        "save": "5+",
        "control": "2",
        "health": "5",
        "ward": "6+"
      },
      "points": 170,
      "modelCount": 1,
      "baseSize": "32mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Poisoned Throwing Knives",
            "type": "ranged",
            "range": "10\"",
            "attacks": "3",
            "hit": "2+",
            "wound": "4+",
            "rend": "1",
            "damage": "D3",
            "abilities": ["Crit (Auto-wound)", "Shoot in Combat"]
          }
        ],
        "melee": [
          {
            "name": "Deadly Blades",
            "type": "melee",
            "range": null,
            "attacks": "6",
            "hit": "2+",
            "wound": "4+",
            "rend": "1",
            "damage": "2",
            "abilities": ["Anti-HERO (+1 Rend)"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Vial of Secrets",
          "phase": "defensive",
          "phaseDetails": "Passive",
          "icon": "defensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Maleneth wears a vial of blood around her neck that contains the soul of her former mistress, whose whispered secrets grant her an uncanny awareness.",
          "declare": null,
          "effect": "If the unmodified hit roll for an attack that targets this unit is 1-4, the attack fails and the attack sequence ends."
        },
        {
          "name": "Strike From the Shadows",
          "phase": "combatPhase",
          "phaseDetails": "Any Combat Phase",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Maleneth waits for her allies to create a distraction before darting out from cover to engage the enemy and complete her deadly mission.",
          "declare": "Pick this unit if it is in hiding. Then, pick a friendly INFANTRY unit that has 5 or more models to be the target.",
          "effect": "Roll a dice. On a 3+, set up this unit anywhere on the battlefield wholly within 6\" of the target. If you do so, this unit must be set up in combat and has STRIKE-FIRST for the rest of the turn. On a failed roll, this unit remains in hiding but you automatically pass the roll the next time you use this ability."
        },
        {
          "name": "Hidden Agent",
          "phase": "startOfTurn",
          "phaseDetails": "Deployment Phase",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Maleneth is master of stealth, concealing herself amongst allies and waiting for the perfect time to strike.",
          "declare": null,
          "effect": "If this unit has not been deployed, set up this unit in reserve in hiding. It has now been deployed.",
          "keywords": ["Deploy"]
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "requiredKeywords": ["Aelf"],
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "78225614-2547-58b6-b7a0-41f44f2d3612",
      "name": "Melusai Ironscale",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factions": ["Daughters of Khaine"],
      "keywords": [
        "Melusai",
        "Coven Matriarch",
        "Infantry",
        "Ward (6+)",
        "Hero"
      ],
      "factionKeywords": ["Grand Alliance Order", "Daughters of Khaine"],
      "fluff": "The Ironscales are Morathi-Khaine’s trusted inner coven and, as far as the lower-ranking Khainites are concerned, speak with the voice of the goddess. So intense is their hatred of Chaos and desire for revenge that these Scáthborn can be counted upon to lay down their lives for but a chance at the vengeance they crave. They are privy to truths concealed from most and are granted the honour of contributing to Morathi’s councils of war, for even the goddess recognises their innate talent in military matters. Ironscales are responsible for the protection of Morathi-Khaine and one of their number serves as the commander of her elite Vyperic Guard.\n\nThe souls of the Ironscales have been threaded with arcane wards that allow them to resist magical energies, allowing them to hunt down ancient artefacts and sites of eldritch power for their master. Wielding serpent-crested staves known as keldrisaíth, they loose bolts of shadowy energy into the foe and strike down their enemies with lightning-fast blows. When their mistress is threatened, the coiling serpents atop these weapons lunge forwards to bury their fangs deep into an enemy’s chest.",
      "referenceKeywords": "Hero, Infantry, Ward (6+), Order, Daughters of Khaine, Melusai",
      "stats": {
        "move": "8\"",
        "save": "5+",
        "control": "2",
        "health": "6",
        "ward": "6+"
      },
      "points": 160,
      "modelCount": 1,
      "baseSize": "40mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Keldrisaíth",
            "type": "ranged",
            "range": "12\"",
            "attacks": "2",
            "hit": "3+",
            "wound": "3+",
            "rend": "1",
            "damage": "D3",
            "abilities": []
          }
        ],
        "melee": [
          {
            "name": "Keldrisaíth",
            "type": "melee",
            "range": null,
            "attacks": "6",
            "hit": "3+",
            "wound": "4+",
            "rend": "1",
            "damage": "2",
            "abilities": ["Crit (Mortal)"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Wrath of the Scáthborn",
          "phase": "chargePhase",
          "phaseDetails": "Passive",
          "icon": "movement",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "An Ironscale leads her Melusai kin in the swift slaughter of the foe.",
          "declare": null,
          "effect": "You can re-roll charge rolls for friendly MELUSAI units while they are wholly within 12\" of this unit."
        },
        {
          "name": "Gory Offering",
          "phase": "combatPhase",
          "phaseDetails": "Reaction: You declared a FIGHT ability for this unit",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": true,
          "lore": "As a Melusai Ironscale holds the crystallised heart of a slain foe aloft, the power of Khaine pulses through it, empowering any fellow Melusai nearby.",
          "declare": null,
          "effect": "Pick a friendly non-HERO MELUSAI unit that has not used a FIGHT ability this turn and is within this unit’s combat range to be the target. The target can be picked to use a FIGHT ability immediately after the FIGHT ability used by this unit has been resolved. If it is picked to do so, add 1 to the Attacks characteristic of the target’s melee weapons for the rest of the turn."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "linkedWarscroll": null
        },
        {
          "points": null,
          "requiredKeywords": ["Khinerai"],
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        },
        {
          "points": null,
          "requiredKeywords": ["Melusai"],
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "11c90ce6-ccdc-5299-82fd-b5f104665875",
      "name": "Morathi-Khaine",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factions": ["Daughters of Khaine"],
      "keywords": [
        "Aelf",
        "Wizard",
        "Unique",
        "Infantry",
        "Ward (6+)",
        "Warmaster",
        "Hero"
      ],
      "factionKeywords": ["Grand Alliance Order", "Daughters of Khaine"],
      "fluff": "Cunning diplomat, fearsome warrior, speaker to daemons and ascended god: Morathi is all these things and more. Few beings in existence can claim a fraction of her arcane skill – with little more than a flick of her hand, Morathi is able to summon formless horrors from the umbral realm to savage her foes or to blast them with bolts of icy darkness.\n\nMorathi most often presents herself as a stunningly beautiful aelf, framed by bladed wings of shadow-metal. In this guise, she goes by the name Morathi- Khaine, purporting to be the second coming of the god of war and murder. Skilled in both slaughter and magic, she is not averse to more direct methods of attack – her ability to inspire a zealous frenzy in her followers is as lethal a weapon as her ensorcelled spear, the infamous Heartrender.\n\nAlthough she wields his Iron Heart, Morathi carries none of Khaine’s divine essence in her own veins. If her Khainite masses were to discover her duplicity, they would surely seek the destruction of their usurper goddess. Yet such is Morathi’s skill at manipulation, coupled with her ruthlessness in silencing dissenters, that only those with a death wish would dare challenge her openly.",
      "referenceKeywords": "Warmaster, Unique, Hero, Wizard (3), Infantry, Ward (6+), Order, Daughters of Khaine, Aelf",
      "stats": {
        "move": "6\"",
        "save": "5+",
        "control": "2",
        "health": "6",
        "ward": "6+"
      },
      "points": 760,
      "modelCount": 1,
      "baseSize": "40mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Heartrender and Bladed Wings",
            "type": "melee",
            "range": null,
            "attacks": "5",
            "hit": "3+",
            "wound": "4+",
            "rend": "2",
            "damage": "2",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "One Soul, Two Bodies",
          "phase": "defensive",
          "phaseDetails": "Passive",
          "icon": "defensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Morathi‑Khaine and the Shadow Queen are two entities that share the same life force.",
          "declare": null,
          "effect": "Each time a damage point would be allocated to this unit, it is instead allocated to a friendly The Shadow Queen (you cannot make any further ward rolls for that damage point).\n\nIf this unit would be automatically destroyed by another ability, it is not automatically destroyed. Instead, allocate 3 damage points to a friendly The Shadow Queen (ward rolls cannot be made for those damage points).\n\nIf a friendly The Shadow Queen is destroyed, this unit is automatically destroyed."
        },
        {
          "name": "Mirror Dance",
          "phase": "heroPhase",
          "phaseDetails": "Your Hero Phase",
          "icon": "movement",
          "castingValue": 7,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Morathi casts a spell of shifting, revealing a shadowpath between herself and the Shadow Queen.",
          "declare": "If a friendly Shadow Queen is on the battlefield, make a casting roll of 2D6.",
          "effect": "Place 2 tokens on the battlefield, one directly underneath the centre of this unit’s base and one directly underneath the centre of a friendly Shadow Queen’s base. Then, remove this unit and that Shadow Queen from the battlefield. Set up each unit again with its base overlapping the centre of the other token, then remove the tokens. If it is not possible to set up either of the units on the battlefield, return both units to their original positions. Each unit can only be set up in combat with units that the other unit was already in combat with.",
          "keywords": ["Spell"]
        },
        {
          "name": "Sorceress Supreme",
          "phase": "heroPhase",
          "phaseDetails": "Passive",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Few beings in existence can claim a fraction of Morathi’s skill in the magical art.",
          "declare": null,
          "effect": "Add 1 to casting rolls for this unit."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "linkedWarscroll": null
        },
        {
          "points": null,
          "requiredKeywords": ["Coven Matriarch"],
          "linkedWarscroll": null
        },
        {
          "points": null,
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "d2e54867-639c-57f7-b563-12378e12469c",
      "name": "Morgwaeth's Blade-coven",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factions": ["Daughters of Khaine"],
      "keywords": [
        "Champion",
        "Aelf",
        "Priest",
        "Unique",
        "Infantry",
        "Ward (6+)"
      ],
      "factionKeywords": [
        "Grand Alliance Order",
        "Daughters of Khaine",
        "The Croneseer’s Pariahs"
      ],
      "fluff": "As coldly ambitious as any of Morathi-Khaine’s priestesses, the ruthless Hag Queen Morgwaeth the Bloodied travels the realms in search of precious Khainite treasures. Unflinchingly loyal to their bloodthirsty mistress Morgwaeth and to the cause of Hagg Nar, the warriors of the Blade-coven have spilled the blood of countless enemies in the course of their far-ranging missions.",
      "referenceKeywords": "Unique, Infantry, Champion, Ward (6+), Order, Daughters of Khaine, Aelf",
      "stats": {
        "move": "6\"",
        "save": "6+",
        "control": "1",
        "health": "2",
        "ward": "6+"
      },
      "points": 120,
      "modelCount": 5,
      "baseSize": "32mm [4], 40mm [1]",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Heartseeker Bow",
            "type": "ranged",
            "range": "18\"",
            "attacks": "3",
            "hit": "3+",
            "wound": "4+",
            "rend": "1",
            "damage": "1",
            "abilities": ["Crit (Auto-wound)"]
          }
        ],
        "melee": [
          {
            "name": "Sacrificial Weapons",
            "type": "melee",
            "range": null,
            "attacks": "3",
            "hit": "3+",
            "wound": "4+",
            "rend": "-",
            "damage": "1",
            "abilities": ["Crit (Auto-wound)"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Witchbrew",
          "phase": "heroPhase",
          "phaseDetails": "Once Per Turn (Army), Any Hero Phase",
          "icon": "defensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Witchbrew drives the imbiber into such an ecstasy of destruction that they will fight on in the face of impossible odds.",
          "declare": "Pick a friendly DAUGHTERS OF KHAINE unit wholly within 12\" of this unit to be the target.",
          "effect": "Roll a dice. On a 3+, the target has WARD (5+) for the rest of the turn."
        },
        {
          "name": "Morgwaeth the Bloodied",
          "phase": "heroPhase",
          "phaseDetails": "Passive",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "As coldly ambitious as any of Morathi-Khaine’s priestesses, the ruthless Hag Queen Morgwaeth the Bloodied travels the realms in search of precious Khainite treasures.",
          "declare": null,
          "effect": "While this unit’s Morgwaeth the Bloodied is on the battlefield, it has PRIEST (1)."
        }
      ],
      "notes": null
    },
    {
      "id": "6e92cf4a-f9b0-53e4-b0b5-ff218cf7d3f8",
      "name": "Scourge of Ghyran Bloodwrack Shrine",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factions": ["Daughters of Khaine"],
      "keywords": ["Melusai", "War Machine", "Wizard", "Ward (6+)", "Hero"],
      "factionKeywords": ["Grand Alliance Order", "Daughters of Khaine"],
      "fluff": "Khainite forces in Ghyran make great use of Bloodwrack Shrines, monuments to torment and bitterness attended to by a serpentine monster known as a Medusa, who delights in inflicting pain on her victims. At the apex of the Shrine sits a cursed mirror, emanating an aura of bitter hatred powerful enough to ravage mortals and shatter arcane manifestations into eldritch motes.",
      "referenceKeywords": "Hero, War Machine, Wizard (2), Ward (6+), Order, Daughters of Khaine, Melusai",
      "stats": {
        "move": "6\"",
        "save": "4+",
        "control": "5",
        "health": "12",
        "ward": "6+"
      },
      "points": 250,
      "modelCount": 1,
      "baseSize": "120 x 92mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Bloodwrack Stare",
            "type": "ranged",
            "range": "15\"",
            "attacks": "4",
            "hit": "3+",
            "wound": "3+",
            "rend": "2",
            "damage": "3",
            "abilities": ["Shoot in Combat", "Crit (2 Hits)"]
          }
        ],
        "melee": [
          {
            "name": "Medusa's Spear and Shrinekeeper's Goadstaves",
            "type": "melee",
            "range": null,
            "attacks": "8",
            "hit": "3+",
            "wound": "4+",
            "rend": "1",
            "damage": "2",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Wracking Gaze",
          "phase": "shootingPhase",
          "phaseDetails": "Once Per Turn (Army), Any Shooting Phase",
          "icon": "shooting",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Those who look into the eyes of a Bloodwrack Medusa for more than a moment find themselves paralysed in agony as their blood begins to boil in their veins.",
          "declare": "Pick a visible enemy unit within 15\" of this unit to be the target.",
          "effect": "Roll a dice. If the roll is equal to or less than that enemy unit’s Health characteristic, for the rest of the phase, you can re-roll failed hit rolls for attacks made by this unit that target that enemy unit."
        },
        {
          "name": "Reflected Agony",
          "phase": "heroPhase",
          "phaseDetails": "Your Hero Phase",
          "icon": "special",
          "castingValue": 5,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "A pulsing wave of pain emanates from the Bloodwrack Shrine, repelling enemies and even arcane manifestations.",
          "declare": "Make a casting roll of 2D6.",
          "effect": "Until the start of your next turn, enemy units and enemy MANIFESTATIONS cannot be set up within 12\" of this unit.",
          "keywords": ["Spell"]
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "requiredKeywords": ["Coven Matriarch"],
          "linkedWarscroll": null
        },
        {
          "points": null,
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "d825f0f4-f3b1-5ef3-92a5-44a3828fbf20",
      "name": "Scourge of Ghyran Krethusa the Croneseer",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factions": ["Daughters of Khaine"],
      "keywords": [
        "Aelf",
        "Priest",
        "Unique",
        "Infantry",
        "Ward (6+)",
        "Fly",
        "Hero"
      ],
      "factionKeywords": [
        "Grand Alliance Order",
        "Daughters of Khaine",
        "The Croneseer’s Pariahs"
      ],
      "fluff": "The will of the goddess Morai-Heg has brought Krethusa the Croneseer to Ghyran, where ambitious warlords threaten to unpick the threads of destiny. With shadow magic and subterfuge the prophet will lay these tyrants low, ensuring that the promised future of aelfkind she has witnessed in her violent visions comes to pass.",
      "referenceKeywords": "Unique, Hero, Priest (2), Infantry, Fly, Ward (6+), Order, Daughters of Khaine, Aelf",
      "stats": {
        "move": "12\"",
        "save": "5+",
        "control": "2",
        "health": "6",
        "ward": "6+"
      },
      "points": 260,
      "modelCount": 1,
      "baseSize": "60mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Staff of Morai-Heg",
            "type": "melee",
            "range": null,
            "attacks": "5",
            "hit": "3+",
            "wound": "4+",
            "rend": "1",
            "damage": "D3",
            "abilities": ["Crit (Auto-wound)"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Gift of Foresight",
          "phase": "movementPhase",
          "phaseDetails": "Once Per Battle, Your Movement Phase",
          "icon": "rallying",
          "castingValue": null,
          "chantValue": null,
          "cpCost": 1,
          "isReaction": false,
          "lore": "The arrival of fresh reinforcements precisely when and where they are needed appears fortuitous to their fellow warriors. Krethusa knows better. In a way, she always has.",
          "declare": "Pick a friendly non-UNIQUE DAUGHTERS OF KHAINE AELF INFANTRY or CAVALRY unit that has been destroyed to be the target.",
          "effect": "Set up a replacement unit with half the number of models from the target unit (rounding up) wholly within 9\" of a battlefield edge and more than 9\" from all enemy units."
        },
        {
          "name": "Blood Ritual",
          "phase": "heroPhase",
          "phaseDetails": "Your Hero Phase",
          "icon": "special",
          "castingValue": 3,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Communing with Morai-Heg, Krethusa scries events yet to pass in the spilt ichor of a recent victim.",
          "declare": "Pick a visible friendly DAUGHTERS OF KHAINE AELF INFANTRY or CAVALRY unit wholly within 12\" of this unit to be the target. Then, make a chanting roll of D6.",
          "effect": "Pick 1 of the following effects to apply until the start of your next turn:\n\nProphecy of Tyranny: Enemy units cannot use commands while they are in combat with the target.\n\nProphecy of Shelter: Other than the COMPANION ability, weapon abilities used by enemy units while they are in combat with the target have no effect.\n\nProphecy of Retribution: Subtract 1 from ward rolls made for damage points inflicted by the target’s combat attacks.\n\nIf the chanting roll was 9+, all of the above effects apply.",
          "keywords": ["Prayer"]
        },
        {
          "name": "The Croneseer",
          "phase": "heroPhase",
          "phaseDetails": "Enemy Hero Phase",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Chosen by Morai-Heg, Krethusa is the vessel through which the aelven goddess implements her plans.",
          "declare": null,
          "effect": "Give this unit D3 ritual points."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "requiredKeywords": ["Coven Matriarch"],
          "linkedWarscroll": null
        },
        {
          "points": null,
          "requiredKeywords": ["Aelf"],
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "c0e9710b-64f1-52f1-b480-162f45f473a5",
      "name": "Sisters of Slaughter with Bladed Bucklers",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factions": ["Daughters of Khaine"],
      "keywords": [
        "Champion",
        "Standard Bearer",
        "Aelf",
        "Musician",
        "Infantry",
        "Ward (6+)"
      ],
      "factionKeywords": [
        "Grand Alliance Order",
        "Daughters of Khaine",
        "The Croneseer’s Pariahs"
      ],
      "fluff": "To the Sisters of Slaughter, combat is everything. Their entire lives are dedicated to fighting – only through mastery of melee can they truly worship Khaine. They spin, leap and pose dramatically as they use whips and blades to slaughter their foes.\n\nThe Sisters of Slaughter are considered extremist even by other Khainites. Whether absorbed by revenge or overcome with the murderous spirit of Khaine, the warriors take the vow of druharú and don masks of living metal. In an excruciating rite involving boiling blood and spells of bonding, those who would join the sisterhood permanently graft the helms onto their heads, the metal leering ever more cruelly as it scents blood.\n\nBarbed whips known as kruiplash are the weapon of choice for the Sisters of Slaughter, and some also wield a bladed buckler that can turn enemy strikes and deliver a lethal counter-blow of its own. When the barbed whips are used in battle, the serpentine coils snap out to sever limbs, lacerate eyes or puncture armour to flay the flesh beneath.",
      "referenceKeywords": "Infantry, Champion, Musician (1/5), Standard Bearer (1/5), Ward (6+), Order, Daughters of Khaine, Aelf",
      "stats": {
        "move": "6\"",
        "save": "5+",
        "control": "1",
        "health": "1",
        "ward": "6+"
      },
      "points": 120,
      "modelCount": 10,
      "baseSize": "25mm",
      "cannotBeReinforced": false,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Kruiplash",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "3+",
            "wound": "4+",
            "rend": "-",
            "damage": "1",
            "abilities": ["Anti-INFANTRY (+1 Rend)"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Dance of Diversion",
          "phase": "defensive",
          "phaseDetails": "Passive",
          "icon": "defensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Sisters of Slaughter move around their enemies with ease, making them nearly impossible to strike down.",
          "declare": null,
          "effect": "Subtract 1 from hit rolls for combat attacks that target this unit."
        },
        {
          "name": "Bladed Bucklers",
          "phase": "defensive",
          "phaseDetails": "Passive",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The martial skill of these warriors allows them to turn defensive techniques into deadly strikes.",
          "declare": null,
          "effect": "Each time you make an unmodified save roll of 6 for a combat attack that targets this unit, inflict 1 mortal damage on the attacking unit after the FIGHT ability has been resolved."
        }
      ],
      "notes": null
    },
    {
      "id": "d258452c-fe07-5ecd-a933-472f77f1feb8",
      "name": "Sisters of Slaughter with Sacrificial Knives",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factions": ["Daughters of Khaine"],
      "keywords": [
        "Champion",
        "Standard Bearer",
        "Aelf",
        "Musician",
        "Infantry",
        "Ward (6+)"
      ],
      "factionKeywords": [
        "Grand Alliance Order",
        "Daughters of Khaine",
        "The Croneseer’s Pariahs"
      ],
      "fluff": "To the Sisters of Slaughter, combat is everything. Their entire lives are dedicated to fighting – only through mastery of melee can they truly worship Khaine. They spin, leap and pose dramatically as they use whips and blades to slaughter their foes.\n\nThe Sisters of Slaughter are considered extremist even by other Khainites. Whether absorbed by revenge or overcome with the murderous spirit of Khaine, the warriors take the vow of druharú and don masks of living metal. In an excruciating rite involving boiling blood and spells of bonding, those who would join the sisterhood permanently graft the helms onto their heads, the metal leering ever more cruelly as it scents blood.\n\nBarbed whips known as kruiplash are the weapon of choice for the Sisters of Slaughter, and some Sisters battle with a short stabbing blade in addition to their lash. When the barbed whips are used in battle, the serpentine coils snap out to sever limbs, lacerate eyes or puncture armour to flay the flesh beneath.",
      "referenceKeywords": "Infantry, Champion, Musician (1/5), Standard Bearer (1/5), Ward (6+), Order, Daughters of Khaine, Aelf",
      "stats": {
        "move": "6\"",
        "save": "6+",
        "control": "1",
        "health": "1",
        "ward": "6+"
      },
      "points": 110,
      "modelCount": 10,
      "baseSize": "25mm",
      "cannotBeReinforced": false,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Kruiplash and Sacrificial Knife",
            "type": "melee",
            "range": null,
            "attacks": "3",
            "hit": "3+",
            "wound": "4+",
            "rend": "-",
            "damage": "1",
            "abilities": ["Anti-INFANTRY (+1 Rend)"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Dance of Death",
          "phase": "combatPhase",
          "phaseDetails": "Enemy Combat Phase",
          "icon": "movement",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Sisters of Slaughter manoeuvre in the heat of combat to close the distance with their enemies.",
          "declare": null,
          "effect": "This unit can move 3\". It can pass through the combat ranges of enemy units and can end that move in combat."
        }
      ],
      "notes": null
    },
    {
      "id": "847ac0e7-ae68-54b0-9da6-ddc7546125d8",
      "name": "Slaughter Queen",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factions": ["Daughters of Khaine"],
      "keywords": ["Aelf", "Infantry", "Ward (6+)", "Hero"],
      "factionKeywords": [
        "Grand Alliance Order",
        "Daughters of Khaine",
        "The Croneseer’s Pariahs"
      ],
      "fluff": "Slaughter Queens are the martial leaders of the war covens, chosen for their skilled bladework and their fanaticism for dealing death. For a Slaughter Queen, the battlefield is her temple, and the jetting blood of an opened throat is her sacred offering to almighty Khaine. They fight with a sword in each hand, weaving a pattern of red ruination. The Blade of Khaine – blessed with the furore of war – strikes with blurring speed, while the Deathsword is imbued with Morathi’s scorn, its enchanted edge slicing gaping clefts in flesh and armour with even the slightest stroke. A Slaughter Queen wears little in the way of armour, instead relying upon feints, deft dodges and flawless acrobatics to avoid enemy blows.\n\nNo Khainite can help but be inspired by the unrestrained butchery enacted by a Slaughter Queen. Where these priestesses roam, the land is soon watered with the blood of the freshly slain. Though they prefer bladework to ministry, Slaughter Queens are still adept at channelling the hot rage of Khaine into devastating battle prayers. All learn the killing words of power – appellations of Khaine that, when shouted at the correct pitch, can smite an enemy or even blunt an incoming spell.",
      "referenceKeywords": "Hero, Priest (1), Infantry, Ward (6+), Order, Daughters of Khaine, Aelf",
      "stats": {
        "move": "6\"",
        "save": "5+",
        "control": "2",
        "health": "5",
        "ward": "6+"
      },
      "points": 130,
      "modelCount": 1,
      "baseSize": "25mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Deathsword and Blade of Khaine",
            "type": "melee",
            "range": null,
            "attacks": "6",
            "hit": "3+",
            "wound": "4+",
            "rend": "1",
            "damage": "2",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Orgy of Slaughter",
          "phase": "combatPhase",
          "phaseDetails": "Once Per Turn (Army), Any Combat Phase",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The Slaughter Queen orders her warriors to renew their assault twice over.",
          "declare": "Pick a friendly DAUGHTERS OF KHAINE AELF INFANTRY unit wholly within 12\" of this unit to be the target.",
          "effect": "Roll a dice. On a 3+, add 1 to the Attacks characteristic of the target’s melee weapons for the rest of the turn."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "requiredKeywords": ["Coven Matriarch"],
          "linkedWarscroll": null
        },
        {
          "points": null,
          "linkedWarscroll": null
        },
        {
          "points": null,
          "requiredKeywords": ["Aelf"],
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "c497f0db-4af3-5b56-8cc1-a762dfc61920",
      "name": "Slaughter Queen on Cauldron of Blood",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factions": ["Daughters of Khaine"],
      "keywords": [
        "Aelf",
        "War Machine",
        "Priest",
        "Cauldron of Blood",
        "Ward (6+)",
        "Hero"
      ],
      "factionKeywords": [
        "Grand Alliance Order",
        "Daughters of Khaine",
        "The Croneseer’s Pariahs"
      ],
      "fluff": "Slaughter Queens are the martial leaders of the war covens, chosen for their skilled bladework and their fanaticism for dealing death. For a Slaughter Queen, the battlefield is her temple, and the jetting blood of an opened throat is her sacred offering to almighty Khaine. They fight with a sword in each hand, weaving a pattern of red ruination.\n\nFor a battle worthy of their finest ritual offerings, the war covens of the Daughters of Khaine bring forth the greatest of their religion’s icons – the Cauldrons of Blood. Mounted on iron-shod wheels, these arcane devices surge forward, propelled solely by the incantations of their riders, as if the machine itself was lured onwards by the promise of carnage. Each is connected to Morathi’s own cauldron, which drains a portion of each sacrifice poured inside. Slaughter Queens who have spilt rivers of blood in the name of their goddess are granted the honour of riding one to battle, and their aggressive strategy sees them wield it more like a close-combat war machine. Brought to life by blood rituals, the iron statue of Khaine upon the shrine roars its anger in torrents of molten metal blood or swings its massive sword to hack down those who dare close with the cauldron.",
      "referenceKeywords": "Hero, Priest (1), War Machine, Ward (6+), Order, Daughters of Khaine, Aelf, Cauldron of Blood",
      "stats": {
        "move": "6\"",
        "save": "4+",
        "control": "5",
        "health": "12",
        "ward": "6+"
      },
      "points": 330,
      "modelCount": 1,
      "baseSize": "120 x 92mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Torrent of Burning Blood",
            "type": "ranged",
            "range": "10\"",
            "attacks": "6",
            "hit": "3+",
            "wound": "3+",
            "rend": "1",
            "damage": "1",
            "abilities": ["Shoot in Combat"]
          }
        ],
        "melee": [
          {
            "name": "Avatar’s Sword",
            "type": "melee",
            "range": null,
            "attacks": "5",
            "hit": "3+",
            "wound": "3+",
            "rend": "2",
            "damage": "3",
            "abilities": []
          },
          {
            "name": "Witch Aelves’ Sciansá",
            "type": "melee",
            "range": null,
            "attacks": "6",
            "hit": "3+",
            "wound": "4+",
            "rend": "-",
            "damage": "1",
            "abilities": []
          },
          {
            "name": "Deathsword and Blade of Khaine",
            "type": "melee",
            "range": null,
            "attacks": "6",
            "hit": "3+",
            "wound": "4+",
            "rend": "1",
            "damage": "2",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Bladed Impact",
          "phase": "chargePhase",
          "phaseDetails": "Any Charge Phase",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The bladed carriage hauling a Cauldron of Blood can cleave its way through enemy ranks with ease.",
          "declare": "If this unit charged this phase, pick an enemy unit within 1\" of it to be the target.",
          "effect": "Roll a D3. On a 2+, inflict an amount of mortal damage on the target equal to the roll."
        },
        {
          "name": "Orgy of Slaughter",
          "phase": "combatPhase",
          "phaseDetails": "Once Per Turn (Army), Any Combat Phase",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The Slaughter Queen orders her warriors to renew their assault twice over.",
          "declare": "Pick a friendly DAUGHTERS OF KHAINE AELF INFANTRY unit wholly within 12\" of this unit to be the target.",
          "effect": "Roll a dice. On a 3+, add 1 to the Attacks characteristic of the target’s melee weapons for the rest of the turn."
        },
        {
          "name": "Altar of Khaine",
          "phase": "startOfTurn",
          "phaseDetails": "Passive",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The powerful magic that fuels the Cauldron of Blood grants empowerment and protection to those nearby.",
          "declare": null,
          "effect": "Add 1 to save rolls for friendly DAUGHTERS OF KHAINE INFANTRY units while they are wholly within 9\" of this unit.\n\nIn addition, add 1 to chanting rolls for friendly DAUGHTERS OF KHAINE PRIESTS while they are wholly within 9\" of this unit."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "requiredKeywords": ["Coven Matriarch"],
          "linkedWarscroll": null
        },
        {
          "points": null,
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "ec5c4fab-cb7d-5a98-99fe-024f38bd9bc9",
      "name": "The Shadeborn",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factions": ["Daughters of Khaine"],
      "keywords": ["Champion", "Aelf", "Infantry", "Ward (6+)"],
      "factionKeywords": [
        "Grand Alliance Order",
        "Daughters of Khaine",
        "The Croneseer’s Pariahs"
      ],
      "fluff": "Wielding weapons forged from pure shadowstone, Slythael is a deadly foe to all who stand in her way. Branded with the mircath shademark, she is possessed of a mastery of umbral magic so potent that she can leap between the shadows, appearing more akin to an insubstantial wraith than any creature of flesh and blood. Accompanying her are Drusylla and Valyssa, two former Witch Aelves whose natural grace has been heightened by Shadowstalker training. The last member of the group is Sylarc Greyblood, who excels in his mastery of umbral magic and the crossbow.",
      "referenceKeywords": "Unique, Infantry, Champion, Ward (6+), Order, Daughters of Khaine, Aelf",
      "stats": {
        "move": "6\"",
        "save": "5+",
        "control": "1",
        "health": "2",
        "ward": "6+"
      },
      "points": 80,
      "modelCount": 4,
      "baseSize": "40mm [1], 28.5mm [3]",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Cursed Missiles",
            "type": "ranged",
            "range": "10\"",
            "attacks": "1",
            "hit": "3+",
            "wound": "3+",
            "rend": "1",
            "damage": "1",
            "abilities": []
          }
        ],
        "melee": [
          {
            "name": "Shadowstalker Blades",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "3+",
            "wound": "4+",
            "rend": "-",
            "damage": "1",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Shadow Leap",
          "phase": "movementPhase",
          "phaseDetails": "Your Movement Phase",
          "icon": "movement",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Shadowstalkers can vanish and reappear at will as they navigate the Umbral Web.",
          "declare": null,
          "effect": "Remove this unit from the battlefield and set it up again on the battlefield more than 9\" from all enemy units."
        },
        {
          "name": "Mask of Shadowed Mirrors",
          "phase": "combatPhase",
          "phaseDetails": "Any Combat Phase",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "This mask shows attackers a haunting visage that chills them to the bone.",
          "declare": "Pick an enemy unit in combat with this unit to be the target.",
          "effect": "Roll a dice. On a 3+, the target cannot use commands for the rest of the turn."
        }
      ],
      "notes": null
    },
    {
      "id": "3166b336-9b97-5d8f-8763-e9c5ea1204a5",
      "name": "The Shadow Queen",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factions": ["Daughters of Khaine"],
      "keywords": ["Monster", "Unique", "Ward (6+)", "Fly", "Hero"],
      "factionKeywords": ["Grand Alliance Order", "Daughters of Khaine"],
      "fluff": "The realms at large believe the Shadow Queen to be a monstrous ally of Morathi- Khaine summoned from the darkest corners of the Shadowlands, yet the truth is far stranger. When Morathi ascended to godhood, she was cleaved in two by a vengeful soul she was consuming for power. Her form was split into the regal sorceress Morathi-Khaine and the monstrous Shadow Queen. This serpentine war form is framed by enormous bat-like wings and a mane of venomous snakes. She can pulverise stone walls with her lashing coils, whilst those who meet her dreadful gaze find their blood erupting from their veins. The Shadow Queen wields an oversized version of her legendary weapon, Heartrender, that befits her formidable stature.\n\nMorathi-Khaine and the Shadow Queen are one being joined by a single soul. Together they form a terrifying union of martial and arcane might capable of obliterating entire armies. Nevertheless, the goddess faces a constant battle to balance the clashing aspects of her psyche. In times of great strife, the appeal of the Shadow Queen’s straightforward, murderous hatred becomes very difficult to deny, and the composed power of Morathi-Khaine wavers. The ragged wound in Morathi’s godly soul may never truly heal, and she wonders if the final cost of her ascension is yet to be revealed.",
      "referenceKeywords": "Unique, Hero, Monster, Fly, Ward (6+), Order, Daughters of Khaine",
      "stats": {
        "move": "12\"",
        "save": "4+",
        "control": "10",
        "health": "12",
        "ward": "6+"
      },
      "points": 0,
      "modelCount": 1,
      "baseSize": "100mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Gaze of the Shadow Queen",
            "type": "ranged",
            "range": "12\"",
            "attacks": "1",
            "hit": "2+",
            "wound": "2+",
            "rend": "3",
            "damage": "D6",
            "abilities": ["Shoot in Combat"]
          }
        ],
        "melee": [
          {
            "name": "Envenomed Tail",
            "type": "melee",
            "range": null,
            "attacks": "1",
            "hit": "3+",
            "wound": "3+",
            "rend": "2",
            "damage": "6",
            "abilities": []
          },
          {
            "name": "Crown of Serpents",
            "type": "melee",
            "range": null,
            "attacks": "2D6",
            "hit": "4+",
            "wound": "4+",
            "rend": "-",
            "damage": "1",
            "abilities": []
          },
          {
            "name": "Heartrender",
            "type": "melee",
            "range": null,
            "attacks": "8",
            "hit": "3+",
            "wound": "3+",
            "rend": "2",
            "damage": "3",
            "abilities": ["Crit (Mortal)"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Iron Heart of Khaine",
          "phase": "defensive",
          "phaseDetails": "Passive",
          "icon": "defensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The Iron Heart of Khaine is the last remnant of the fallen god, and it pulses still with life sustaining divine energies.",
          "declare": null,
          "effect": "You cannot allocate more than 3 damage points to this unit each turn. Once 3 points have been allocated to this unit in a turn, any further damage points that would be allocated to it are ignored.\n\nDamage points allocated to this unit cannot be healed.\n\nIf this unit would be automatically destroyed, it is not automatically destroyed. Instead, allocate 3 damage points to it (ward rolls cannot be made for those damage points)."
        },
        {
          "name": "Fury of the Shadow Queen",
          "phase": "combatPhase",
          "phaseDetails": "Once Per Turn (Army), Any Combat Phase",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Bloodshed raises the Shadow Queen’s fury to new heights and fuels the murderlust of nearby Scáthborn.",
          "declare": "Pick an enemy unit in combat with this unit to be the target.",
          "effect": "Roll a D3. On a 2+, inflict an amount of mortal damage on the target equal to the roll. If any models are slain by this ability, for the rest of the turn, add 1 to the Attacks characteristic of melee weapons used by friendly KHINERAI and MELUSAI units while they are wholly within 12\" of this unit.",
          "keywords": ["Rampage"]
        }
      ],
      "notes": null
    },
    {
      "id": "0229af0e-e3ac-5724-84da-8d0d56adbcf7",
      "name": "Witch Aelves with Bladed Bucklers",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factions": ["Daughters of Khaine"],
      "keywords": [
        "Champion",
        "Standard Bearer",
        "Aelf",
        "Musician",
        "Infantry",
        "Ward (6+)"
      ],
      "factionKeywords": [
        "Grand Alliance Order",
        "Daughters of Khaine",
        "The Croneseer’s Pariahs"
      ],
      "fluff": "Witch Aelves are devotees that train endlessly in the service of Khaine. They partake in ritual combat every day to hone their martial prowess and sate their craving for violence. However, it is only in battle where they can truly immerse themselves in the holy rapture that bonds their souls with the Murder God.\n\nWitch Aelves fight with long sacrificial knives known as sciansá – steel blades each tempered in blood and blessed by a Hag Queen. Its razor sharp edge slices easily through flesh, while some bear a notch that causes profuse bleeding when twisted. Armour is generally considered an impediment to the art of slaughter, though some Witch Aelves favour a light, bladed buckler that can deflect a heavy swordblow – then lash back out to slit the throat of the enemy with a fatal riposte\n\nAs their battleline devolves from an ordered march into a whirlwind of stabbing and slicing, the Witch Aelves truly lose all self-control. Still beating hearts are ripped from victims’ chests and flesh is daubed with gore-red runes. There are many dark tales of Witch Aelves losing themselves utterly to the slaughter and turning their sacrificial knives upon supposed allies.",
      "referenceKeywords": "Infantry, Champion, Musician (1/5), Standard Bearer (1/5), Ward (6+), Order, Daughters of Khaine, Aelf",
      "stats": {
        "move": "6\"",
        "save": "5+",
        "control": "1",
        "health": "1",
        "ward": "6+"
      },
      "points": 90,
      "modelCount": 10,
      "baseSize": "25mm",
      "cannotBeReinforced": false,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Sciansá",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "3+",
            "wound": "4+",
            "rend": "-",
            "damage": "1",
            "abilities": ["Crit (Auto-wound)"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Bladed Bucklers",
          "phase": "defensive",
          "phaseDetails": "Passive",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The martial skill of these warriors allows them to turn defensive techniques into deadly strikes.",
          "declare": null,
          "effect": "Each time you make an unmodified save roll of 6 for a combat attack that targets this unit, inflict 1 mortal damage on the attacking unit after the FIGHT ability has been resolved."
        }
      ],
      "notes": null
    },
    {
      "id": "f55c4f00-77b2-5b55-978f-ce917c752ad5",
      "name": "Witch Aelves with Paired Sciansá",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factions": ["Daughters of Khaine"],
      "keywords": [
        "Champion",
        "Standard Bearer",
        "Aelf",
        "Musician",
        "Infantry",
        "Ward (6+)"
      ],
      "factionKeywords": [
        "Grand Alliance Order",
        "Daughters of Khaine",
        "The Croneseer’s Pariahs"
      ],
      "fluff": "Witch Aelves are devotees that train endlessly in the service of Khaine. They partake in ritual combat every day to hone their martial prowess and sate their craving for violence. However, it is only in battle where they can truly immerse themselves in the holy rapture that bonds their souls with the Murder God.\n\nWitch Aelves fight with long sacrificial knives known as sciansá – steel blades each tempered in blood and blessed by a Hag Queen. Its razor sharp edge slices  easily through flesh, while some bear a notch that causes profuse bleeding when twisted. Armour is generally considered an impediment to the art of slaughter, though Witch Aelves do wear enchanted bracers and pauldrons that can turn aside the rare blow that they fail to evade.\n\nAs their battleline devolves from an ordered march into a whirlwind of stabbing and slicing, the Witch Aelves truly lose all self-control. Still beating hearts are ripped from victims’ chests and flesh is daubed with gore-red runes. There are  many dark tales of Witch Aelves losing themselves utterly to the slaughter and turning their sacrificial knives upon supposed allies.",
      "referenceKeywords": "Infantry, Champion, Musician (1/5), Standard Bearer (1/5), Ward (6+), Order, Daughters of Khaine, Aelf",
      "stats": {
        "move": "6\"",
        "save": "6+",
        "control": "1",
        "health": "1",
        "ward": "6+"
      },
      "points": 120,
      "modelCount": 10,
      "baseSize": "25mm",
      "cannotBeReinforced": false,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Paired Sciansá",
            "type": "melee",
            "range": null,
            "attacks": "3",
            "hit": "3+",
            "wound": "4+",
            "rend": "-",
            "damage": "1",
            "abilities": ["Crit (Auto-wound)"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Frenzied Fervour",
          "phase": "combatPhase",
          "phaseDetails": "Passive",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Witch Aelves hurl themselves at the enemy with no fear of death, cutting down foes in a whirlwind of blades.",
          "declare": null,
          "effect": "Add 1 to the Rend characteristic of this unit’s melee weapons for the rest of the turn if this unit charged in the same turn."
        }
      ],
      "notes": null
    }
  ],
  "battleFormations": [
    {
      "id": "7ab6abcc-874f-57ca-9c50-831e5b2fc7c1",
      "name": "Scáthcoven",
      "cardType": "BattleFormation",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factionTerrainLimit": 1,
      "isLegends": false,
      "points": null,
      "rules": [
        {
          "name": "Speed of the Scáthborn",
          "phase": "combatPhase",
          "phaseDetails": "Passive",
          "icon": "offensive",
          "lore": "The Melusai and Khinerai that make up the Vyperic Guard strike at the heart of their enemies with lethal speed and accuracy.",
          "declare": null,
          "effect": "If the unmodified charge roll for a friendly MELUSAI or KHINERAI unit is 8+, that unit has STRIKE-FIRST for the rest of the turn.",
          "cpCost": null,
          "isReaction": false
        }
      ]
    },
    {
      "id": "b1c20686-d111-587d-8b4b-a8733dfea95e",
      "name": "Arena Veterans",
      "cardType": "BattleFormation",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factionTerrainLimit": 1,
      "isLegends": false,
      "points": 20,
      "rules": [
        {
          "name": "Graceful Elusion",
          "phase": "combatPhase",
          "phaseDetails": "Any Combat Phase",
          "icon": "defensive",
          "lore": "Years of combat in the gladiatorial arenas of the temple-cities have honed the survival skills of these aelves to near perfection.",
          "declare": null,
          "effect": "For the rest of the phase, friendly DAUGHTERS OF KHAINE AELF INFANTRY units have WARD (5+) until they have used a FIGHT ability.",
          "cpCost": null,
          "isReaction": false
        }
      ]
    },
    {
      "id": "5ddda3a1-ae8f-5dbf-a3cf-3bddb9a2c7aa",
      "name": "Shadow Patrol",
      "cardType": "BattleFormation",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factionTerrainLimit": 1,
      "isLegends": false,
      "points": null,
      "rules": [
        {
          "name": "Shadowpaths",
          "phase": "movementPhase",
          "phaseDetails": "Once Per Turn (Army), Your Movement Phase",
          "icon": "movement",
          "lore": "Well versed in the secrets of the shadowpaths, these warriors strike where least expected.",
          "declare": "Pick a friendly DAUGHTERS OF KHAINE INFANTRY unit that is not in combat to use this ability.",
          "effect": "Roll a dice. On a 3+, remove that unit from the battlefield and set it up again on the battlefield more than 9\" from all enemy units.",
          "cpCost": null,
          "isReaction": false
        }
      ]
    },
    {
      "id": "948a12bd-9220-59fc-a7e6-8f37f4ab3599",
      "name": "Slaughter Troupe",
      "cardType": "BattleFormation",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factionTerrainLimit": 1,
      "isLegends": false,
      "points": null,
      "rules": [
        {
          "name": "Gladiatorial Acrobatics",
          "phase": "chargePhase",
          "phaseDetails": "Once Per Turn (Army), Reaction: You declared a CHARGE ability for a friendly DAUGHTERS OF KHAINE AELF unit",
          "icon": "movement",
          "lore": "The aelves of a Slaughter Troupe perform breathtaking displays of acrobatics as they close the distance to the foe.",
          "declare": null,
          "effect": "Change one of the dice in the charge roll to a 4.",
          "cpCost": null,
          "isReaction": true
        }
      ]
    },
    {
      "id": "b9992a6b-136b-5e8b-8308-22ac8627331a",
      "name": "Coven Zealots",
      "cardType": "BattleFormation",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factionTerrainLimit": 1,
      "isLegends": false,
      "points": null,
      "rules": [
        {
          "name": "Higher Purpose",
          "phase": "endOfTurn",
          "phaseDetails": "Once Per Turn (Army), End of Any Turn",
          "icon": "rallying",
          "lore": "These aelves fight with a purity of purpose that sees them fight on even in the face of the most horrendous carnage, heedless of their losses.",
          "declare": null,
          "effect": "Return D3 slain models to each friendly DAUGHTERS OF KHAINE AELF INFANTRY unit.",
          "cpCost": null,
          "isReaction": false
        }
      ]
    },
    {
      "id": "66f67961-b05f-5b6e-9026-95e67e630356",
      "name": "Cauldron Guard",
      "cardType": "BattleFormation",
      "source": "aos-4e",
      "faction_id": "DAUGHTERS_OF_KHAINE",
      "factionTerrainLimit": 1,
      "isLegends": false,
      "points": null,
      "rules": [
        {
          "name": "Frenzied Devotees",
          "phase": "endOfTurn",
          "phaseDetails": "Once Per Turn (Army), End of Any Turn",
          "icon": "offensive",
          "lore": "The Cauldron Guard seek to carve a path for their worshipped engines through enemy defences at the earliest opportunity.",
          "declare": "Pick up to 3 friendly DAUGHTERS OF KHAINE INFANTRY or WAR MACHINE units that are in combat to be the targets.",
          "effect": "For each target:\n\n• Make a pile-in move.\n• Then, pick an enemy unit in combat with the target and roll a D3. On a 2+, inflict an amount of mortal damage on that enemy unit equal to the roll.",
          "cpCost": null,
          "isReaction": false
        }
      ]
    }
  ],
  "lores": [],
  "enhancements": {
    "artefacts": [
      {
        "id": "7da98e15-ed8e-5d18-a478-917c876ba1b5",
        "name": "Crown of Woe",
        "cardType": "Enhancement",
        "enhancementType": "artefactsOfPower",
        "source": "aos-4e",
        "points": null,
        "phase": "endOfTurn",
        "phaseDetails": "Passive",
        "icon": "control",
        "lore": "Forged from the cult of Khaine’s first sacrificial altar, an aura of dread surrounds the wearer of this baleful crown.",
        "declare": null,
        "effect": "Subtract 2 from the control scores of enemy units while they are within 9\" of this unit.",
        "cpCost": null
      },
      {
        "id": "4099616b-535a-5a5c-a9df-fffbef780acb",
        "name": "Sevenfold Shadow",
        "cardType": "Enhancement",
        "enhancementType": "artefactsOfPower",
        "source": "aos-4e",
        "points": null,
        "phase": "movementPhase",
        "phaseDetails": "Once Per Battle, Your Movement Phase",
        "icon": "movement",
        "lore": "This hero possesses a living shadow that can, at a command, envelop them and transport them across the shadow realm.",
        "declare": null,
        "effect": "If this unit is not in combat, remove it from the battlefield and set it up again on the battlefield more than 9\" from all enemy units.",
        "cpCost": null,
        "keywords": ["Core"]
      },
      {
        "id": "f1aa0e8e-b6ac-53e1-a983-c76e3b6ed9c4",
        "name": "Khainite Pendant",
        "cardType": "Enhancement",
        "enhancementType": "artefactsOfPower",
        "source": "aos-4e",
        "points": null,
        "phase": "heroPhase",
        "phaseDetails": "Once Per Battle, Your Hero Phase",
        "icon": "special",
        "lore": "The wearer can call for Khaine’s blessing as easily as drawing breath.",
        "declare": "Pick a friendly DAUGHTERS OF KHAINE PRIEST wholly within 12\" of this unit.",
        "effect": "Give that unit D6 ritual points.",
        "cpCost": null
      },
      {
        "id": "bb4fb9b4-bf3b-5276-bccf-3321f30791e2",
        "name": "Blade of Prophetic Doom",
        "cardType": "Enhancement",
        "enhancementType": "artefactsOfPower",
        "source": "aos-4e",
        "points": null,
        "phase": "endOfTurn",
        "phaseDetails": "Once Per Turn, End of Any Turn",
        "icon": "offensive",
        "lore": "Some weapons are in thrall to the grimmest prophecies imaginable, and are fated to cause untold disaster with a single strike.",
        "declare": "Pick an enemy unit in combat with this unit to be the target.",
        "effect": "Roll a dice. On a 2+:\n\n• If the target is not damaged, inflict 1 mortal damage on it.\n• If the target is damaged, inflict an amount of mortal damage on it equal to the roll.",
        "cpCost": null
      }
    ],
    "heroicTraits": [
      {
        "id": "6e931642-719b-54e0-ac9d-7d4dc8f5abcd",
        "name": "Bathed in Blood",
        "cardType": "Enhancement",
        "enhancementType": "heroicTraits",
        "source": "aos-4e",
        "points": null,
        "phase": "endOfTurn",
        "phaseDetails": "End of Any Turn",
        "icon": "defensive",
        "lore": "This hero bathes in gore during battle, granting her healing powers.",
        "declare": null,
        "effect": "Heal (3) this unit if it is in combat.",
        "cpCost": null
      },
      {
        "id": "de1660ac-dd87-5de2-aae7-be4a253ffebf",
        "name": "Master of Poisons",
        "cardType": "Enhancement",
        "enhancementType": "heroicTraits",
        "source": "aos-4e",
        "points": null,
        "phase": "endOfTurn",
        "phaseDetails": "End of Any Turn",
        "icon": "offensive",
        "lore": "This hero has intimate knowledge of all poisons and coats her blades in an elixir that leaves the most hardened warriors weak, debilitated and primed for the killing stroke.",
        "declare": "Pick an enemy unit that had any damage points allocated to it this turn by this unit’s combat attacks to be the target.",
        "effect": "For the rest of the battle:\n\n• The target cannot be healed.\n• Slain models cannot be returned to the target unit.",
        "cpCost": null
      },
      {
        "id": "ec8211ca-08f2-53b6-a651-bb90f4d15e78",
        "name": "Zealous Orator",
        "cardType": "Enhancement",
        "enhancementType": "heroicTraits",
        "source": "aos-4e",
        "points": null,
        "phase": "heroPhase",
        "phaseDetails": "Passive",
        "icon": "rallying",
        "lore": "Your general is a wild demagogue who inspires her followers to fight on in the face of impossible odds.",
        "declare": null,
        "effect": "If a friendly unit wholly within 12\" of this unit uses the ‘Rally’ command, you can make 3 additional rally rolls of D6.",
        "cpCost": null
      },
      {
        "id": "1b92f710-aa33-5a2c-aeea-a996bf13d46f",
        "name": "Proselyte of Morai-Heg",
        "cardType": "Enhancement",
        "enhancementType": "heroicTraits",
        "source": "aos-4e",
        "points": null,
        "phase": "startOfTurn",
        "phaseDetails": "Passive",
        "icon": "special",
        "lore": "This general has heeded the words imparted by Morai-Heg’s vessel and can see the predicted patterns of battle.",
        "declare": null,
        "effect": "Enemy units cannot use commands while they are in combat with this unit.",
        "cpCost": null
      }
    ],
    "other": []
  },
  "terrain": [],
  "rules": {
    "battleTraits": [
      {
        "name": "All-out Slaughter",
        "phase": "combatPhase",
        "phaseDetails": "Once Per Battle, Any Combat Phase",
        "icon": "offensive",
        "lore": "The leaders of the Daughters of Khaine can exhort their warriors to commit acts of terrible slaughter.",
        "declare": "Pick a friendly DAUGHTERS OF KHAINE INFANTRY unit that is in combat to use this ability.",
        "effect": "That unit can use 2 FIGHT abilities this phase. After the first is used, this unit has STRIKE-LAST for the rest of the turn."
      },
      {
        "name": "Blood Rites",
        "phase": "startOfTurn",
        "phaseDetails": "Passive",
        "icon": "special",
        "lore": "Before battle, the Daughters take part in holy rites of bloodletting. With each sacrifice, the faithful are imbued with a fraction of their god’s furious power.",
        "declare": null,
        "effect": "A different effect applies to friendly DAUGHTERS OF KHAINE units each battle round, as shown below. The effects of all previous battle rounds also apply to those units.\n\nBattle Round 1:\nQuickening Bloodlust: Add 1 to run rolls for this unit.\n\nBattle Round 2:\nHeadlong Fury: Add 1 to charge rolls for this unit.\n\nBattle Round 3:\nZealot’s Rage: Add 1 to hit rolls for this unit’s combat attacks.\n\nBattle Round 4:\nSlaughterer’s Wound: Add 1 to wound rolls for this unit’s combat attacks.\n\nBattle Round 5:\nFrenzied Worshippers: Add 1 to the Attacks characteristic of this unit’s melee weapons."
      },
      {
        "name": "Plumes of Auspicious Smoke",
        "phase": "defensive",
        "phaseDetails": "Passive",
        "icon": "defensive",
        "lore": "The mists that spill from the Croneseer’s cauldrons are thick with augury and omen, and those who inhale them are forewarned of imminent danger.",
        "declare": null,
        "effect": "Effect: Friendly CAULDRON OF BLOOD units are either empty or full. They start the battle empty. While a friendly CAULDRON OF BLOOD unit is full:\n\n• That CAULDRON OF BLOOD has WARD (4+) against damage points inflicted by shooting attacks.\n• Subtract 1 from hit rolls for shooting attacks that target friendly CRONESEER’S PARIAHS units while they are wholly within 9\" of that CAULDRON OF BLOOD."
      },
      {
        "name": "Skilled Skirmishers",
        "phase": "chargePhase",
        "phaseDetails": "Once Per Turn (Army), Any Charge Phase",
        "icon": "movement",
        "lore": "Doomfire Warlocks excel in strike-and-fade warfare, evading their foes while unleashing a hail of death.",
        "declare": "Pick a friendly CRONESEER’S PARIAHS CAVALRY unit that has not charged this turn and is in combat with an enemy unit that charged this turn to be the target.",
        "effect": "Roll a dice. On 3+, the target can immediately use a RETREAT ability as if it were your movement phase. In addition, no mortal damage is inflicted on the target by that RETREAT ability."
      },
      {
        "name": "Guided by Morai-Heg",
        "phase": "combatPhase",
        "phaseDetails": "Passive",
        "icon": "offensive",
        "lore": "Morai-Heg guides her followers’ weapons into subtle chinks in the enemy’s armour.",
        "declare": null,
        "effect": "Add 1 to the Rend characteristic of combat attacks made by friendly non-HERO INFANTRY units while they are wholly within 9\" of a friendly Krethusa."
      },
      {
        "name": "The Blood Reveals All",
        "phase": "heroPhase",
        "phaseDetails": "Once Per Battle (Army), Your Hero Phase",
        "icon": "special",
        "lore": "It matters not from which body the entrails are taken.",
        "declare": "Pick a friendly CRONESEER’S PARIAHS HERO within the combat range of a friendly empty CAULDRON OF BLOOD. Then, pick another unit within the combat range of that HERO to be the target.",
        "effect": "Roll a dice. Allocate a number of damage points to the target equal to the roll (ward rolls cannot be made for those damage points). Then, that CAULDRON OF BLOOD becomes full."
      },
      {
        "name": "Laden with Prophecy",
        "phase": "endOfTurn",
        "phaseDetails": "End of Any Turn",
        "icon": "special",
        "lore": "The viscera collected in a Cauldron of Blood and burned to enhance Krethusa’s haruspicy shroud all those nearby in a blood-tinged pall.",
        "declare": "Pick a friendly empty CAULDRON OF BLOOD.",
        "effect": "If any enemy models were slain this turn by that CAULDRON OF BLOOD’s combat attacks, it becomes full."
      }
    ]
  }
}
