{
  "id": "DISCIPLES_OF_TZEENTCH",
  "name": "Disciples of Tzeentch",
  "grandAlliance": "Chaos",
  "parentFaction": null,
  "isLegends": false,
  "colours": {
    "banner": "#6B1C23",
    "header": "#8B2830"
  },
  "updated": "2025-12-04T20:35:11.889Z",
  "compatibleDataVersion": 363,
  "warscrolls": [
    {
      "id": "263d0c27-548a-5d2d-bb2e-09d43c9aafa9",
      "name": "Blue Horrors and Brimstone Horrors",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": ["Daemon", "Infantry", "Ward (6+)"],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "Horrors are the bizarre lesser daemons of Tzeentch. They twirl and caper as they cross the field, warbling nonsense rhymes and shooting wyrdflame from unnaturally elongated fingers. These fires of mutation freeze and twist, elongate and temporally displace, turn flesh to glass and turn bone to porous sponge. Horrors find cruel mirth in wielding these arcane projectiles against Tzeentch’s enemies, observing the unpredictable results with fascination.\n\nThough they are nonsensical beings, there is a crazed logic to the hierarchy of the Horrors. The largest are the Pink Horrors, the most jovial and arcanely talented of their infernal breed. Should a Pink Horror receive a telling wound, they will gasp dramatically before coming apart in a burst of ectoplasm. In its place are two smaller daemons known as Blue Horrors. These are more bitter and sullen but can unleash barrages of magic regardless. When a Blue Horror is slain, blazing imps known as Brimstone Horrors spring up. These diminutive daemons are the most vindictive breed of Horror. Lacking in higher thought and prone to burning themselves out rapidly, they swarm towards enemies with cackles of malice, intent on setting alight cloth and flesh.",
      "referenceKeywords": "Infantry, Ward (6+), Chaos, Disciples of Tzeentch, Daemon",
      "stats": {
        "move": "6\"",
        "save": "6+",
        "control": "1",
        "health": "1",
        "ward": "6+"
      },
      "points": 140,
      "modelCount": 10,
      "baseSize": "25mm",
      "cannotBeReinforced": false,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Arcane Flames",
            "type": "ranged",
            "range": "12\"",
            "attacks": "2",
            "hit": "4+",
            "wound": "4+",
            "rend": "-",
            "damage": "1",
            "abilities": ["Wyrdflame"]
          }
        ],
        "melee": [
          {
            "name": "Impish Talons",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "4+",
            "wound": "5+",
            "rend": "-",
            "damage": "1",
            "abilities": []
          },
          {
            "name": "Spiteful Talons",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "4+",
            "wound": "4+",
            "rend": "-",
            "damage": "1",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Split Again",
          "phase": "startOfTurn",
          "phaseDetails": "Passive",
          "icon": "rallying",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Should a Blue Horror meet its end at the hands of the enemy, it is capable of splitting itself into two lesser daemons.",
          "declare": null,
          "effect": "Each time a Blue Horror model in this unit is slain, before removing the model from play, roll a dice. On a 3+, you can add 1 Brimstone Horrors model to this unit.\n\nDesigner’s Note: You cannot have more than 10 Blue Horror models and 10 Brimstone Horrors models in a non-reinforced unit. You cannot have more than 20 Blue Horror models and 20 Brimstone Horrors models in a reinforced unit."
        }
      ],
      "notes": null
    },
    {
      "id": "eb930249-cbea-519f-b305-441da0904f51",
      "name": "Burning Chariot of Tzeentch",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": ["Daemon", "War Machine", "Ward (6+)", "Fly"],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "In rare instances, a Flamer will prove capable of independent thought. Likely this is in accordance with some whim of Tzeentch’s, though the Change God’s designs elude even his most favoured subjects. These daemons are known as Exalted Flamers. They are the champions of their kind, exuding sorcery from every pore of their sponge-like flesh.\n\nThough they possess greater intellect than their lesser kin, Exalted Flamers are still utterly mad, too consumed by pyromania to care for following orders. Other daemons must simply trust that these entities’ fiery urges will serve Tzeentch’s schemes in time. Even so, there are occasions in which an Exalted Flamer must be conveyed to a specific point or have its already destructive capabilities heightened. In these instances, a chariot will be prepared, formed of sorcery and bound daemons. In the wake of a Burning Chariot follows the very fires of change – fires that are stoked by the presence of the Exalted Flamer. While typically content to kill at range, Exalted Flamers also take a giddy glee in directing their carriage into a dive, swooping across enemy formations and leaving behind a wreckage of charred, twisted flesh.",
      "referenceKeywords": "War Machine, Fly, Ward (6+), Chaos, Disciples of Tzeentch, Daemon",
      "stats": {
        "move": "12\"",
        "save": "5+",
        "control": "2",
        "health": "6",
        "ward": "6+"
      },
      "points": 100,
      "modelCount": 1,
      "baseSize": "120 x 92mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Wyrdflame Blast",
            "type": "ranged",
            "range": "16\"",
            "attacks": "4",
            "hit": "3+",
            "wound": "4+",
            "rend": "-",
            "damage": "D3",
            "abilities": ["Anti-INFANTRY (+1 Rend)", "Wyrdflame"]
          }
        ],
        "melee": [
          {
            "name": "Flaming Maws and Blue Horrors’ Jabs",
            "type": "melee",
            "range": null,
            "attacks": "6",
            "hit": "4+",
            "wound": "3+",
            "rend": "-",
            "damage": "1",
            "abilities": []
          },
          {
            "name": "Screamers’ Lamprey Bites",
            "type": "melee",
            "range": null,
            "attacks": "6",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "1",
            "abilities": ["Anti-MONSTER (+1 Rend)", "Companion"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Wake of Fire",
          "phase": "movementPhase",
          "phaseDetails": "Your Movement Phase",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Enemies unfortunate enough to be passed by a Burning Chariot are consumed by waves of unnatural fire.",
          "declare": "Pick an enemy unit that this unit passed across this phase to be the target.",
          "effect": "Roll a dice. On a 3+, the target has the BURNING keyword."
        }
      ],
      "notes": null
    },
    {
      "id": "9b7bd8d0-70b2-561f-b0c4-58a74165fd63",
      "name": "Burning Sigil of Tzeentch",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": ["Manifestation", "Endless Spell", "Ward (6+)"],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "Burning Sigils are loci of transmogrification. Formed from the energies of Tzeentch’s labyrinth, they take the form of the god’s flowing flame-sigil, dripping with burning ectoplasm and subjecting all in their vicinity to uncontrollable mutation. In the presence of a Burning Sigil, eyes turn into claws and tongues split into manifold lashing probosces. Legs transform into gangly, boneless arms and bodies turn inside-out, organs pulsating ghoulishly in the wind. So potent is the aura of change that these Sigils exude that magic itself goes awry in their proximity, devolving into a primordial sludge for the Disciples of Tzeentch to better craft with.\n\nWithin the hidden sanctums of the Arcanite cults, lesser Burning Sigils are used as a form of defence. Only those with Tzeentch’s fickle favour can endure their mutating presence; outsiders are liable to be reduced to gibbering lumps of flesh before they can speak of what they have discovered. In battle, Burning Sigils are often conjured atop nexuses of geomantic power, inundating these natural magical nodes with Tzeentch’s touch. Those who would claim the nearby lands must brave the Sigil’s presence and attempt to banish it – before their own flesh betrays them and comes undone.",
      "referenceKeywords": "Manifestation, Endless Spell, Ward (6+), Chaos, Disciples of Tzeentch",
      "stats": {
        "move": "-",
        "save": "5+",
        "control": "7+",
        "health": "6",
        "ward": "6+"
      },
      "points": null,
      "modelCount": 1,
      "baseSize": "50mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {},
      "abilities": [
        {
          "name": "Radiant Transmogrification",
          "phase": "heroPhase",
          "phaseDetails": "Any Hero Phase",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The Burning Sigil channels the energies of the Impossible Fortress; with each pulse comes a handful of blessings and curses as fickle as the bastion’s master.",
          "declare": "This MANIFESTATION must use this ability in each hero phase. Pick each unit (friendly and enemy) within 9\" of this MANIFESTATION to be the targets.",
          "effect": "Roll 2 dice, pick either result, then apply the corresponding effect for the rest of the turn:\n\n1: No effect.\n\n2‐3: Add 2\" to the Move characteristic of friendly DISCIPLES OF TZEENTCH targets and subtract 2\" from the Move characteristic of enemy targets.\n\n4: Add 1 to hit rolls for friendly DISCIPLES OF TZEENTCH targets and subtract 1 from hit rolls for enemy targets.\n\n5: Add 1 to wound rolls for friendly DISCIPLES OF TZEENTCH targets and subtract 1 from wound rolls for enemy targets.\n\n6: Add 1 to the Attacks characteristic of melee weapons used by friendly DISCIPLES OF TZEENTCH targets and inflict D3 mortal damage on each enemy target."
        }
      ],
      "notes": null
    },
    {
      "id": "71ac3fa0-ab2c-5585-848f-6f91f831366f",
      "name": "Changecaster, Herald of Tzeentch",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": [
        "Daemon",
        "Wizard",
        "Infantry",
        "Ward (6+)",
        "Tzeentchian Deceiver",
        "Hero"
      ],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "Heralds of Tzeentch are the captains of the Change God’s scintillating hosts. These daemons have been granted greater individuality and command of magic than the gibbering Horror masses, though ultimately they remain nothing but pawns in Tzeentch’s schemes. There are numerous different ranks of Herald, each with a role to play in their master’s ineffable designs. Obsessed with showing off their status and outdoing their rivals, Heralds of Tzeentch festoon themselves with arcane tomes and trinkets, relics scrounged from the archives of the Impossible Fortress and leaden with magic.\n\nChangecasters are the lowliest form of Herald, charged with corralling packs of daemonic Horrors into something approaching a battleline. The difficulties of this task grate on even an immortal, ensuring that Changecasters have a bitter disposition assuaged only through acts of magical destruction. These Heralds are natural sorcerers and powerful loci of fell energy, capable of bathing enemies in mutagenic wyrdflame that sees their limbs agonisingly split, their flesh turn inside out or some other form of lethal unravelling overcome them. Yet Changecasters command little respect from their fellow Heralds, largely because they must suffer the indignity of walking upon the dull and constant surface of the realms.",
      "referenceKeywords": "Hero, Wizard (1), Infantry, Ward (6+), Chaos, Disciples of Tzeentch, Daemon",
      "stats": {
        "move": "5\"",
        "save": "6+",
        "control": "2",
        "health": "5",
        "ward": "6+"
      },
      "points": 110,
      "modelCount": 1,
      "baseSize": "32mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Iridescent Flames",
            "type": "ranged",
            "range": "12\"",
            "attacks": "3",
            "hit": "4+",
            "wound": "4+",
            "rend": "1",
            "damage": "D3",
            "abilities": ["Wyrdflame"]
          }
        ],
        "melee": [
          {
            "name": "Staff of Change and Ritual Dagger",
            "type": "melee",
            "range": null,
            "attacks": "3",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "D3",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Lurid Flames",
          "phase": "combatPhase",
          "phaseDetails": "Passive",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The Heralds known as Changecasters summon the lurid flames of Tzeentch to engulf their foes. These screaming, living torches are thus marked as the next targets to be annihilated by the Change God’s faithful.",
          "declare": null,
          "effect": "Add 1 to hit rolls for combat attacks made by friendly units that target a BURNING enemy unit within 12\" of this unit."
        },
        {
          "name": "Daemonic Locus",
          "phase": "heroPhase",
          "phaseDetails": "Passive",
          "icon": "rallying",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Daemons are drawn to a Changecaster’s arcane aura.",
          "declare": null,
          "effect": "Each time a friendly DISCIPLES OF TZEENTCH DAEMON unit wholly within 12\" of this unit uses the ‘Rally’ command, you can make 3 additional rally rolls of D6."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "requiredKeywords": ["Daemon"],
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "438342fe-0c76-5528-8c55-94747ebde044",
      "name": "Chaos Spawn of Tzeentch",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": ["Beast"],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "Anyone who walks the Path to Glory risks becoming a grotesque Chaos Spawn. Distorted by a critical mass of mutative ‘gifts’, hardly anything of their former self is recognisable – perhaps only the twisted vestiges of what was once their face, mouth distended in a permanent scream of horror. In some cases, only the mind remains terribly aware, trapped in its prison of roiling flesh.\n\nSpawn are possessed of a monstrous strength, able to rip flesh and tear limbs from bodies with each of their multi-jointed appendages or grasping pseudopods. They fight erratically, as likely to slither and slump as to thrash and maim. Whichever instinct seizes them, they cause bloody carnage with no thought for their own self-preservation – almost as if they wish to be put out of their misery.\n\nArcanites often keep packs of gibbering Spawn within their hidden sanctums, ready to unleash against any who trespass in the cult’s abode. These abominations were created through Tzeentch’s fell blessings, and his magic now sustains them. They instinctively flock to the most gifted sorcerers, bathing in the esoteric energies conjured by their spellcraft and forming a wall of thrashing flesh to bar any who would harm the Great Conspirator’s chosen.",
      "referenceKeywords": "Beast, Chaos, Disciples of Tzeentch",
      "stats": {
        "move": "2D6\"",
        "save": "5+",
        "control": "1",
        "health": "5",
        "ward": null
      },
      "points": 60,
      "modelCount": 1,
      "baseSize": "50mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Freakish Mutations",
            "type": "melee",
            "range": null,
            "attacks": "2D6",
            "hit": "5+",
            "wound": "4+",
            "rend": "-",
            "damage": "1",
            "abilities": ["Crit (2 Hits)", "Companion"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Beast",
          "phase": "endOfTurn",
          "phaseDetails": "Passive",
          "icon": "control",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": null,
          "declare": null,
          "effect": "This unit has a maximum control score of 1."
        },
        {
          "name": "Waves of Mutation",
          "phase": "startOfTurn",
          "phaseDetails": "Passive",
          "icon": "rallying",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "There is no limit to Tzeentch’s appetite for change.",
          "declare": null,
          "effect": "Each friendly Chaos Spawn of Tzeentch unit can be replaced any number of times."
        },
        {
          "name": "A Twisted Fate",
          "phase": "startOfTurn",
          "phaseDetails": "Deployment Phase",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "For some, their destiny is to become a mewling abomination – they just do not know it yet.",
          "declare": null,
          "effect": "Set up this unit in reserve as a potential fate. It has now been deployed.\n\nDesigner’s Note: If deployed using this ability, this unit can only be set up on the battlefield using the ‘Transformed to Spawn’ spell.",
          "keywords": ["Deploy"]
        }
      ],
      "notes": null
    },
    {
      "id": "193cea0c-941a-5e2a-b56d-95813d58fc84",
      "name": "Curseling, Eye of Tzeentch",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": [
        "Wizard",
        "Arcanite Cabalist",
        "Infantry",
        "Arcanite",
        "Hero"
      ],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "Curselings are grotesque bipartite entities who bartered their very being for eldritch truths. Should a pact be struck, a strange lump appears on their form, growing more pronounced over nights of disorienting pain. From pallid skin grows a ruff of scintillating feathers and an eyeless head, thin limbs twitching and gesticulating.\n\nThis homunculus-creature is a Tretchlet, a lesser daemon-form that allows a measure of Tzeentch’s will to possess its host. In return for a mortal anchor to bind it to the realms, they provide the Curseling the intuition to discern truth from falsehood. Those who would slay this peculiar double creature at close quarters find themselves thwarted by the strong sword arm of the host, a formidable warrior in their own right.\n\nCurselings are thieves of the arcane, loathed by those gifted in spellcraft. Yet their existence is a fraught one. Tretchlets are conniving entities, forever scheming to seize control of their host. Should the Curseling not remain on guard, they may find themselves trapped within their own mind, forced to watch as the Tretchlet puppets them onwards.",
      "referenceKeywords": "Hero, Wizard (2), Infantry, Chaos, Disciples of Tzeentch, Arcanite",
      "stats": {
        "move": "5\"",
        "save": "3+",
        "control": "2",
        "health": "6",
        "ward": null
      },
      "points": 140,
      "modelCount": 1,
      "baseSize": "32mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Hurled Arcane Energy",
            "type": "ranged",
            "range": "18\"",
            "attacks": "D6",
            "hit": "3+",
            "wound": "3+",
            "rend": "1",
            "damage": "1",
            "abilities": ["Wyrdflame"]
          }
        ],
        "melee": [
          {
            "name": "Staff of Tzeentch and Blazing Sword",
            "type": "melee",
            "range": null,
            "attacks": "5",
            "hit": "4+",
            "wound": "4+",
            "rend": "1",
            "damage": "2",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Infusion Arcanum",
          "phase": "heroPhase",
          "phaseDetails": "Your Hero Phase",
          "icon": "offensive",
          "castingValue": 5,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The sorcerer’s body becomes saturated with death-dealing energies, transforming even the frailest warlock into a truly formidable adversary.",
          "declare": "Make a casting roll of 2D6.",
          "effect": "Until the start of your next turn, add 1 to the Rend and Damage characteristics of this unit’s Staff of Tzeentch and Blazing Sword.",
          "keywords": ["Spell"]
        },
        {
          "name": "Disrupter of the Arcane",
          "phase": "heroPhase",
          "phaseDetails": "Passive",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "A Curseling can reach into a spell and undo the magical forces that keep it whole.",
          "declare": null,
          "effect": "Each time this unit unbinds a spell, roll a dice. On a 4+, subtract 1 from the power level of the enemy WIZARD that used that SPELL ability, to a minimum of 0, until the start of your next turn."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "requiredKeywords": ["Arcanite"],
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "653f2683-832f-589f-8961-ef2d347bb5ff",
      "name": "Daemonic Simulacrum",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": ["Manifestation", "Endless Spell", "Ward (6+)", "Fly"],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "Though it appears as a snapping, screeching terror, a Daemonic Simulacrum is not a true daemon. Rather, these endless spells are reflections of the Lords of Change, captured in the mirrored walls of Tzeentch’s Impossible Fortress and beckoned into the realms through eldritch spellcraft. They manifest as a shimmering wheel of fire that distends into the avian heads of the greater daemon, its beaks dripping with the liquid stuff of Chaos and change.\n\nWithin each Daemonic Simulacrum lingers the hunger of its infernal counterpart – a hunger for souls, minds and, above all, the power of the arcane. As these spell-constructs cross the battlefield, their jaws snap at any prey in range, tearing out portions of their essence and channelling it back into Tzeentch’s domain. The scent of a wizard’s soul is most pleasing of all, driving the Simulacrum to new extremes of snapping ferocity.\n\nArcanite sorcerers will offer much of their souls for the ability to invoke a Daemonic Simulacrum. Few realise that the greater daemons peer through the eyes of a Simulacrum, observing events in the Mortal Realms from a calculated distance and delighting in how their puppets dance.",
      "referenceKeywords": "Manifestation, Endless Spell, Fly, Ward (6+), Chaos, Disciples of Tzeentch",
      "stats": {
        "move": "9\"",
        "save": "6+",
        "control": "7+",
        "health": "8",
        "ward": "6+"
      },
      "points": null,
      "modelCount": 1,
      "baseSize": "105 x 70mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Snapping Jaws",
            "type": "melee",
            "range": null,
            "attacks": "4",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "D3",
            "abilities": ["Anti-WIZARD (+1 Rend)"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Manifested Jaws",
          "phase": "combatPhase",
          "phaseDetails": "Passive",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The Simulacrum feeds upon the minds of any beings in its path and is especially drawn to sources of the arcane.",
          "declare": null,
          "effect": "While this MANIFESTATION’s attacks target a WIZARD, add a number equal to that WIZARD’s casting power level to the Damage characteristic of this unit’s Snapping Jaws."
        }
      ],
      "notes": null
    },
    {
      "id": "08416016-7ede-5401-9dd9-89d4ed3cfd48",
      "name": "Ephilim's Pandaemonium",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": [
        "Champion",
        "Daemon",
        "Wizard",
        "Unique",
        "Infantry",
        "Ward (6+)"
      ],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "Once the servant of a Gaunt Summoner, Ephilim bears the impossible task of cataloguing every conceivable permutation of Tzeentchian daemon. Accompanied by their infernal Pandaemonium, they now search the realms for nexuses of change-magic, where their sorcery can coax even stranger daemons into being. From the pyromaniacal Kindlefinger to the piscine Apo’trax and the avian Flamespooler to the hound-thing known as Spawnmaw, the daemons bound to Ephilim are utterly bizarre in form.",
      "referenceKeywords": "Unique, Wizard (1), Infantry, Champion, Ward (6+), Chaos, Disciples of Tzeentch, Daemon",
      "stats": {
        "move": "6\"",
        "save": "6+",
        "control": "1",
        "health": "2",
        "ward": "6+"
      },
      "points": 100,
      "modelCount": 5,
      "baseSize": "32mm [3], 25mm [2]",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Warping Wyrdfire",
            "type": "ranged",
            "range": "12\"",
            "attacks": "2",
            "hit": "4+",
            "wound": "4+",
            "rend": "-",
            "damage": "1",
            "abilities": ["Wyrdflame", "Anti-UNIQUE (+1 Rend)"]
          }
        ],
        "melee": [
          {
            "name": "Daemonic Talons",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "4+",
            "wound": "5+",
            "rend": "-",
            "damage": "1",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Keeper of the Pandaemonium",
          "phase": "endOfTurn",
          "phaseDetails": "End of Any Turn",
          "icon": "rallying",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "With a flick of their wrist, Ephilim can summon those daemons they have catalogued to their side in an instant.",
          "declare": null,
          "effect": "You can return D3 slain models to this unit."
        },
        {
          "name": "Power Leech",
          "phase": "shootingPhase",
          "phaseDetails": "Once Per Turn, Any Shooting Phase",
          "icon": "shooting",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Ephilim has the ability to drain magical power from their minions.",
          "declare": null,
          "effect": "Roll a D3. Allocate a number of damage points to this unit equal to the roll (ward rolls cannot be made for those damage points). Then, add 2 to the Attacks characteristic of this unit’s ranged weapons for the rest of the turn."
        }
      ],
      "notes": null
    },
    {
      "id": "4276fa81-40dd-578c-81a4-27fa421d0767",
      "name": "Exalted Flamer of Tzeentch",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": ["Daemon", "Infantry", "Ward (6+)", "Fly"],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "In rare instances, a Flamer will prove capable of independent thought. Likely this is in accordance with some whim of Tzeentch’s, though the Change God’s designs elude even his most favoured subjects. These daemons are known as Exalted Flamers. They are the champions of their kind, exuding sorcery from every pore of their sponge-like flesh.\n\nThe fires conjured into being by an Exalted Flamer are even more pernicious than those of most Tzeentchian daemons. They do not simply burn out once sated; shapes and figures seem to flicker in their depths, and it is far from unknown for them to seemingly extinguish before suddenly bursting into being once more. This often comes as a terminal shock to enemies who had believed that they had passed through the inferno intact, only to be suddenly overcome and burnt to death by fire-spirits that were waiting for the moment they deemed most cruelly entertaining. Other fire-conjuring daemons are inexorably drawn to Exalted Flamers, revelling in the grand blazes that these aberrations can unleash. Arcane blazes rage far more intensely in their presence, seeming only to grow in strength the more desperately a foe tries to smother them.",
      "referenceKeywords": "Infantry, Fly, Ward (6+), Chaos, Disciples of Tzeentch, Daemon",
      "stats": {
        "move": "9\"",
        "save": "5+",
        "control": "1",
        "health": "4",
        "ward": "6+"
      },
      "points": 90,
      "modelCount": 1,
      "baseSize": "75 x 42mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Wyrdflame Blast",
            "type": "ranged",
            "range": "16\"",
            "attacks": "4",
            "hit": "3+",
            "wound": "4+",
            "rend": "-",
            "damage": "D3",
            "abilities": ["Anti-INFANTRY (+1 Rend)", "Wyrdflame"]
          }
        ],
        "melee": [
          {
            "name": "Flaming Maws",
            "type": "melee",
            "range": null,
            "attacks": "3",
            "hit": "3+",
            "wound": "4+",
            "rend": "-",
            "damage": "1",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Transmogrifying Beacon",
          "phase": "shootingPhase",
          "phaseDetails": "Once Per Turn (Army), Your Shooting Phase",
          "icon": "shooting",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Wyrdflame shimmers and crackles around an Exalted Flamer, empowering those daemons who draw upon such energies.",
          "declare": "Pick another friendly Exalted Flamer of Tzeentch or Flamers of Tzeentch unit within this unit’s combat range to be the target.",
          "effect": "Roll a dice. On a 3+, the target’s ranged weapons have Crit (2 Hits) for the rest of the turn."
        },
        {
          "name": "Capricious Wyrdflame",
          "phase": "shootingPhase",
          "phaseDetails": "Passive",
          "icon": "shooting",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The mutagenic fires expelled by Flamers are most drawn to those already ablaze with the potential for change.",
          "declare": null,
          "effect": "Add 1 to wound rolls for this unit’s shooting attacks that target a BURNING enemy unit."
        }
      ],
      "notes": null
    },
    {
      "id": "57dc5b19-4f86-5b77-9022-82d34650c2fd",
      "name": "Eyes of the Nine",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": ["Champion", "Wizard", "Unique", "Infantry", "Arcanite"],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "Vortemis has been instrumental in twisting the strands of fate to serve the will of Tzeentch. His Arcanite Cult had spies in the city of Shadespire for centuries, and he has plotted to undermine Nagash for just as long. Agents of the Gaunt Summoners, the Eyes of the Nine seek out artefacts redolent with realm magics that they can corrupt with Tzeentchian energy. With these ensorcelled lodestones, they intend to tether the Silver Towers to reality.",
      "referenceKeywords": "Unique, Infantry, Champion, Chaos, Disciples of Tzeentch, Arcanite",
      "stats": {
        "move": "5\"",
        "save": "5+",
        "control": "1",
        "health": "2",
        "ward": null
      },
      "points": 100,
      "modelCount": 5,
      "baseSize": "32mm [4], 25mm [2]",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Mighty Sorcerous Bolt",
            "type": "ranged",
            "range": "18\"",
            "attacks": "1",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "1",
            "abilities": ["Wyrdflame"]
          }
        ],
        "melee": [
          {
            "name": "Mighty Sorcerous Bolt",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "4+",
            "wound": "4+",
            "rend": "-",
            "damage": "1",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Brimstone Horror",
          "phase": "startOfTurn",
          "phaseDetails": "Passive",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "If the Blue Horror is slain, it transforms into a pair of capering Brimstone Horrors.",
          "declare": null,
          "effect": "This unit’s Brimstone Horror is a token. When this unit’s Blue Horror is slain, place this unit’s Brimstone Horror on the battlefield. Add 1 to the Damage characteristic of this unit’s Mighty Sorcerous Bolt while its Brimstone Horror is on the battlefield. If you make an unmodified save roll of 1 for this unit, remove this unit’s Brimstone Horror from the battlefield."
        },
        {
          "name": "Vortemis the All-seeing",
          "phase": "heroPhase",
          "phaseDetails": "Passive",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "No greater practitioners of the arcane arts are there than the Magisters of Tzeentch.",
          "declare": null,
          "effect": "While this unit’s Vortemis the All-seeing is on the battlefield, it has WIZARD (1)."
        }
      ],
      "notes": null
    },
    {
      "id": "a9c14c2e-499e-5bab-95b6-589014b2d346",
      "name": "Fatemaster",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": ["Disc of Tzeentch", "Fly", "Cavalry", "Arcanite", "Hero"],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "More than just a powerful warrior, a Fatemaster is surrounded by an aura of change. Mounted atop Discs of Tzeentch, Fatemasters streak into combat, slicing foes with their fireglaives while manipulating fortune for the benefit of their Arcanite cult.",
      "referenceKeywords": "Hero, Cavalry, Fly, Chaos, Disciples of Tzeentch, Arcanite, Disc of Tzeentch",
      "stats": {
        "move": "14\"",
        "save": "4+",
        "control": "2",
        "health": "5",
        "ward": null
      },
      "points": 160,
      "modelCount": 1,
      "baseSize": "60mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Disc’s Teeth and Horns",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "D3",
            "abilities": ["Companion"]
          },
          {
            "name": "Fireglaive of Tzeentch",
            "type": "melee",
            "range": null,
            "attacks": "3",
            "hit": "3+",
            "wound": "3+",
            "rend": "1",
            "damage": "D3",
            "abilities": ["Wyrdflame"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Soulbound Shield",
          "phase": "heroPhase",
          "phaseDetails": "Reaction: Opponent declared a SPELL ability",
          "icon": "defensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": true,
          "lore": "This shield can shelter the wielder against even the most potent magical attacks.",
          "declare": null,
          "effect": "If this unit was picked to be the target of that spell, roll a dice. On a 4+, ignore the effect of that spell on this unit. This unit can use this ability more than once per phase but only once per SPELL ability."
        },
        {
          "name": "Lord of Fate",
          "phase": "combatPhase",
          "phaseDetails": "Passive",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Tzeentch’s chosen disciples can affect the destiny of those around them.",
          "declare": null,
          "effect": "Add 1 to wound rolls for attacks made by friendly ARCANITE units while they are wholly within 12\" of this unit."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "requiredKeywords": ["Arcanite Cabalist"],
          "linkedWarscroll": null
        },
        {
          "points": null,
          "requiredKeywords": ["Arcanite"],
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "dfb8cb1a-c4dd-5a41-b063-554dfd1ec0c1",
      "name": "Fateskimmer, Herald of Tzeentch on Burning Chariot",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": [
        "Daemon",
        "War Machine",
        "Wizard",
        "Ward (6+)",
        "Fly",
        "Hero"
      ],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "Heralds of Tzeentch are the captains of the Change God’s scintillating hosts. These daemons have been granted greater individuality and command of magic than the gibbering Horror masses, though ultimately they remain nothing but pawns in Tzeentch’s schemes. There are numerous different ranks of Herald, each with a role to play in their master’s ineffable designs. Obsessed with showing off their status and outdoing their rivals, Heralds of Tzeentch festoon themselves with arcane tomes and trinkets, relics scrounged from the archives of the Impossible Fortress and leaden with magic.\n\nFateskimmers are Heralds that have, through acts of particular deviousness, earned the right to ride a Burning Chariot. Borne upon a Disc of Tzeentch pulled by a pair of captive Screamers, they rain arcane destruction from on high, hurling spells, hexes and firestorms selected from their favoured eldritch tomes. Cautious and controlling Fateskimmers prefer to lurk upon the battle’s edge, screeching orders while conjuring streams of wyrdflame. Yet some Fateskimmers – those who believe that destiny often requires more deliberate shunts – cannot resist the thrill of smashing their bladed contraption into the enemy, delighting in the rain of blood and severed body parts that such a collision throws up.",
      "referenceKeywords": "Hero, War Machine, Wizard (1), Fly, Ward (6+), Chaos, Disciples of Tzeentch, Daemon",
      "stats": {
        "move": "12\"",
        "save": "5+",
        "control": "2",
        "health": "8",
        "ward": "6+"
      },
      "points": 130,
      "modelCount": 1,
      "baseSize": "120 x 92mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Iridescent Flames",
            "type": "ranged",
            "range": "12\"",
            "attacks": "3",
            "hit": "4+",
            "wound": "4+",
            "rend": "1",
            "damage": "D3",
            "abilities": ["Wyrdflame"]
          }
        ],
        "melee": [
          {
            "name": "Staff of Change and Ritual Dagger",
            "type": "melee",
            "range": null,
            "attacks": "3",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "D3",
            "abilities": []
          },
          {
            "name": "Screamers’ Lamprey Bites",
            "type": "melee",
            "range": null,
            "attacks": "6",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "1",
            "abilities": ["Anti-MONSTER (+1 Rend)", "Companion"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Fuelling the Inferno",
          "phase": "endOfTurn",
          "phaseDetails": "End of Any Turn",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The mere presence of a Fateskimmer causes wyrdflame to blaze brightly.",
          "declare": "Pick up to 3 BURNING enemy units within 12\" of this unit to be the targets.",
          "effect": "Inflict 1 mortal damage on each target."
        },
        {
          "name": "Wake of Fire",
          "phase": "movementPhase",
          "phaseDetails": "Your Movement Phase",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Enemies unfortunate enough to be passed by a Burning Chariot are consumed by waves of unnatural fire.",
          "declare": "Pick an enemy unit that this unit passed across this phase to be the target.",
          "effect": "Roll a dice. On a 3+, the target has the BURNING keyword."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "requiredKeywords": ["Tzeentchian Deceiver"],
          "linkedWarscroll": null
        },
        {
          "points": null,
          "requiredKeywords": ["Daemon"],
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "d2ef9ca9-97c6-591d-b7c4-65fb337aedba",
      "name": "Flamers of Tzeentch",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": ["Champion", "Daemon", "Infantry", "Ward (6+)", "Fly"],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "Flamers may well be the most physically bizarre of Tzeentch’s daemonic underlings. Tentacles writhe and twitch across their tubular bodies, and their long arms end in webbed digits that are wreathed in auras of wyrdflame. Across their roiling flesh sprout grimacing, mocking faces and gnashing mouths that constantly squeal in a dreadful cacophony. Flamers do not possess legs; instead, they have a strange skirt of frilled flesh that undulates and inflates, drawing in both hot air and motes of aether before expelling them to propel the daemons forwards with ungainly haste.\n\nSo eldritch are the Flamers that they possess little active malice, but this makes them no less dangerous. A Flamer’s arms can be swung with bone-cracking force, but worse are the streams of warping flame they exude. Any being, be they mortal or immortal, caught in these clouds of raw Chaos energy is doomed to be wracked by the energies of change. All manner of horrific mutations overcome them, their form twisting and twisting again as the Flamers continue their inane gibbering. There are even accounts of some unfortunates travelling backwards in time or collapsing into a swarm of homunculus-esque doppelgängers that screech in pain before burning to a crisp.",
      "referenceKeywords": "Infantry, Champion, Fly, Ward (6+), Chaos, Disciples of Tzeentch, Daemon",
      "stats": {
        "move": "9\"",
        "save": "5+",
        "control": "1",
        "health": "2",
        "ward": "6+"
      },
      "points": 120,
      "modelCount": 3,
      "baseSize": "32mm",
      "cannotBeReinforced": false,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Warping Flames",
            "type": "ranged",
            "range": "12\"",
            "attacks": "3",
            "hit": "3+",
            "wound": "4+",
            "rend": "-",
            "damage": "D3",
            "abilities": ["Anti-INFANTRY (+1 Rend)", "Wyrdflame"]
          }
        ],
        "melee": [
          {
            "name": "Flaming Maws",
            "type": "melee",
            "range": null,
            "attacks": "3",
            "hit": "3+",
            "wound": "4+",
            "rend": "-",
            "damage": "1",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Capricious Wyrdflame",
          "phase": "shootingPhase",
          "phaseDetails": "Passive",
          "icon": "shooting",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The mutagenic fires expelled by Flamers are most drawn to those already ablaze with the potential for change.",
          "declare": null,
          "effect": "Add 1 to wound rolls for this unit’s shooting attacks that target a BURNING enemy unit."
        }
      ],
      "notes": null
    },
    {
      "id": "5435e4d2-dbf7-5a43-bc13-4fd0a13ded20",
      "name": "Fluxmaster, Herald of Tzeentch on Disc",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": [
        "Daemon",
        "Wizard",
        "Disc of Tzeentch",
        "Ward (6+)",
        "Fly",
        "Cavalry",
        "Hero"
      ],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "There is nowhere on the battlefield safe from a Herald riding a Disc of Tzeentch. Bolting through the air, the Fluxmaster conjures blue flames to hurl at the foe before darting in to deliver a swift blow from a mutative Staff of Change.",
      "referenceKeywords": "Hero, Wizard (1), Cavalry, Fly, Ward (6+), Chaos, Disciples of Tzeentch, Daemon, Disc of Tzeentch",
      "stats": {
        "move": "14\"",
        "save": "4+",
        "control": "2",
        "health": "6",
        "ward": "6+"
      },
      "points": 180,
      "modelCount": 1,
      "baseSize": "60mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Iridescent Flames",
            "type": "ranged",
            "range": "12\"",
            "attacks": "3",
            "hit": "4+",
            "wound": "4+",
            "rend": "1",
            "damage": "D3",
            "abilities": ["Wyrdflame"]
          }
        ],
        "melee": [
          {
            "name": "Disc’s Teeth and Horns",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "D3",
            "abilities": ["Companion"]
          },
          {
            "name": "Staff of Change and Ritual Dagger",
            "type": "melee",
            "range": null,
            "attacks": "3",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "D3",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Arcane Tome",
          "phase": "heroPhase",
          "phaseDetails": "Once Per Turn (Army), Reaction: You declared a SPELL ability for this unit",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "This arcane tome holds scriptures of ancient incantation that allows a brief mastery of the Herald’s chosen spell lores.",
          "declare": null,
          "effect": "Re-roll 1 of the dice in the casting roll."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "requiredKeywords": ["Daemon"],
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "2b598fc3-f4ce-5260-8678-e32551c9e2ef",
      "name": "Gaunt Summoner",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": ["Daemon", "Wizard", "Infantry", "Ward (6+)", "Hero"],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "Gaunt Summoners are daemon monarchs of Tzeentch. There are nine of these dreaded sorcerers, and each is the lord of a Silver Tower – looming crystalline edifices that travel across time and space, disgorging hosts of daemons and Arcanites from their labyrinthine innards. Having been elevated to their station by Tzeentch himself, Gaunt Summoners are entrusted with schemes of immense complexity and import. They rule their Silver Towers as mad fiefdoms and delight in magically trapping rivals and adversaries within. These unfortunates are subjected to endless trials for the amusement of the Gaunt Summoners. Few ever escape; fewer still hold onto their sanity.\n\nOnce, the Gaunt Summoners were given freedom by Tzeentch to pursue the accumulation of magical power as they saw fit, but Archaon the Everchosen wished to possess the might of the Gaunt Summoners for his own. The Change God concluded that allowing Archaon to seemingly usurp dominion of the nine daemon sorcerers would better serve his own ends. So did the Everchosen win the true names of all the Gaunt Summoners, never realising the subtle aid from which he benefited. Ever since, the Gaunt Summoners have chafed beneath his rule, plotting to one day rebel and claim his throne.",
      "referenceKeywords": "Hero, Wizard (2), Infantry, Ward (6+), Chaos, Disciples of Tzeentch, Daemon",
      "stats": {
        "move": "5\"",
        "save": "6+",
        "control": "2",
        "health": "5",
        "ward": "6+"
      },
      "points": 180,
      "modelCount": 1,
      "baseSize": "40mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Changestaff",
            "type": "ranged",
            "range": "12\"",
            "attacks": "3",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "D3",
            "abilities": ["Crit (Mortal)"]
          }
        ],
        "melee": [
          {
            "name": "Warptongue Blade",
            "type": "melee",
            "range": null,
            "attacks": "3",
            "hit": "3+",
            "wound": "3+",
            "rend": "1",
            "damage": "2",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Divert Realmgate",
          "phase": "heroPhase",
          "phaseDetails": "Your Hero Phase",
          "icon": "movement",
          "castingValue": 7,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Whispering fell incantations, a Gaunt Summoner can temporarily divert the path of a realmgate, allowing malefic Chaos entities to storm the battlefield.",
          "declare": "Make a casting roll of 2D6.",
          "effect": "Units set up this turn using this unit’s ‘Book of Profane Secrets’ ability can be set up wholly within 18\" of this unit and more than 7\" from all enemy units instead of the distances in the ability.",
          "keywords": ["Spell"]
        },
        {
          "name": "Book of Profane Secrets",
          "phase": "movementPhase",
          "phaseDetails": "Your Movement Phase",
          "icon": "movement",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Using this arcane tome, the Gaunt Summoner calls forth minions from their Silver Tower.",
          "declare": "Pick a friendly unit in a Silver Tower to be the target.",
          "effect": "Set up the target on the battlefield wholly within 12\" of this unit and more than 9\" from all enemy units."
        },
        {
          "name": "Minions of the Silver Tower",
          "phase": "startOfTurn",
          "phaseDetails": "Deployment Phase",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The warped fortresses of the Gaunt Summoners are infested with their thrall hosts.",
          "declare": "Pick a friendly unit that has not been deployed to be the target.",
          "effect": "The target is set up in reserve in a Silver Tower. It has now been deployed.",
          "keywords": ["Deploy"]
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "requiredKeywords": ["Tzeentchian Deceiver"],
          "linkedWarscroll": null
        },
        {
          "points": null,
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "c5e4b7cb-4b03-5b7d-8486-7c71a0977281",
      "name": "Gaunt Summoner on Disc of Tzeentch",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": [
        "Daemon",
        "Wizard",
        "Disc of Tzeentch",
        "Ward (6+)",
        "Fly",
        "Cavalry",
        "Hero"
      ],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "Gaunt Summoners are daemon monarchs of Tzeentch. There are nine of these dreaded sorcerers, and each is the lord of a Silver Tower – looming crystalline edifices that travel across time and space, disgorging hosts of daemons and Arcanites from their labyrinthine innards. Having been elevated to their station by Tzeentch himself, Gaunt Summoners are entrusted with schemes of immense complexity and import. They rule their Silver Towers as mad fiefdoms and delight in magically trapping rivals and adversaries within. These unfortunates are subjected to endless trials for the amusement of the Gaunt Summoners. Few ever escape; fewer still hold onto their sanity.\n\nGaunt Summoners are masters of binding the daemons that infest their Silver Towers. Often they will transform a mindless Screamer into a Disc to ride upon, for the pride of the Summoners is such that walking upon the stagnant earth of the realms infuriates them. Surrounded by shoals of flying daemons or Discborne mortal acolytes, Gaunt Summoners observe the ebb and flow of battle with an obsessive curiosity. Any opportunity to unleash their arcane fires will be seized on with gusto, for the Summoners are always looking to outdo one another in seeking the favour of Tzeentch.",
      "referenceKeywords": "Hero, Wizard (2), Cavalry, Fly, Ward (6+), Chaos, Disciples of Tzeentch, Daemon, Disc of Tzeentch",
      "stats": {
        "move": "14\"",
        "save": "4+",
        "control": "2",
        "health": "6",
        "ward": "6+"
      },
      "points": 230,
      "modelCount": 1,
      "baseSize": "40mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Changestaff",
            "type": "ranged",
            "range": "12\"",
            "attacks": "3",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "D3",
            "abilities": ["Crit (Mortal)"]
          }
        ],
        "melee": [
          {
            "name": "Disc’s Teeth and Horns",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "D3",
            "abilities": ["Companion"]
          },
          {
            "name": "Warptongue Blade",
            "type": "melee",
            "range": null,
            "attacks": "3",
            "hit": "3+",
            "wound": "3+",
            "rend": "1",
            "damage": "2",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Book of Profane Secrets",
          "phase": "movementPhase",
          "phaseDetails": "Your Movement Phase",
          "icon": "movement",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Using this arcane tome, the Gaunt Summoner calls forth minions from their Silver Tower.",
          "declare": "Pick a friendly unit in a Silver Tower to be the target.",
          "effect": "Set up the target on the battlefield wholly within 12\" of this unit and more than 9\" from all enemy units."
        },
        {
          "name": "Arcane Imprisonment",
          "phase": "heroPhase",
          "phaseDetails": "Your Hero Phase",
          "icon": "offensive",
          "castingValue": 7,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Gaunt Summoners delight in banishing foes to their Silver Towers.",
          "declare": "Pick an enemy HERO in combat with this unit to be the target, then make a casting roll of 2D6.",
          "effect": "If the unmodified casting roll exceeds the target’s Health characteristic, it is automatically destroyed. For the rest of the battle, that unit cannot be picked to be the target of an ability that allows a replacement unit to be set up.",
          "keywords": ["Spell"]
        },
        {
          "name": "Minions of the Silver Tower",
          "phase": "startOfTurn",
          "phaseDetails": "Deployment Phase",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The warped fortresses of the Gaunt Summoners are infested with their thrall hosts.",
          "declare": "Pick a friendly unit that has not been deployed to be the target.",
          "effect": "The target is set up in reserve in a Silver Tower. It has now been deployed.",
          "keywords": ["Deploy"]
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "requiredKeywords": ["Tzeentchian Deceiver"],
          "linkedWarscroll": null
        },
        {
          "points": null,
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "4dd79305-7004-5dec-b787-18520e082e4d",
      "name": "Jade Obelisk",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": ["Champion", "Infantry", "Arcanite"],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "The Jade Obelisk are iconoclastic worshippers of a daemonic entity known as the Speaker in the Stone. Each is afflicted by a curse that transforms their flesh to crumbling rock. Only by raising spires of realm-warping jade over civilisation’s ruins can they stave off degradation. In doing so, they serve Tzeentch, who delights in the cultists’ hope that one day they may escape their curse.\n\nDuring the Age of Chaos, the Ghurish cavern-cities of Vexothskol were overrun, until only the citadel of Nephricar remained unconquered. It was through the towering obelisk of jade at Nephricar’s heart that the Speaker in the Stone first entreated the people of Vexothskol. It seduced Mason-King Mephrobaal and his subjects with promises of power, inflicting the stone-flesh curse upon them in exchange for bolstering their physical might.\n\nThe Jade Obelisk travel the realms in search of idols to demolish. The most honoured carry shards of the great pinnacle of Nephricar, capable of transmuting the flesh of their enemies to stone. Under the gaze of the daemonic Idolarcs, the Jade Obelisk plough into the fray, transmogrified flesh shrugging off harm as they swing chisel and mallet with destructive intent.",
      "referenceKeywords": "Infantry, Champion (1/10), Chaos, Disciples of Tzeentch, Arcanite",
      "stats": {
        "move": "5\"",
        "save": "4+",
        "control": "1",
        "health": "1",
        "ward": null
      },
      "points": 100,
      "modelCount": 10,
      "baseSize": "32mm [5], 28.5mm [5]",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Antithete Bow",
            "type": "ranged",
            "range": "18\"",
            "attacks": "1",
            "hit": "4+",
            "wound": "4+",
            "rend": "-",
            "damage": "1",
            "abilities": []
          }
        ],
        "melee": [
          {
            "name": "Jade Dagger",
            "type": "melee",
            "range": null,
            "attacks": "1",
            "hit": "4+",
            "wound": "4+",
            "rend": "-",
            "damage": "1",
            "abilities": []
          },
          {
            "name": "Stone-like Beak",
            "type": "melee",
            "range": null,
            "attacks": "1",
            "hit": "3+",
            "wound": "3+",
            "rend": "1",
            "damage": "D3",
            "abilities": ["Companion"]
          },
          {
            "name": "Mason’s Tools",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "1",
            "abilities": ["Anti-FACTION TERRAIN (+1 Rend)"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Stone-cursed Resolve",
          "phase": "defensive",
          "phaseDetails": "Passive",
          "icon": "defensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "These rock-skinned warriors are virtually impossible to move against their will.",
          "declare": null,
          "effect": "Ignore all modifiers to save rolls for this unit (positive and negative)."
        },
        {
          "name": "Cast Down the Idol",
          "phase": "combatPhase",
          "phaseDetails": "Passive",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The Jade Obelisk turn former tools of construction upon blasphemous effigies, rendering them little more than rubble.",
          "declare": null,
          "effect": "Add 1 to the Damage characteristic of this unit’s melee weapons for attacks that target FACTION TERRAIN."
        }
      ],
      "notes": null
    },
    {
      "id": "5decb593-9eb5-51d8-800b-e9a2a054bed9",
      "name": "Kairic Acolytes",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": ["Champion", "Infantry", "Arcanite"],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "The majority of the Arcanite cults are mortal folk. They lurk within the societies of Order, working to bring them down from within. Kairic Acolytes hide in plain sight for years, waiting for the command to rise up in open insurrection. On the day of battle, they throw off their civilian guises to reveal imposing physiques. Rather than being honed through honest toil, this power is only borrowed, temporarily conjured through enchantments. The Acolytes find no shame in this. With a mere incantation, they can briefly acquire a physique that a warrior might take decades to achieve – what better way to prove the superiority of magic?\n\nFreed to unleash their potential, Kairic Acolytes seize the opportunity by conjuring torrents of pink and blue bolts to bombard their foes. Avian helms hide their features, whilst ornate blades and flame-shaped shields are wielded in close quarters. Some carry scraps of arcane lore or avian Vulcharc familiars, the better to aid the cultists as they perform dark rituals around sites of power, channelling natural magic into Chaotic energy. Yet though every Acolyte may believe themselves favoured, they are ultimately pawns, each to be expended as their masters see fit.",
      "referenceKeywords": "Infantry, Champion, Chaos, Disciples of Tzeentch, Arcanite",
      "stats": {
        "move": "5\"",
        "save": "5+",
        "control": "1",
        "health": "1",
        "ward": null
      },
      "points": 90,
      "modelCount": 10,
      "baseSize": "32mm",
      "cannotBeReinforced": false,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Sorcerous Bolt",
            "type": "ranged",
            "range": "18\"",
            "attacks": "1",
            "hit": "4+",
            "wound": "3+",
            "rend": "-",
            "damage": "1",
            "abilities": ["Wyrdflame"]
          }
        ],
        "melee": [
          {
            "name": "Cursed Glaive",
            "type": "melee",
            "range": null,
            "attacks": "1",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "2",
            "abilities": []
          },
          {
            "name": "Cursed Blade",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "4+",
            "wound": "4+",
            "rend": "-",
            "damage": "1",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Gestalt Sorcery",
          "phase": "shootingPhase",
          "phaseDetails": "Your Shooting Phase",
          "icon": "shooting",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Through combined worship, a cult of Acolytes can swell their arcane power to new levels of ferocity.",
          "declare": null,
          "effect": "If this unit includes any models carrying a Scroll of Dark Arts, roll a dice. Add 1 to the roll for each other friendly Kairic Acolytes unit within this unit’s combat range. On a 5+, add 1 to the Rend characteristic of this unit’s Sorcerous Bolts for the rest of the turn."
        },
        {
          "name": "Vulcharc",
          "phase": "heroPhase",
          "phaseDetails": "Passive",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Especially talented Kairic Acolytes are gifted with magic-eating Vulcharcs that act as familiars.",
          "declare": null,
          "effect": "While this unit includes any models accompanied by Vulcharcs, subtract 1 from casting rolls for enemy WIZARDS within 12\" of this unit."
        }
      ],
      "notes": null
    },
    {
      "id": "f70401a7-97f7-5b46-9280-33518522ea09",
      "name": "Kairos Fateweaver",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": [
        "Daemon",
        "Ward (5+)",
        "Monster",
        "Wizard",
        "Unique",
        "Fly",
        "Warmaster",
        "Hero"
      ],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "Aeons ago, Tzeentch hurled the Lord of Change known as Kairos into the Well of Eternity, curious as to what would become of the daemon within that abyss of infinite possibility. The being that emerged from that roiling maelstrom was fundamentally altered from that which had come before. Kairos’s essence had bifurcated, two heads sprouting from his wizened shoulders. The right head could see the many forks of the future, while the left possessed perfect clarity on all that had transpired in the past. Yet in becoming attuned to the flow of eternity, Kairos sundered himself from the present; unable to follow time as it passes, he now can only see what was and what might be.\n\nThe secrets Kairos is privy to have made him the Architect of Fate’s foremost lieutenant, sent into the Mortal Realms to oversee the most vital manipulations of destiny. Though his inability to perceive the present may occasionally blindside him, Fateweaver allows only those who serve his purpose to draw close. Those he deems irrelevant are disposed of with bolts of pure mutation or torrents of prismatic wyrdflame, both of Kairos’s heads cackling in cruel mirth as they watch the prelude to and consequences of this destructive spellcraft unfold.",
      "referenceKeywords": "Warmaster, Unique, Hero, Monster, Wizard (3), Fly, Ward (5+), Chaos, Disciples of Tzeentch, Daemon",
      "stats": {
        "move": "12\"",
        "save": "5+",
        "control": "5",
        "health": "16",
        "ward": "5+"
      },
      "points": 420,
      "modelCount": 1,
      "baseSize": "100mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Bolts of Change",
            "type": "ranged",
            "range": "18\"",
            "attacks": "9",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "1",
            "abilities": ["Wyrdflame"]
          }
        ],
        "melee": [
          {
            "name": "Staff of Tomorrow and Beaks",
            "type": "melee",
            "range": null,
            "attacks": "9",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "D3",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Battle Damaged",
          "phase": "startOfTurn",
          "phaseDetails": "Passive",
          "icon": "battleDamaged",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": null,
          "declare": null,
          "effect": "While this unit has 10 or more damage points, the Attacks characteristic of its Staff of Tomorrow and Beaks is 6."
        },
        {
          "name": "Arcane Suggestion",
          "phase": "heroPhase",
          "phaseDetails": "Your Hero Phase",
          "icon": "special",
          "castingValue": 8,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The sorcerer’s victims are reduced to little more than puppets on a string.",
          "declare": "Pick a visible enemy unit within 18\" of this unit to be the target, then make a casting roll of 2D6.",
          "effect": "Pick 1 of the following effects to apply to the target until the start of your next turn:\n\nIt’s Hopeless: The target cannot use commands.\n\nDrop Your Weapons: Subtract 1 from hit rolls and wound rolls for the target’s attacks.\n\nKneel: Subtract 1 from save rolls for the target.",
          "keywords": ["Spell"]
        },
        {
          "name": "Beacon of Sorcery",
          "phase": "heroPhase",
          "phaseDetails": "Passive",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Spreading his arms, Kairos saturates the area with magic.",
          "declare": null,
          "effect": "Add 1 to casting rolls and unbinding rolls for friendly DISCIPLES OF TZEENTCH WIZARDS while they are wholly within 12\" of this unit."
        },
        {
          "name": "Oracle of Eternity",
          "phase": "startOfTurn",
          "phaseDetails": "Once Per Battle (Army), Start of Your Turn",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Kairos’s heads have insights into the future and the past.",
          "declare": null,
          "effect": "Pick 1 battle tactics card that is on your roster and discard it. Then, for the rest of the battle, replace it with a battle tactics card that is not on your roster.\n\nIf that new battle tactics card requires either player to pick something, they must do so immediately when the new battle tactics card is picked. The combined total of victory points earned by both the discarded battle tactics card and the new battle tactics card is 15. Any additional victory points beyond 15 that are earned by completing the battle tactics on both of those battle tactics cards are lost."
        },
        {
          "name": "Mastery of Magic",
          "phase": "heroPhase",
          "phaseDetails": "Passive",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "To master the arcane is to embody Tzeentch’s designs.",
          "declare": null,
          "effect": "When you make a casting roll for this unit, you can change the lowest D6 to match the highest D6."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "requiredKeywords": ["Tzeentchian Deceiver"],
          "linkedWarscroll": null
        },
        {
          "points": null,
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "5c275305-5de2-57b6-b2a1-dca7690805ee",
      "name": "Lord of Change",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": ["Daemon", "Ward (5+)", "Monster", "Wizard", "Fly", "Hero"],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "With a contemptuous flick of their talons, a Lord of Change can unleash blistering waves of wyrdflame or tear open screaming gateways to the Realm of Chaos. These greater daemons are entities of pure magic, and few can rival their spellcraft. Mundane concepts such as glory or honour mean little to a Lord of Change; they delight in denying enemy champions a fair contest, soaring out of reach upon their glowing pinions. Blades, bullets and even retaliatory spells sputter to nothing against a Lord of Change’s wards, even as the daemon unleashes kaleidoscopic storms of witchfire in turn.\n\nA Lord of Change satisfies its well of curiosity by ensnaring mortals in complex schemes, raising favoured acolytes up to the dizzying heights of their ambitions before casting them down. These daemons care not for the consequences facing those they torment; instead, they watch their suffering with enraptured fascination. Yet Lords of Change are manipulative to the point of compulsiveness, always adding new dimensions to their schemes even if it compromises their original aims. Many times has one of the Change God’s grand ploys unravelled because his Lords of Change could not stop plucking the skeins of fate – though even this anarchy is pleasing to Tzeentch.",
      "referenceKeywords": "Hero, Monster, Wizard (2), Fly, Ward (5+), Chaos, Disciples of Tzeentch, Daemon",
      "stats": {
        "move": "12\"",
        "save": "5+",
        "control": "5",
        "health": "14",
        "ward": "5+"
      },
      "points": 360,
      "modelCount": 1,
      "baseSize": "100mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Rod of Sorcery",
            "type": "ranged",
            "range": "18\"",
            "attacks": "2D6",
            "hit": "3+",
            "wound": "3+",
            "rend": "1",
            "damage": "1",
            "abilities": ["Wyrdflame"]
          }
        ],
        "melee": [
          {
            "name": "Baleful Sword",
            "type": "melee",
            "range": null,
            "attacks": "4",
            "hit": "4+",
            "wound": "3+",
            "rend": "2",
            "damage": "3",
            "abilities": []
          },
          {
            "name": "Staff of Tzeentch",
            "type": "melee",
            "range": null,
            "attacks": "4",
            "hit": "3+",
            "wound": "3+",
            "rend": "-",
            "damage": "D3",
            "abilities": ["Anti-WIZARD (+1 Rend)"]
          },
          {
            "name": "Curved Beak",
            "type": "melee",
            "range": null,
            "attacks": "4",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "2",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Battle Damaged",
          "phase": "startOfTurn",
          "phaseDetails": "Passive",
          "icon": "battleDamaged",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": null,
          "declare": null,
          "effect": "While this unit has 10 or more damage points, the Attacks characteristic of its Curved Beak is 3."
        },
        {
          "name": "Locus of Change",
          "phase": "defensive",
          "phaseDetails": "Passive",
          "icon": "defensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The aura of instability surrounding Tzeentch’s greatest daemons can send even the most focused warriors insane.",
          "declare": null,
          "effect": "Subtract 1 from hit rolls for combat attacks that target friendly DISCIPLES OF TZEENTCH DAEMON units while they are wholly within 12\" of this unit."
        },
        {
          "name": "Tzeentch's Firestorm",
          "phase": "heroPhase",
          "phaseDetails": "Your Hero Phase",
          "icon": "offensive",
          "castingValue": 7,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "An apocalyptic inferno of raging wyrdflame surges from the daemon’s hands to engulf its victims in a fiery maelstrom.",
          "declare": "Pick a visible enemy unit within 18\" of the caster to be the target, then make a casting roll of 2D6.",
          "effect": "Roll 9 dice. For each 6, inflict D3 mortal damage on the target.",
          "keywords": ["Wyrdflame", "Spell"]
        },
        {
          "name": "Summon Daemons of Tzeentch",
          "phase": "movementPhase",
          "phaseDetails": "Once Per Turn (Army), Your Movement Phase",
          "icon": "rallying",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "To challenge the fractal plans of the Architect of Fate is to face strange daemons born from chaotic sorcery itself.",
          "declare": "Discard 1 destiny dice. Then, pick a friendly non-HERO non-UNIQUE DISCIPLES OF TZEENTCH DAEMON unit that has been destroyed to be the target.",
          "effect": "Set up a replacement unit with half the number of models from the target unit (rounding up) wholly within 9\" of this unit and more than 9\" from all enemy units."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "requiredKeywords": ["Tzeentchian Deceiver"],
          "linkedWarscroll": null
        },
        {
          "points": null,
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "0cc94c4e-1305-5223-b5a1-ddc3a8ec14b7",
      "name": "Magister",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": [
        "Wizard",
        "Arcanite Cabalist",
        "Infantry",
        "Arcanite",
        "Hero"
      ],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "Magisters are amongst the most magically powerful of Tzeentch’s mortal servants. It is they who lurk at the heart of an Arcanite cult, manipulating all and sundry to ensure the Change God’s will is carried out. Though they prefer to operate from their sorcerous lairs, when Magisters take to the field, they revel in unleashing their most devastating evocations. With a gesture, these master sorcerers summon roaring flames of every colour or exude rays of pure changemagic that warp enemies beyond recognition. The more outlandish the fate they can inflict, the more honour they do to the Changer of the Ways.\n\nMagisters are privy to eldritch secrets that have twisted them into something unnatural. Their limbs grow long and backwards-jointed, while their faces mutate into leering masks or sprout with clusters of iridescent eyes. Yet for all their arcane might, Magisters are still mortals, and they risk body and soul each time they channel the unbound potential of change. Many are the tales of Magisters who drank from the font of their god’s power too eagerly and found themselves eventually overwhelmed by it, reduced to a mewling lump of flesh. But Tzeentch demands unlimited ambition from his Magisters, and the lure of ultimate sorcerous might is a prize they will go to any length to claim.",
      "referenceKeywords": "Hero, Wizard (1), Infantry, Chaos, Disciples of Tzeentch, Arcanite",
      "stats": {
        "move": "6\"",
        "save": "4+",
        "control": "2",
        "health": "5",
        "ward": null
      },
      "points": 100,
      "modelCount": 1,
      "baseSize": "32mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Tzeentchian Runestaff",
            "type": "ranged",
            "range": "18\"",
            "attacks": "1",
            "hit": "3+",
            "wound": "4+",
            "rend": "-",
            "damage": "D3",
            "abilities": ["Wyrdflame"]
          }
        ],
        "melee": [
          {
            "name": "Warpsteel Sword",
            "type": "melee",
            "range": null,
            "attacks": "3",
            "hit": "3+",
            "wound": "4+",
            "rend": "-",
            "damage": "D3",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Web of Intrigue",
          "phase": "heroPhase",
          "phaseDetails": "Your Hero Phase",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Magisters excel in pre-empting the crude schemes of their enemies, directing their cultic minions to outmanoeuvre them in turn.",
          "declare": "Pick an enemy unit within 12\" of this unit to be the target.",
          "effect": "Until the start of your next turn, each time your opponent declares a MOVE ability for the target, before reactions are used, you can pick a friendly ARCANITE unit that is not in combat and is within 12\" of the target. That friendly unit can move 3\", but it cannot move into combat during any part of that move."
        },
        {
          "name": "Magic-touched",
          "phase": "heroPhase",
          "phaseDetails": "Your Hero Phase",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Magisters are attuned to magical energy and can harness the raw essence of Chaos. There are those however, that delve too deep into this source of power.",
          "declare": null,
          "effect": "If this unit successfully cast a spell this phase, for the rest of the turn:\n\n• Add 1 to this unit’s power level.\n• If 2 or more dice in a casting roll for this unit have the same value, the spell fails, its effect is not resolved and D6 mortal damage is inflicted on this unit."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "requiredKeywords": ["Arcanite"],
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "4c00621d-7b0c-5775-b597-4b07ed512d47",
      "name": "Magister on Disc of Tzeentch",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": [
        "Wizard",
        "Disc of Tzeentch",
        "Fly",
        "Cavalry",
        "Arcanite",
        "Hero"
      ],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "Magisters are amongst the most magically powerful of Tzeentch’s mortal servants. It is they who lurk at the heart of an Arcanite cult, manipulating all and sundry to ensure the Change God’s will is carried out. Though they prefer to operate from their sorcerous lairs, when Magisters take to the field, they revel in unleashing their most devastating evocations. With a gesture, these master sorcerers summon roaring flames of every colour or exude rays of pure change-magic that warp enemies beyond recognition. The more outlandish the fate they can inflict, the more honour they do to the Changer of the Ways.\n\nMagisters who take a particular delight in the carnage of open magical warfare will seek out a Screamer to act as their mount, warping the daemonic creature’s flesh and alloying it with strange metals until it serves as a Disc of Tzeentch. Having eschewed the subtlety typical to their kind, they have embraced their role as the bringers of violent change. Contrails of flame billow in their wake as they blaze through the skies alongside other airborne minions. The Magisters hungrily draw upon these fires to wield as tools of annihilation, scouring the lands until they are more pleasing to Tzeentch’s ninefold gaze.",
      "referenceKeywords": "Hero, Wizard (1), Cavalry, Fly, Chaos, Disciples of Tzeentch, Arcanite, Disc of Tzeentch",
      "stats": {
        "move": "14\"",
        "save": "4+",
        "control": "2",
        "health": "6",
        "ward": null
      },
      "points": 110,
      "modelCount": 1,
      "baseSize": "50mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Tzeentchian Runestaff",
            "type": "ranged",
            "range": "18\"",
            "attacks": "1",
            "hit": "3+",
            "wound": "4+",
            "rend": "-",
            "damage": "D3",
            "abilities": ["Wyrdflame"]
          }
        ],
        "melee": [
          {
            "name": "Disc’s Teeth and Horns",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "D3",
            "abilities": ["Companion"]
          },
          {
            "name": "Warpsteel Sword",
            "type": "melee",
            "range": null,
            "attacks": "3",
            "hit": "3+",
            "wound": "4+",
            "rend": "-",
            "damage": "D3",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Master of the Blazing Skies",
          "phase": "chargePhase",
          "phaseDetails": "Passive",
          "icon": "movement",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "A Magister takes to the air surrounded by sorcerers and minions riding daemonic Discs.",
          "declare": null,
          "effect": "While they are within this unit’s combat range, friendly DISC OF TZEENTCH units can use CHARGE abilities even if they used a RUN ability in the same turn."
        },
        {
          "name": "Magic-touched",
          "phase": "heroPhase",
          "phaseDetails": "Your Hero Phase",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Magisters are attuned to magical energy and can harness the raw essence of Chaos. There are those however, that delve too deep into this source of power.",
          "declare": null,
          "effect": "If this unit successfully cast a spell this phase, for the rest of the turn:\n\n• Add 1 to this unit’s power level.\n• If 2 or more dice in a casting roll for this unit have the same value, the spell fails, its effect is not resolved and D6 mortal damage is inflicted on this unit."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "requiredKeywords": ["Arcanite Cabalist"],
          "linkedWarscroll": null
        },
        {
          "points": null,
          "requiredKeywords": ["Arcanite"],
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "8201672d-12ba-5d8b-899a-fd9d05e35542",
      "name": "Ogroid Thaumaturge",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": [
        "Wizard",
        "Arcanite Cabalist",
        "Infantry",
        "Ward (6+)",
        "Arcanite",
        "Hero"
      ],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "The ogroids are an exceedingly ancient race. Though they once fought in Gorkamorka’s hordes, they sought a more refined existence. These ideals of structure drove a wedge between them and their barbarous brethren, until at last their capital of High Progrexia was sacked by a greenskin horde. Enraged, the survivors fell into the embrace of Chaos, selling their souls for vengeance.\n\nThaumaturges are the inheritors of the ogroids’ more esoteric traditions, and in their pursuit of magical lore, they have embraced service to Tzeentch. Though brutish, horned and bestial creatures, they are undeniably beings of the arcane, their flesh constantly writhing with eldritch energies. A Thaumaturge’s sorcerous ability is channelled through the head of their totemic staff – a tool hand-crafted by the ogroid themselves – and released in storms of multi-hued wyrdflame.\n\nThaumaturges are certainly cunning, as many Magisters who seek to manipulate them learn to their cost, but their battle-rage is never far from the surface. When pain strikes, Thaumaturges fly into a frenzy, discarding the subtle arts of magic in their need to crush and tear. Such brute strength is of great value to the Arcanite cults, who flatter the ogroids into spearheading their most aggressive uprisings.",
      "referenceKeywords": "Hero, Wizard (1), Infantry, Ward (6+), Chaos, Disciples of Tzeentch, Arcanite",
      "stats": {
        "move": "6\"",
        "save": "5+",
        "control": "2",
        "health": "8",
        "ward": "6+"
      },
      "points": 130,
      "modelCount": 1,
      "baseSize": "50mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Thaumaturge Staff",
            "type": "ranged",
            "range": "12\"",
            "attacks": "3",
            "hit": "3+",
            "wound": "4+",
            "rend": "-",
            "damage": "D3",
            "abilities": []
          }
        ],
        "melee": [
          {
            "name": "Thaumaturge Staff",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "4+",
            "wound": "3+",
            "rend": "-",
            "damage": "D3",
            "abilities": []
          },
          {
            "name": "Great Horns and Cloven Hooves",
            "type": "melee",
            "range": null,
            "attacks": "3",
            "hit": "4+",
            "wound": "2+",
            "rend": "1",
            "damage": "2",
            "abilities": ["Charge (+1 Damage)"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Thaumaturge Rage",
          "phase": "combatPhase",
          "phaseDetails": "Passive",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "When wounded, the ogroid’s rage gives rise to bursts of renewed energy.",
          "declare": null,
          "effect": "Add 1 to hit rolls and wound rolls for this unit’s combat attacks while it is damaged."
        },
        {
          "name": "Burning Fury",
          "phase": "endOfTurn",
          "phaseDetails": "Once Per Turn (Army), End of Any Turn",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "As an Ogroid Thaumaturge rages and roars, the multihued flames of Tzeentch erupt from their totemic stave to ravage the enemy.",
          "declare": "Pick an enemy unit that had any damage points allocated to it this turn by this unit’s combat attacks to be the target.",
          "effect": "The target has the BURNING keyword."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "requiredKeywords": ["Arcanite"],
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "905f6e42-e01e-54e9-ad4f-6e8d833aaf8c",
      "name": "Pink Horrors",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": [
        "Champion",
        "Daemon",
        "Ward (5+)",
        "Standard Bearer",
        "Musician",
        "Infantry"
      ],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "Horrors are the bizarre lesser daemons of Tzeentch. They twirl and caper as they cross the field, warbling nonsense rhymes and shooting wyrdflame from unnaturally elongated fingers. These fires of mutation freeze and twist, elongate and temporally displace, turn flesh to glass and turn bone to porous sponge. Horrors find cruel mirth in wielding these arcane projectiles against Tzeentch’s enemies, observing the unpredictable results with fascination.\n\nThough they are nonsensical beings, there is a crazed logic to the hierarchy of the Horrors. The largest are the Pink Horrors, the most jovial and arcanely talented of their infernal breed. Should a Pink Horror receive a telling wound, they will gasp dramatically before coming apart in a burst of ectoplasm. In its place are two smaller daemons known as Blue Horrors. These are more bitter and sullen but can unleash barrages of magic regardless. When a Blue Horror is slain, blazing imps known as Brimstone Horrors spring up. These diminutive daemons are the most vindictive breed of Horror. Lacking in higher thought and prone to burning themselves out rapidly, they swarm towards enemies with cackles of malice, intent on setting alight cloth and flesh.",
      "referenceKeywords": "Infantry, Champion, Musician (1/10), Standard Bearer (1/10), Ward (6+), Chaos, Disciples of Tzeentch, Daemon",
      "stats": {
        "move": "6\"",
        "save": "6+",
        "control": "1",
        "health": "2",
        "ward": "5+"
      },
      "points": 160,
      "modelCount": 10,
      "baseSize": "32mm",
      "cannotBeReinforced": false,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Arcane Flames",
            "type": "ranged",
            "range": "12\"",
            "attacks": "2",
            "hit": "4+",
            "wound": "4+",
            "rend": "-",
            "damage": "1",
            "abilities": ["Wyrdflame"]
          }
        ],
        "melee": [
          {
            "name": "Taloned Hands",
            "type": "melee",
            "range": null,
            "attacks": "1",
            "hit": "4+",
            "wound": "4+",
            "rend": "-",
            "damage": "1",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Lunatic Demise",
          "phase": "startOfTurn",
          "phaseDetails": "Passive",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Should a Pink Horror be slain, it is capable of bursting into two smaller daemons or else detonating in a blast of wyrdflame.",
          "declare": null,
          "effect": "Each time a model in this unit is slain, before removing the model from play, pick 1 of the following effects:\n\nSplit: Pick a friendly Blue Horrors and Brimstone Horrors unit within 12\" of this unit. Return up to 2 slain Blue Horror models to that unit.\n\nPetty Vengeance: Pick an enemy unit in combat with this unit to be the target and roll a dice. On a 4+, inflict 1 mortal damage on the target."
        }
      ],
      "notes": null
    },
    {
      "id": "1e5a4770-d941-5ac9-9878-385ba3f66aeb",
      "name": "Scourge of Ghyran Kairic Acolytes",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": ["Champion", "Infantry", "Arcanite"],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "Kairic Acolytes are the Change God’s most numerous mortal servants, and thousands of them exist secretly in cities such as Hammerhal Ghyra and Greywater Fastness. Though only human, they use arcane craft to swell their muscles and ignite their blades with sorcerous flames. Such rituals turn them into fearsome killers, and they leap into battle screaming praise to Tzeentch.",
      "referenceKeywords": "Infantry, Champion, Chaos, Disciples of Tzeentch, Arcanite",
      "stats": {
        "move": "5\"",
        "save": "5+",
        "control": "1",
        "health": "1",
        "ward": null
      },
      "points": 100,
      "modelCount": 10,
      "baseSize": "32mm",
      "cannotBeReinforced": false,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Cursed Blades and Glaives",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "4+",
            "wound": "3+",
            "rend": "-",
            "damage": "1",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Empowered By Magic",
          "phase": "combatPhase",
          "phaseDetails": "Passive",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Kairic Acolytes absorb power from roving arcane manifestations to strengthen their own bodies.",
          "declare": null,
          "effect": "Add 1 to the Damage characteristic of this unit’s melee weapons while this unit is wholly within 12\" of any MANIFESTATIONS (friendly or enemy)."
        },
        {
          "name": "Vulcharc",
          "phase": "shootingPhase",
          "phaseDetails": "Once Per Turn (Army), Your Shooting Phase",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Some Kairic Acolytes train to see through the eyes of Vulcharcs, Tzeentch-touched avians that feed upon magic. These birds are often dispatched by their handlers to spy out a foe’s weaknesses, secrets that are duly shared with their fellow cultists to give them the advantage once battle is joined.",
          "declare": "Pick a visible enemy unit within 12\" of this unit to be the target.",
          "effect": "For the rest of the turn, add 1 to the Rend characteristic of melee weapons used by friendly Kairic Acolytes units for attacks that target that enemy unit."
        }
      ],
      "notes": null
    },
    {
      "id": "dbf84b86-e2f6-5346-a847-70e9f7a072a6",
      "name": "Scourge of Ghyran Ogroid Thaumaturge",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": [
        "Wizard",
        "Arcanite Cabalist",
        "Infantry",
        "Arcanite",
        "Hero"
      ],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "An Ogroid Thaumaturge is a hulking brute whose size and terrible strength belies a masterful grasp of sorcery. Amongst the Arcanite Cults of the Jade Kingdoms, they are worshipped as living idols – a status they are all too willing to exploit. Their eldritch wards draw upon the souls of nearby cultists, immolating the weak whilst protecting the ogroid from harm.",
      "referenceKeywords": "Hero, Wizard (1), Infantry, Chaos, Disciples of Tzeentch, Arcanite",
      "stats": {
        "move": "6\"",
        "save": "5+",
        "control": "2",
        "health": "8",
        "ward": null
      },
      "points": 130,
      "modelCount": 1,
      "baseSize": "50mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Thaumaturge Staff",
            "type": "ranged",
            "range": "12\"",
            "attacks": "3",
            "hit": "3+",
            "wound": "4+",
            "rend": "-",
            "damage": "D3",
            "abilities": []
          }
        ],
        "melee": [
          {
            "name": "Great Horns and Cloven Hooves",
            "type": "melee",
            "range": null,
            "attacks": "6",
            "hit": "4+",
            "wound": "2+",
            "rend": "1",
            "damage": "2",
            "abilities": ["Charge (+1 Damage)"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Soul-Deep Devotion",
          "phase": "defensive",
          "phaseDetails": "Passive",
          "icon": "defensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Thaumaturges surround themselves with staunchly faithful cultists who are willing to sacrifice their souls in the defence of their sorcerous idol.",
          "declare": null,
          "effect": "While this unit is within a friendly non-HERO ARCANITE unit’s combat range:\n\n• This unit has WARD (4+).\n• Each time you make a successful ward roll for this unit, allocate 1 damage point to a friendly non-HERO ARCANITE unit within this unit’s combat range after the damage sequence for this unit has been resolved (ward rolls cannot be made for those damage points)."
        },
        {
          "name": "Wrath of the Thaumaturge",
          "phase": "chargePhase",
          "phaseDetails": "Once Per Turn (Army), Any Charge Phase",
          "icon": "movement",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "With a sweep of its staff, the Thaumaturge steps into a rift to the Crystal Labyrinth, only to re-emerge in the midst of foes who have had the temerity to assault its devotees.",
          "declare": "If this unit is not in combat, pick a friendly ARCANITE unit in combat to be the target.",
          "effect": "Remove this unit from the battlefield and set it up again within 1\" of the target and in combat. This unit has charged.",
          "keywords": ["Core", "Charge"]
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "requiredKeywords": ["Arcanite"],
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "99f36945-573a-594c-8fbb-573c31bb96c2",
      "name": "Screamers of Tzeentch",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": ["Daemon", "Beast", "Ward (6+)", "Fly"],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "Screamers are sky-sharks that ride upon currents of magic. These daemons drift about, fangs constantly gnashing and eyes revolving on their flattened undersides as they hunt for prey. Souls are their favoured delicacy, but aetheric energies are similarly ripe for consumption. Mortal flesh makes for a fine meal, too – though the act of ripping open prey with their circular, shredding maws sustains the Screamers far more than any physical nourishment.\n\nChampions of Tzeentch have long used Screamers as aerial shock cavalry. They are single-minded in hunting for their next mouthful of magic; Screamer shoals have been known to chase endless spells across entire landmasses. Sharpened spines and ridges jut out from the Screamers’ sleek forms, and the speeds they can reach make them deadly living missiles. Screamer shoals dart through an enemy formation without pause, scything down foes without breaking pace. Even monsters must be wary of these daemons; there are tales of Mega-Gargants that thought to pluck one of these strange beasts out of the sky for a quick snack, only to be whittled down to the bone by a sudden hurricane of fangs.",
      "referenceKeywords": "Beast, Fly, Ward (6+), Chaos, Disciples of Tzeentch, Daemon",
      "stats": {
        "move": "14\"",
        "save": "5+",
        "control": "1",
        "health": "3",
        "ward": "6+"
      },
      "points": 80,
      "modelCount": 3,
      "baseSize": "32mm",
      "cannotBeReinforced": false,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Lamprey Bite",
            "type": "melee",
            "range": null,
            "attacks": "3",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "1",
            "abilities": ["Anti-MONSTER (+1 Rend)", "Companion"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Beast",
          "phase": "endOfTurn",
          "phaseDetails": "Passive",
          "icon": "control",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": null,
          "declare": null,
          "effect": "This unit has a maximum control score of 1."
        },
        {
          "name": "Slashing Fins",
          "phase": "movementPhase",
          "phaseDetails": "Your Movement Phase",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "A pack of Screamers travelling at great speed can slash and eviscerate an enemy formation to ribbons.",
          "declare": "Pick an enemy unit that this unit passed across this phase to be the target.",
          "effect": "Roll a dice for each model in this unit that passed across the target. For each 4+, inflict 1 mortal damage on the target."
        }
      ],
      "notes": null
    },
    {
      "id": "8f97f28d-d72f-550d-90f4-4d36b3406bf7",
      "name": "The Blue Scribes",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": [
        "Daemon",
        "Wizard",
        "Disc of Tzeentch",
        "Unique",
        "Ward (6+)",
        "Fly",
        "Cavalry",
        "Hero"
      ],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "Tzeentch created two daemons, P’tarix and Xirat’p, for the sole purpose of learning every spell in existence. The Blue Scribes, as they are known, ride their Disc of Tzeentch through the realms seeking every fragment of arcana.",
      "referenceKeywords": "Unique, Hero, Wizard (1), Cavalry, Fly, Ward (6+), Chaos, Disciples of Tzeentch, Daemon, Disc of Tzeentch",
      "stats": {
        "move": "14\"",
        "save": "4+",
        "control": "2",
        "health": "5",
        "ward": "6+"
      },
      "points": 180,
      "modelCount": 1,
      "baseSize": "60mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Sharpened Quills",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "5+",
            "wound": "5+",
            "rend": "-",
            "damage": "1",
            "abilities": []
          },
          {
            "name": "Disc’s Teeth and Horns",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "D3",
            "abilities": ["Companion"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Treacherous Bond",
          "phase": "heroPhase",
          "phaseDetails": "Your Hero Phase",
          "icon": "defensive",
          "castingValue": 5,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "By creating a psycho-conductive link, the Blue Scribes can siphon the worst of any harm that befalls them to allies nearby.",
          "declare": "Pick a friendly unit within this unit’s combat range to be the target, then make a casting roll of 2D6.",
          "effect": "Until the start of your next turn:\n\n• This unit has WARD (4+).\n• Each time you make an unmodified ward roll of 1-3 for this unit, allocate 1 damage point to the target.",
          "keywords": ["Spell"]
        },
        {
          "name": "Scrolls of Sorcery",
          "phase": "heroPhase",
          "phaseDetails": "Your Hero Phase",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The unlimited arcane knowledge held on these scrolls can conjure sorceries of perfect structure.",
          "declare": null,
          "effect": "The next time this unit uses a non‑SUMMON SPELL ability this phase, do not make a casting roll as part of that ability. Instead, roll a dice. On a 2+, the spell is successfully cast and cannot be unbound."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "requiredKeywords": ["Tzeentchian Deceiver"],
          "linkedWarscroll": null
        },
        {
          "points": null,
          "requiredKeywords": ["Daemon"],
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "cbb00f4f-fc66-5f65-b241-a578ff33f8f9",
      "name": "The Changeling",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": [
        "Daemon",
        "Wizard",
        "Unique",
        "Infantry",
        "Ward (6+)",
        "Tzeentchian Deceiver",
        "Hero"
      ],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "The daemon known as the Changeling is Tzeentch’s prime agent of misrule. None but the Lord of Flux has ever laid eyes upon this shapeshifting trickster’s true face, for it has assumed countless identities and guises over the centuries. Amongst its greatest coups was thieving seven of Nurgle’s sacred tomes from their place beside the Plague God’s cauldron, bringing Tzeentch many of his rival’s secrets. Arguably the Changeling’s grandest deception, though, was creating the persona of Valius Maliti, the master architect who designed many of the first Cities of Sigmar. In these bastions of Order, therefore, lie subtle flaws, ready for exploitation by Tzeentch’s legions.\n\nThe Changeling considers engaging in battle to be a personal failure, for spreading discord from the shadows is far more satisfying. Even so, there is a certain thrill to be found in impersonating officers and trusted companions, misinterpreting or mislaying orders so that an enemy force finds itself suddenly vulnerable amidst the carnage of war. Should the Changeling’s disguise somehow be seen through, this is no great concern to the daemon; the eldritch fires it summons and the form-shifting powers of its Trickster’s Staff can overcome most potential impediments.",
      "referenceKeywords": "Unique, Hero, Wizard (2), Infantry, Ward (6+), Chaos, Disciples of Tzeentch, Daemon",
      "stats": {
        "move": "5\"",
        "save": "5+",
        "control": "2",
        "health": "6",
        "ward": "6+"
      },
      "points": 160,
      "modelCount": 1,
      "baseSize": "40mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "The Trickster’s Staff",
            "type": "melee",
            "range": null,
            "attacks": "3",
            "hit": "3+",
            "wound": "3+",
            "rend": "1",
            "damage": "D3",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Discord and Confusion",
          "phase": "heroPhase",
          "phaseDetails": "Your Hero Phase",
          "icon": "defensive",
          "castingValue": 6,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The Changeling is a master of deception and bait-and-switch tactics.",
          "declare": "Make a casting roll of 2D6.",
          "effect": "Subtract 1 from hit rolls for attacks that target this unit until the start of your next turn.\n\nIn addition, until the start of your next turn, roll a dice each time this unit is targeted by an ability that is not an ATTACK ability. On a 4+, another eligible unit must be targeted by that ability instead of this unit. If it is not possible to target another unit, that ability has no effect.",
          "keywords": ["Spell"]
        },
        {
          "name": "Puckish Misdirection",
          "phase": "heroPhase",
          "phaseDetails": "Enemy Hero Phase",
          "icon": "movement",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The Changeling can manipulate the most stalwart of warriors while appearing as a trusted advisor or comrade.",
          "declare": "Pick an enemy unit within 9\" of this unit to be the target.",
          "effect": "Roll a dice. On a 3+, halve the target’s Move characteristic for the rest of the turn."
        },
        {
          "name": "Arch-Deceiver",
          "phase": "startOfTurn",
          "phaseDetails": "Deployment Phase",
          "icon": "movement",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "None can detect the veil of the Changeling. Assuming the form of comrade and ally, it reveals itself only when its plans have been made a reality.",
          "declare": null,
          "effect": "Remove this unit from the battlefield and set it up again on the battlefield more than 3\" from all enemy units."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "requiredKeywords": ["Daemon"],
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "8166198a-6c84-5103-9a80-ab4ec6d66c08",
      "name": "Tome of Eyes",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": ["Manifestation", "Endless Spell", "Ward (6+)"],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "In a plume of unholy flame, the Tome of Eyes is conjured from the depths of Tzeentch’s libraries. Fire crackles along its parchment but never obscures the fell symbols therein. Eyes sprout across the pages, beholding the caster as intently as the wizard studies the Tome in turn. Even briefly consulting the Tome unlocks new paradigms of arcane practice, with spells once far beyond the caster’s ability becoming simple. New runes of insight appear even as the reader’s eyes reach them. None can say who composes these scribblings – perhaps one of the daemon scribes of Tzeentch’s court or even a fragmented aspect of the god himself.\n\nYet no gift of Chaos is given freely. The runes within the Tome of Eyes are elements of a terrible hex, one that takes full form as a reader plunges recklessly through its pages. The end result of the Parchment Curse is always the same: the victim transforms into scattered sheaves of paper, each detailing a twisted version of their life story. A talented mage may be able to transfer the accumulating energies of the curse from their mind into an unwilling target. Yet eventually the hunger for knowledge resurfaces, and the Tome awaits…",
      "referenceKeywords": "Manifestation, Endless Spell, Ward (6+), Chaos, Disciples of Tzeentch",
      "stats": {
        "move": "-",
        "save": "4+",
        "control": "7+",
        "health": "5",
        "ward": "6+"
      },
      "points": null,
      "modelCount": 1,
      "baseSize": "50mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {},
      "abilities": [
        {
          "name": "Transfixed by Countless Eyes",
          "phase": "heroPhase",
          "phaseDetails": "Reaction: You declared a SPELL ability for a WIZARD within this MANIFESTATION’s combat range",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": true,
          "lore": "As the Tome flicks through its endless pages, it peers into the mind of its summoner, giving knowledge to the loyal and punishing the insatiable as it sees fit.",
          "declare": null,
          "effect": "You can add 1 or 2 to the casting roll for that spell. Roll a number of dice equal to the amount added. For each 1-2, allocate 1 damage point to the caster. If the caster is destroyed by this ability, the spell has no effect."
        }
      ],
      "notes": null
    },
    {
      "id": "ab6b609e-f4b8-5ca6-968c-d3c04679477e",
      "name": "Tzaangor Enlightened",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": ["Champion", "Warflock", "Infantry", "Arcanite"],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "Tzaangor Enlightened are even more physically imposing than typical Tzaangors. Each is armed with a spear of changemetal, a protean substance that can be fashioned only by those gifted in the sorceries of change, which flickers and morphs to better slip through enemy defences. Yet these tangible boons are secondary to the creatures’ strangest ability: through mere proximity, they can glean echoes of past events, hidden truths and suppressed secrets. Even hardened warriors cannot help but flinch as their most buried insecurities are suddenly laid bare – giving the Enlightened ample opportunity to run them through.\n\nThe Enlightened often serve as bodyguards and shock troops for Arcanite cult leaders, permitted to seize their choice of magical plunder in exchange for their dubious loyalties. They are valued not only for their physical brawn but also for their propensity for unveiling the secrets of fellow Arcanites. Of course, there is no guarantee that the Enlightened are not themselves lying. For these Tzaangors, the ambitions of fellow Tzeentch worshippers are things to examine and exploit, much like the secrets of their adversaries. To prey upon the weaknesses of others fills them with a malicious glee most pleasing to the Change God.",
      "referenceKeywords": "Infantry, Champion, Chaos, Disciples of Tzeentch, Arcanite, Warflock",
      "stats": {
        "move": "6\"",
        "save": "4+",
        "control": "1",
        "health": "3",
        "ward": null
      },
      "points": 90,
      "modelCount": 3,
      "baseSize": "40mm",
      "cannotBeReinforced": false,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Tzeentchian Spear and Vicious Beak",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "2",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Babbling Stream of Secrets",
          "phase": "chargePhase",
          "phaseDetails": "Any Charge Phase",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The dark truths revealed by the Tzaangor Enlightened utterly unnerve the foe.",
          "declare": "If this unit charged this phase, pick an enemy unit in combat with it to be the target.",
          "effect": "Roll a dice. On a 3+, the target cannot use commands for the rest of the turn."
        }
      ],
      "notes": null
    },
    {
      "id": "495906c8-700b-5741-93fa-9850373fe91a",
      "name": "Tzaangor Enlightened on Discs of Tzeentch",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": [
        "Champion",
        "Warflock",
        "Disc of Tzeentch",
        "Fly",
        "Cavalry",
        "Arcanite"
      ],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "Tzaangor Enlightened are even more physically imposing than typical Tzaangors. Each is armed with a spear of changemetal, a protean substance that can be fashioned only by those gifted in the sorceries of change, which flickers and morphs to better slip through enemy defences. Yet these tangible boons are secondary to the creatures’ strangest ability: through mere proximity, they can glean echoes of past events, hidden truths and suppressed secrets. Even hardened warriors cannot help but flinch as their most buried insecurities are suddenly laid bare – giving the Enlightened ample opportunity to run them through.\n\nThe most favoured Enlightened are granted daemonic conveyances known as Discs of Tzeentch to carry them into battle. They flock around the Shamans of their kind, forming a screeching honour guard. When their arcane master demands that some critical nexus of magic be seized, it is their Enlightened who see it done. Approaching the target at terrible speed, they shriek out the secrets of entrenched enemies, cackling in delight as confusion and horror reigns. It is then that the Enlightened dive into the melee, letting their spears and the spinning blades of their Discs facilitate the crude but satisfying business of slaughter.",
      "referenceKeywords": "Cavalry, Champion, Fly, Chaos, Disciples of Tzeentch, Arcanite, Warflock, Disc of Tzeentch",
      "stats": {
        "move": "14\"",
        "save": "4+",
        "control": "1",
        "health": "4",
        "ward": null
      },
      "points": 140,
      "modelCount": 3,
      "baseSize": "40mm",
      "cannotBeReinforced": false,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Tzeentchian Spear and Vicious Beak",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "2",
            "abilities": []
          },
          {
            "name": "Disc’s Teeth and Horns",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "D3",
            "abilities": ["Companion"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Guided by the Past",
          "phase": "combatPhase",
          "phaseDetails": "Passive",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "These warriors see at once every moment that led to the present and seek retribution against those who set the chain of events in motion.",
          "declare": null,
          "effect": "This unit’s Tzeentchian Spears and Vicious Beaks have Charge (+1 Damage) if you are the underdog or it was determined at the start of the battle round that you would take the second turn."
        }
      ],
      "notes": null
    },
    {
      "id": "e08b3213-8089-5d1c-b824-a10e1706d2e7",
      "name": "Tzaangor Shaman",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": [
        "Warflock",
        "Wizard",
        "Disc of Tzeentch",
        "Fly",
        "Cavalry",
        "Arcanite",
        "Hero"
      ],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "Tzaangor Shamans are the most powerful of their bestial kind. Born amongst dark omens, they are favoured by the Architect of Fate and granted a daemonic Disc to raise them above their kin. They combine savage strength with instinctive magical prowess, a combination that few can resist.\n\nTzaangor Shamans are revered by their warflocks, for they wield the ability to transmute others into Tzaangors. Any struck by the blue-tinged bolts of mutagenic energy they conjure are wracked with agonising contortions, their skulls splitting as sharp beaks push forth and their bodies sprout rough spines. Before long, the afflicted rise as glistening Tzaangors, ready to join the Shaman’s ranks.\n\nTzaangor believe that, by imbibing potions of distilled mage-blood, their Shamans enter a trance that allows them to spirit-walk into the Realm of Chaos and receive commands from the Lords of Change. Some Shamans are ordered to lend guidance to an Arcanite cult, whilst others remain with their warflocks. These mutant sorcerers guide their kin in all manner of rituals, lead hunts for arcane treasures or oversee the rising of flux-cairns that distort magic into forms more pleasing to the Changer of the Ways.",
      "referenceKeywords": "Hero, Wizard (1), Cavalry, Fly, Chaos, Disciples of Tzeentch, Arcanite, Warflock, Disc of Tzeentch",
      "stats": {
        "move": "14\"",
        "save": "5+",
        "control": "2",
        "health": "6",
        "ward": null
      },
      "points": 150,
      "modelCount": 1,
      "baseSize": "40mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Disc’s Teeth and Horns",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "D3",
            "abilities": ["Companion"]
          },
          {
            "name": "Staff of Change and Ritual Dagger",
            "type": "melee",
            "range": null,
            "attacks": "3",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "D3",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Rite of Haste",
          "phase": "heroPhase",
          "phaseDetails": "Your Hero Phase",
          "icon": "movement",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Tzaangor Shamans guide their warflocks through fell rites to push them beyond their mortal limits.",
          "declare": "Pick a friendly WARFLOCK unit that does not have FLY and is wholly within 12\" of this unit to be the target.",
          "effect": "Roll a dice. On a 3+, for the rest of the turn, the target can use a RUN ability and still use SHOOT and/or CHARGE abilities later in the turn."
        },
        {
          "name": "Mutagenic Sorcery",
          "phase": "endOfTurn",
          "phaseDetails": "End of Any Turn",
          "icon": "rallying",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "As warriors fall around the Tzaangor, some mutate to become the creature that struck them down.",
          "declare": "Pick an enemy unit within 12\" of this unit to be the enemy target. Then, pick a friendly Tzaangors unit in combat with that enemy unit to be the friendly target.",
          "effect": "Roll a D3. On a 2+:\n\n• Inflict an amount of mortal damage on the enemy target equal to the roll.\n• Return a number of slain models to the friendly target equal to the roll."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "requiredKeywords": ["Arcanite Cabalist"],
          "linkedWarscroll": null
        },
        {
          "points": null,
          "requiredKeywords": ["Arcanite"],
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "fbb776c7-2d2b-57b3-8a8d-fc3ed4443f8b",
      "name": "Tzaangor Skyfires",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": [
        "Champion",
        "Warflock",
        "Disc of Tzeentch",
        "Fly",
        "Cavalry",
        "Arcanite"
      ],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "Skyfires are bestial agents of Tzeentch, charged with ensuring that his intricate schemes continue without impediment. It is their gift to glimpse potential futures and their curse that they can never speak of them. In contrast to their trilling kin, Skyfires are utterly silent, their eyes blazing with tortured frustration at their inability to voice their half-glimpsed potentials.\n\nThose who observe a Skyfire may find themselves perplexed, for the creature appears to shoot their arrows on seemingly aimless trajectories. Yet with unsettling inevitably, their targets find themselves in the projectile’s path, losing their footing or becoming distracted at a critical moment. All this has been foreseen by the Skyfire; they have accounted for as many possible futures as their fractured mind can handle, removing impediments to their arrows striking.\n\nSkyfires excel as assassins, pursuing those who would hinder Tzeentch’s designs. The Discs of Tzeentch they ride upon help them to keep pace with their prey. Attempting to wield a bow while riding one of these swift daemon-forms would normally be a futile endeavour, but the Skyfires’ foresight allows them to maintain a degree of accuracy and keep one step ahead of those marked for death.",
      "referenceKeywords": "Cavalry, Champion, Fly, Chaos, Disciples of Tzeentch, Arcanite, Warflock, Disc of Tzeentch",
      "stats": {
        "move": "14\"",
        "save": "4+",
        "control": "1",
        "health": "4",
        "ward": null
      },
      "points": 170,
      "modelCount": 3,
      "baseSize": "40mm",
      "cannotBeReinforced": false,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Arrow of Fate",
            "type": "ranged",
            "range": "18\"",
            "attacks": "2",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "D3",
            "abilities": []
          }
        ],
        "melee": [
          {
            "name": "Bow Stave and Vicious Beak",
            "type": "melee",
            "range": null,
            "attacks": "1",
            "hit": "4+",
            "wound": "3+",
            "rend": "-",
            "damage": "1",
            "abilities": []
          },
          {
            "name": "Disc’s Teeth and Horns",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "D3",
            "abilities": ["Companion"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Judgement From Afar",
          "phase": "shootingPhase",
          "phaseDetails": "Your Shooting Phase",
          "icon": "shooting",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "To be struck by an Arrow of Fate is to be judged by destiny itself.",
          "declare": "Pick an enemy unit that had any damage points allocated to it by this unit’s attacks this phase to be the target.",
          "effect": "Add 1 to hit rolls for combat attacks made by friendly WARFLOCK units that target that enemy unit for the rest of the turn."
        },
        {
          "name": "Guided by the Future",
          "phase": "shootingPhase",
          "phaseDetails": "Passive",
          "icon": "shooting",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The attacks of these warriors are directed by glimpses of the future.",
          "declare": null,
          "effect": "Ignore negative modifiers to hit rolls and wound rolls for this unit’s shooting attacks."
        }
      ],
      "notes": null
    },
    {
      "id": "e85ddded-ae0b-50c9-9d7e-65252d576e15",
      "name": "Tzaangors",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factions": ["Disciples of Tzeentch"],
      "keywords": [
        "Champion",
        "Standard Bearer",
        "Warflock",
        "Musician",
        "Infantry",
        "Arcanite"
      ],
      "factionKeywords": ["Grand Alliance Chaos", "Disciples of Tzeentch"],
      "fluff": "Tzaangors are a strange species, their origins as varied as they are horrific. Some were once gor-kin, corrupted by the Change God. Others are humans who have been subjected – sometimes willingly, but more often not – to horrific rituals of transmogrification. Yet more are beast-children, abandoned by their birth families but raised by Arcanite cults.\n\nBelieving themselves to be uniquely blessed by Tzeentch, Tzaangors possess a greater command of speech than other Chaos beastmen, though their voices are reedy and avian. They are drawn to the arcane, seeking to amass it wherever it is found – whether a thaumaturgical relic or a confluence of ley lines, the Tzaangors covet it all the same.\n\nTzaangors carry a variety of ornate blades crafted by their cultist allies, which they wield with surprising skill. They supplement these with vicious natural weapons, such as stabbing beaks that can pierce a human’s skull. Many Tzaangors also possess limited prophetic abilities; though this foreknowledge renders their movements twitchy and unnatural, they take great pride in what they see as a boon of their patron, and they jealously hoard any gleaned secrets.",
      "referenceKeywords": "Infantry, Champion, Musician (1/10), Standard Bearer (1/10), Chaos, Disciples of Tzeentch, Arcanite, Warflock",
      "stats": {
        "move": "6\"",
        "save": "5+",
        "control": "1",
        "health": "2",
        "ward": null
      },
      "points": 150,
      "modelCount": 10,
      "baseSize": "32mm",
      "cannotBeReinforced": false,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Savage Blade and Vicious Beak",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "1",
            "abilities": []
          },
          {
            "name": "Savage Greatblade",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "2",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Screeching Raiders",
          "phase": "combatPhase",
          "phaseDetails": "Passive",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Tzaangor flocks are ferocious when ransacking enemy territory for arcane secrets.",
          "declare": null,
          "effect": "While this unit is wholly within enemy territory, its weapons have Crit (2 Hits)."
        }
      ],
      "notes": null
    }
  ],
  "battleFormations": [
    {
      "id": "52b7aff7-02fe-5b7d-b75a-a88a5e412fd1",
      "name": "Tzaangor Coven",
      "cardType": "BattleFormation",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factionTerrainLimit": 1,
      "isLegends": false,
      "points": null,
      "rules": [
        {
          "name": "Screeching Warflock",
          "phase": "heroPhase",
          "phaseDetails": "Passive",
          "icon": "rallying",
          "lore": "The promise of new-found knowledge or arcane trinkets spurs the bestial Tzaangors into a frenzy.",
          "declare": null,
          "effect": "Each time a friendly WARFLOCK unit uses the ‘Rally’ command, you can make 3 additional rally rolls of D6.",
          "cpCost": null,
          "isReaction": false
        }
      ]
    },
    {
      "id": "bf21eb3f-c440-558c-89b1-5cc0e2990d7a",
      "name": "Wyrdflame Host",
      "cardType": "BattleFormation",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factionTerrainLimit": 1,
      "isLegends": false,
      "points": null,
      "rules": [
        {
          "name": "Mutagenic Inferno",
          "phase": "defensive",
          "phaseDetails": "Passive",
          "icon": "defensive",
          "lore": "Those set ablaze by a Wyrdflame Host find their bodies writhing with possibility, stealing strength and focus from their sword-arms.",
          "declare": null,
          "effect": "Subtract 1 from wound rolls for attacks made by BURNING enemy units.",
          "cpCost": null,
          "isReaction": false
        }
      ]
    },
    {
      "id": "b09c062b-2f34-52c8-b0f4-77eda7f4f507",
      "name": "Arcanite Cabal",
      "cardType": "BattleFormation",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factionTerrainLimit": 1,
      "isLegends": false,
      "points": null,
      "rules": [
        {
          "name": "Sinister Counter-hexes",
          "phase": "heroPhase",
          "phaseDetails": "Passive",
          "icon": "special",
          "lore": "Arcanite cultists delight in unravelling the spellcraft of other, less blessed mages.",
          "declare": null,
          "effect": "Add 1 to unbinding rolls for friendly ARCANITE units. In addition, if a friendly ARCANITE unit unbinds a spell, no command points are spent for that unit to use the ‘Magical Intervention’ command in that phase.",
          "cpCost": null,
          "isReaction": false
        }
      ]
    },
    {
      "id": "4c06b064-7245-54c9-abad-23f783a575e0",
      "name": "Change Host",
      "cardType": "BattleFormation",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factionTerrainLimit": 1,
      "isLegends": false,
      "points": null,
      "rules": [
        {
          "name": "Twist of Fate",
          "phase": "endOfTurn",
          "phaseDetails": "Once Per Battle (Army), End of Your Turn",
          "icon": "movement",
          "lore": "To battle a Change Host is a sanity-warping experience, for the Great Conspirator’s servants make mockery of the laws of nature.",
          "declare": "Pick a friendly DISCIPLES OF TZEENTCH DAEMON unit that is in combat to be the target.",
          "effect": "Roll a dice. On a 3+, remove the target from the battlefield and set it up again on the battlefield. Each model in the target unit must be set up in combat with any of the enemy units that the target was in combat with before it was removed from the battlefield.",
          "cpCost": null,
          "isReaction": false
        }
      ]
    },
    {
      "id": "fd6179a9-79e2-506a-90c5-199faa20b9c7",
      "name": "Masters of Fate",
      "cardType": "BattleFormation",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factionTerrainLimit": 1,
      "isLegends": false,
      "points": null,
      "rules": [
        {
          "name": "Symbiotic Madness",
          "phase": "combatPhase",
          "phaseDetails": "Passive",
          "icon": "offensive",
          "lore": "Arcanites who battle alongside the daemons of their manipulative deity receive maddening glimpses of the twisting strands of fate, allowing them to take advantage of fleeting gaps in their foes’ defences in the press of combat.",
          "declare": null,
          "effect": "Friendly ARCANITE units’ melee weapons have Crit (2 Hits) while they are wholly within 12\" of a friendly DISCIPLES OF TZEENTCH DAEMON unit.",
          "cpCost": null,
          "isReaction": false
        }
      ]
    },
    {
      "id": "89c0edbd-c1cf-5d5a-afa4-217f484bf4e6",
      "name": "Spellweaver Coven",
      "cardType": "BattleFormation",
      "source": "aos-4e",
      "faction_id": "DISCIPLES_OF_TZEENTCH",
      "factionTerrainLimit": 1,
      "isLegends": false,
      "points": null,
      "rules": [
        {
          "name": "Sorcerers of War",
          "phase": "combatPhase",
          "phaseDetails": "Once Per Turn (Army), Your Combat Phase",
          "icon": "special",
          "lore": "These champions of Tzeentch bring the fires of change directly to their god’s foes, revelling in the infinite fractals of fate that spiral from the madness of a melee.",
          "declare": "Pick a friendly DISCIPLES OF TZEENTCH WIZARD that is in combat to be the target.",
          "effect": "The target can use a non-SUMMON SPELL ability as if it were your hero phase, but only the caster or enemy units in combat with the caster can be picked to be the targets of that SPELL ability.",
          "cpCost": null,
          "isReaction": false
        }
      ]
    }
  ],
  "lores": [],
  "enhancements": {
    "artefacts": [
      {
        "id": "41a3c8f2-1041-5cbe-953e-c559b55d5374",
        "name": "Ambition's End",
        "cardType": "Enhancement",
        "enhancementType": "artefactsOfPower",
        "source": "aos-4e",
        "points": null,
        "phase": "combatPhase",
        "phaseDetails": "Once Per Battle, Any Combat Phase",
        "icon": "special",
        "lore": "Many a sorcerer’s quest to master the magical arts has ended upon this weapon’s blade, for it spills not only blood but knowledge itself.",
        "declare": "Pick an enemy WIZARD in combat with this unit to be the target.",
        "effect": "Inflict D3 mortal damage on the target. In addition, subtract 1 from casting rolls for the target for the rest of the battle.",
        "cpCost": null
      },
      {
        "id": "0b4ead50-61ad-516a-a68f-8dff0d2725ed",
        "name": "Nine-eyed Tome",
        "cardType": "Enhancement",
        "enhancementType": "artefactsOfPower",
        "source": "aos-4e",
        "points": 20,
        "phase": "heroPhase",
        "phaseDetails": "Passive",
        "icon": "special",
        "lore": "Some of the most terrible arcane secrets known to the Change God are contained within this ancient tome, the surface of which is dotted with unblinking eyes.",
        "declare": null,
        "effect": "Add 1 to casting rolls and banishment rolls for this unit.",
        "cpCost": null
      },
      {
        "id": "3fc87ebe-e382-5238-8165-db7930c3b96b",
        "name": "Wyrdflame Blade",
        "cardType": "Enhancement",
        "enhancementType": "artefactsOfPower",
        "source": "aos-4e",
        "points": null,
        "phase": "combatPhase",
        "phaseDetails": "Passive",
        "icon": "special",
        "lore": "The flames that flicker around the bearer’s blade can ignite the soul of its victim.",
        "declare": null,
        "effect": "If any damage points are allocated to an enemy unit by this unit’s combat attacks, that enemy unit has the BURNING keyword.",
        "cpCost": null
      },
      {
        "id": "053bb2b4-e957-5eb5-9e45-7c5f75e386fc",
        "name": "Mutating Blade",
        "cardType": "Enhancement",
        "enhancementType": "artefactsOfPower",
        "source": "aos-4e",
        "points": null,
        "phase": "startOfTurn",
        "phaseDetails": "Deployment Phase",
        "icon": "offensive",
        "lore": "An iridescent flamberge, an axe with nine edges, a lash ending in an eagle’stalon: the form of the bearer’s weapon constantly shifts, making its strikes impossible to predict.",
        "declare": null,
        "effect": "Pick 1 of this unit’s melee weapons. That weapon’s Attacks characteristic is 2D6 for the rest of the battle.",
        "cpCost": null
      },
      {
        "id": "d4d4d398-4393-5169-b176-6250027cba69",
        "name": "Arcane Siphon",
        "cardType": "Enhancement",
        "enhancementType": "artefactsOfPower",
        "source": "aos-4e",
        "points": null,
        "phase": "heroPhase",
        "phaseDetails": "Once Per Turn (Army), Your Hero Phase",
        "icon": "special",
        "lore": "This enigmatic device can drain the animating force from nearby magical emanations and transmute it into a shimmering, rejuvenating tonic.",
        "declare": "Pick a visible MANIFESTATION (friendly or enemy) that was not set up this turn and is within 12\" of this unit to be the target.",
        "effect": "Roll a dice. On a 3+:\n• The target is banished.\n• Heal (X) this unit, where X is the target’s Health characteristic.",
        "cpCost": null
      },
      {
        "id": "04d2d353-5989-5985-8b25-13be58671736",
        "name": "Spell-Catcher Amulet",
        "cardType": "Enhancement",
        "enhancementType": "artefactsOfPower",
        "source": "aos-4e",
        "points": null,
        "phase": "heroPhase",
        "phaseDetails": "Once Per Turn (Army), Your Hero Phase",
        "icon": "special",
        "lore": "This amulet, in the shape of an unblinking eye, devours the residual energies of arcane manifestations that have been unravelled, re-imagining them in forms more pleasing to the Changer of the Ways.",
        "declare": "This unit can use this ability if any enemy MANIFESTATIONS were banished this phase.",
        "effect": "This unit can use a SUMMON ability from the manifestation lore you picked during army composition. That SUMMON ability does not count towards the total number of SPELL or BANISH abilities this unit can use this phase.",
        "cpCost": null
      }
    ],
    "heroicTraits": [
      {
        "id": "3520460e-2b32-5129-8967-c579758fc498",
        "name": "Illusionist",
        "cardType": "Enhancement",
        "enhancementType": "heroicTraits",
        "source": "aos-4e",
        "points": 20,
        "phase": "defensive",
        "phaseDetails": "Passive",
        "icon": "defensive",
        "lore": "This warrior uses misdirection and cunning to render their enemies clueless.",
        "declare": null,
        "effect": "Subtract 1 from hit rolls for attacks that target friendly units while they are wholly within this unit’s combat range.",
        "cpCost": null
      },
      {
        "id": "8e786920-5640-5038-93cb-90f44a069168",
        "name": "Cult Demagogue",
        "cardType": "Enhancement",
        "enhancementType": "heroicTraits",
        "source": "aos-4e",
        "points": null,
        "phase": "heroPhase",
        "phaseDetails": "Passive",
        "icon": "special",
        "lore": "This cabalist’s resounding spells draw the gaze of their master’s minions quicker than most.",
        "declare": null,
        "effect": "If each dice in a casting roll for this unit has the same value and the spell is not miscast, add 3 to the casting roll.",
        "cpCost": null
      },
      {
        "id": "3f96d4a7-84a2-5c8b-a4ec-089e4816549e",
        "name": "Nexus of Fate",
        "cardType": "Enhancement",
        "enhancementType": "heroicTraits",
        "source": "aos-4e",
        "points": null,
        "phase": "heroPhase",
        "phaseDetails": "Your Hero Phase",
        "icon": "special",
        "lore": "Tzeentch’s favoured servants manipulate what mortals consider ‘destiny’ as if it were a puppet.",
        "declare": null,
        "effect": "Roll a dice. You must replace 1 of your destiny dice with that roll.",
        "cpCost": null
      }
    ],
    "other": [
      {
        "id": "d883c13c-f4ab-5dfa-81cd-beddd8d1b617",
        "name": "Bolt of Tzeentch",
        "cardType": "Enhancement",
        "enhancementType": "regimentOfRenown",
        "source": "aos-4e",
        "points": null,
        "phase": "heroPhase",
        "phaseDetails": "Your Hero Phase",
        "icon": "offensive",
        "lore": "This spell manifests as a prismatic beam of raw magic that tears its victims apart in a display of multispectral colour.",
        "declare": "Pick the Magister in this Regiment of Renown to cast this spell, pick a visible enemy unit within 18\" of them to be the target, then make a casting roll of 2D6.",
        "effect": "Inflict D3 mortal damage on the target.",
        "cpCost": 6,
        "keywords": ["Wyrdflame", "Spell", "Unlimited"]
      },
      {
        "id": "2b7002ba-c51d-5853-ab61-defc0aa6d942",
        "name": "Flickering Wyrdflame",
        "cardType": "Enhancement",
        "enhancementType": "regimentOfRenown",
        "source": "aos-4e",
        "points": null,
        "phase": "endOfTurn",
        "phaseDetails": "Once Per Turn (Army), End of Any Turn",
        "icon": "offensive",
        "lore": "These unnatural flames warp and mutate even as they burn and devour.",
        "declare": "Pick an enemy unit that had any damage points inflicted on it this turn by WYRDFLAME SPELL abilities or attacks made with weapons that have the WYRDFLAME weapon ability to be the target.",
        "effect": "Roll a D3. On a 2+, inflict an amount of mortal damage on the target equal to the roll.",
        "cpCost": null
      },
      {
        "id": "9524b30f-117d-5580-a6d1-52894cd05cb8",
        "name": "Skilled Summoner",
        "cardType": "Enhancement",
        "enhancementType": "regimentOfRenown",
        "source": "aos-4e",
        "points": null,
        "phase": "heroPhase",
        "phaseDetails": "Your Hero Phase",
        "icon": "special",
        "lore": "Thryx is a master at manipulating the arcane manifestations of the Change God.",
        "declare": "Pick the Magister in this Regiment of Renown to cast this spell, pick 1 of the MANIFESTATIONS from the list below that is not on the battlefield, then make a casting roll of 2D6:\n\n• 1 Burning Sigil of Tzeentch\n• 1 Tome of Eyes\n• 1 Daemonic Simulacrum",
        "effect": "If there is already a friendly MANIFESTATION from the list above on the battlefield, it is immediately banished. Then, set up the MANIFESTATION you picked within 1\" of the caster and visible to them. If that MANIFESTATION is a Daemonic Simulacrum, it must also be set up more than 9\" away from all enemy units.",
        "cpCost": 6,
        "keywords": ["Summon", "Spell"]
      },
      {
        "id": "cb7926e6-0aad-5297-ad60-20dea9e01d83",
        "name": "Sparks of Profane Potential",
        "cardType": "Enhancement",
        "enhancementType": "regimentOfRenown",
        "source": "aos-4e",
        "points": null,
        "phase": "startOfTurn",
        "phaseDetails": "Once Per Battle (Army), Deployment Phase",
        "icon": "special",
        "lore": "Thryx’s spells are powered by the stolen daemonic essences of the daemons bound to him.",
        "declare": null,
        "effect": "If the Magister in the Regiment of Renown has been deployed, set up one of the following MANIFESTATIONS within 1\" of them:\n\n• 1 Burning Sigil of Tzeentch\n• 1 Tome of Eyes\n• 1 Daemonic Simulacrum",
        "cpCost": null
      }
    ]
  },
  "terrain": [],
  "rules": {
    "battleTraits": [
      {
        "name": "Burning Wyrdflame",
        "phase": "endOfTurn",
        "phaseDetails": "Once Per Turn (Army), End of Any Turn",
        "icon": "offensive",
        "lore": "The profane flames that spew from the mouths and pointing fingers of the twisted worshippers of Tzeentch are nothing natural. Instead of merely scorching flesh, they cause horrific mutative wounds, causing skin and bones alike to bubble and twist.",
        "declare": null,
        "effect": "Inflict D3 mortal damage on each BURNING enemy unit, MANIFESTATION and faction terrain feature."
      },
      {
        "name": "Conflagration of Tzeentch",
        "phase": "shootingPhase",
        "phaseDetails": "Once Per Turn (Army), Any Shooting Phase",
        "icon": "special",
        "lore": "Many worshippers of Tzeentch desire one thing above all: to engulf the realms in an inferno of wyrdflame and watch in gleeful amusement as the world burns.",
        "declare": "Pick an enemy unit that had any damage points allocated to it this turn by WYRDFLAME SPELL abilities or shooting attacks made with weapons that have the Wyrdflame weapon ability to be the target.",
        "effect": "The target has the BURNING keyword."
      },
      {
        "name": "Quenching the Flames",
        "phase": "startOfTurn",
        "phaseDetails": "Passive",
        "icon": "special",
        "lore": "Those touched by wyrdflame thrash around desperately in an attempt to extinguish the mutagenic fires.",
        "declare": null,
        "effect": "If an ability would heal or return slain models to a BURNING enemy unit, MANIFESTATION or terrain feature, that ability does not heal or return any slain models to it. Instead, it no longer has the BURNING keyword."
      },
      {
        "name": "Masters of Destiny",
        "phase": "startOfTurn",
        "phaseDetails": "Deployment Phase",
        "icon": "special",
        "lore": "To serve the Changer of the Ways is to instinctively understand the ebb and flow of future events and be able to manipulate their potential to the fullest.",
        "declare": null,
        "effect": "Roll 9 dice and place them to one side. These are your destiny dice. Destiny dice can be spent during the battle to change certain dice rolls. You can never have more than 9 destiny dice at once.\n\nDuring the battle, instead of making a roll from the list below for a friendly DISCIPLES OF TZEENTCH unit, you can spend your destiny dice. The roll you would have made is replaced with the roll on the destiny dice you spend. If you want to replace a 2D6 roll, 3D6 roll, etc. you must spend a number of destiny dice equal to the number before ‘D6’. Any rolls that have been replaced count as unmodified rolls, and they cannot be re-rolled, they cannot be changed and they cannot be modified by other friendly abilities except for those that apply negative modifiers. (but they can be modified by enemy abilities). You cannot spend destiny dice to replace re-rolls.\n\nDestiny dice can be spent in place of the following dice rolls:\n• Casting rolls\n• Unbinding rolls\n• Banishment rolls\n• Run rolls\n• Charge rolls in your turn\n• Hit rolls\n• Wound rolls\n• Save rolls"
      }
    ]
  }
}
