{
  "id": "FYRESLAYERS",
  "name": "Fyreslayers",
  "grandAlliance": "Order",
  "parentFaction": null,
  "isLegends": false,
  "colours": {
    "banner": "#1E5B8C",
    "header": "#2A7AB8"
  },
  "updated": "2025-12-04T20:35:09.602Z",
  "compatibleDataVersion": 363,
  "warscrolls": [
    {
      "id": "66ebd827-d349-5909-a6d3-7631830f0c6a",
      "name": "Auric Flamekeeper",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "FYRESLAYERS",
      "factions": ["Fyreslayers"],
      "keywords": ["Duardin", "Infantry", "Ward (6+)", "Hero"],
      "factionKeywords": ["Grand Alliance Order", "Fyreslayers"],
      "fluff": "To the martial society of the Fyreslayers, death in battle is considered an honour – and often a certainty. It is for this reason that the solemn Auric Flamekeepers walk amongst their brethren, committing bodies to the flames and retrieving ur-gold runes from their flesh. In this way, the fallen might one day return to fight alongside Grimnir in the Doomgron – the final battle against darkness and malice. Despite their funerary obligations, like any other Fyreslayer, the Flamekeepers are formidable warriors. They take to battle in the most dire of circumstances, where their kin seek to emulate Grimnir’s last stand against his nemesis Vulcatrix.\n\nEach Flamekeeper carries a Masterflame Rune, a simmering ember of the First Fire that erupted in the wake of Grimnir’s shattering. Whenever a Fyreslayer warrior falls in proximity to this artefact, the blazing power within them is drawn forth; the ur-gold hammered into their body glows with a blinding light as their flesh and spirit is returned to the flames. A Flamekeeper can channel this force to bolster the runes of their brethren who remain in the fight, imbuing them with a stubborn resolve to annihilate their enemies and setting their fyresteel weapons alight.",
      "referenceKeywords": "Hero, Infantry, Ward (6+), Order, Fyreslayers, Duardin",
      "stats": {
        "move": "4\"",
        "save": "5+",
        "control": "2",
        "health": "5",
        "ward": "6+"
      },
      "points": 80,
      "modelCount": 1,
      "baseSize": "32mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Brazier Axe",
            "type": "melee",
            "range": null,
            "attacks": "5",
            "hit": "3+",
            "wound": "3+",
            "rend": "1",
            "damage": "2",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Masterflame Rune",
          "phase": "heroPhase",
          "phaseDetails": "Once Per Turn (Army), Your Hero Phase",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "A Flamekeeper’s sacred symbol of office can harness the power within ur-gold runes of fallen warriors to bestow blessings of Grimnir upon their brethren.",
          "declare": "If any friendly units have been destroyed during the battle, pick a friendly FYRESLAYERS INFANTRY unit wholly within 12\" of this unit to be the target.",
          "effect": "Roll a dice. If the roll is equal to or less than the number of FYRESLAYERS units that have been destroyed during the battle, pick 1 of the following effects to apply until the start of your next turn:\n\nGrimnir’s Grit: The target has WARD (5+).\n\nGrimnir’s Resolve: Add 2 to charge rolls for the target.\n\nGrimnir’s Vengeance: Add 1 to the Damage characteristic of the target’s melee weapons."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "1f6238cf-0ceb-50f0-bd1f-fa7dd47396c3",
      "name": "Auric Hearthguard",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "FYRESLAYERS",
      "factions": ["Fyreslayers"],
      "keywords": ["Champion", "Duardin", "Infantry", "Ward (6+)"],
      "factionKeywords": ["Grand Alliance Order", "Fyreslayers"],
      "fluff": "The warriors of the Auric Hearthguard are renowned for their steadfast bravery – holding ground no matter how dire the circumstances and facing even certain doom without abandoning their duty. They are tasked with guarding the forge-temple of their magmahold where ur-gold is stored and runes are forged. The absolute importance of this sacred site leads the Zharrgrim priesthood to handpick its guardians from the hold’s ranks, chosen for their implacability as much as their martial prowess. Small groups of them will often fight as bodyguards to the Zharrgrim priests, allowing their wards to safely retrieve more ur-gold deposits.\n\nOf course, warriors of the Auric Hearthguard are as fiery and belligerent as any of their kin. However, they channel their battle-fury not into wild swings and reckless charges but into focusing the flaming devastation of their favoured weapon: the magmapike. These ornate hand-cannons spew a ceaseless barrage of superheated lava at their target, each blazing missile capable of melting through plate armour and igniting hair and flesh. Should any foes survive this ferocious hail of magma and engage the Auric Hearthguard in combat, they will be quickly dispatched with the blades affixed to the edges and hafts of these formidable weapons.",
      "referenceKeywords": "Infantry, Champion, Ward (6+), Order, Fyreslayers, Duardin",
      "stats": {
        "move": "4\"",
        "save": "6+",
        "control": "1",
        "health": "2",
        "ward": "6+"
      },
      "points": 130,
      "modelCount": 5,
      "baseSize": "32mm",
      "cannotBeReinforced": false,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Magmapike",
            "type": "ranged",
            "range": "12\"",
            "attacks": "2",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "D3",
            "abilities": ["Shoot in Combat"]
          }
        ],
        "melee": [
          {
            "name": "Magmapike",
            "type": "melee",
            "range": null,
            "attacks": "1",
            "hit": "3+",
            "wound": "3+",
            "rend": "1",
            "damage": "1",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Molten Rockbolts",
          "phase": "shootingPhase",
          "phaseDetails": "Passive",
          "icon": "movement",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Enemies struck by magmapike bolts find their movements become increasingly sluggish as the burning rock cools and rapidly solidifies on their armour and flesh.",
          "declare": null,
          "effect": "Each time a shooting attack made by this unit scores a critical hit, subtract 1\" from the target unit’s Move characteristic until the start of your next turn. This ability cannot reduce the target unit’s unmodified Move characteristic below half."
        }
      ],
      "notes": null
    },
    {
      "id": "ca1e81c0-41de-5bae-9f9c-9d9ca388da98",
      "name": "Auric Runefather",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "FYRESLAYERS",
      "factions": ["Fyreslayers"],
      "keywords": ["Duardin", "Infantry", "Ward (6+)", "Warmaster", "Hero"],
      "factionKeywords": ["Grand Alliance Order", "Fyreslayers"],
      "fluff": "Glorious lodge leaders and warriors both, the Auric Runefathers take to battle with the fury of Grimnir burning in their very veins. So fearsome are these grizzled and venerable kings that enemies have been known to flee rather than trade blows with a Runefather’s greataxe. Each one carries a mountain of responsibility upon their broad shoulders, ensuring their lodge receives a steady flow of ur-gold through which it can release the essence of their dead god. A Runefather’s rule is measured by foes they have defeated and ur gold gathered during their reign. Many of the riches and artefacts they accrue are sealed in vaults to which they alone bear the key.\n\nAs a leader that has proven themselves the most worthy Runeson of their many siblings and who has won glory a hundred times over, Runefathers are formidable warlords, their battle-lust tempered with experience. The lordly presence of a Runefather, surrounded by the bravest and most capable warriors of the lodge, inspires the warbands of the fyrd to fight even harder. Only the commands of a Runefather can halt the wild fury of Berzerkers and boost the morale of their warriors even in the most gruelling battles of attrition.",
      "referenceKeywords": "Warmaster, Hero, Infantry, Ward (6+), Order, Fyreslayers, Duardin",
      "stats": {
        "move": "4\"",
        "save": "5+",
        "control": "2",
        "health": "5",
        "ward": "6+"
      },
      "points": 140,
      "modelCount": 1,
      "baseSize": "32mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Latchkey Grandaxe",
            "type": "melee",
            "range": null,
            "attacks": "4",
            "hit": "3+",
            "wound": "3+",
            "rend": "2",
            "damage": "3",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Commanding Presence",
          "phase": "endOfTurn",
          "phaseDetails": "End of Any Turn",
          "icon": "control",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The presence of a Runefather in the Fyreslayer battleline bolsters the warriors’ already considerable will, ensuring that the doughty duardin will hold their ground and slog it out with any foe.",
          "declare": null,
          "effect": "Add the current battle round number to the control scores of friendly FYRESLAYERS INFANTRY units wholly within 12\" of this unit for the rest of the turn."
        },
        {
          "name": "Royal Retinue",
          "phase": "startOfTurn",
          "phaseDetails": "Once Per Battle (Army), Deployment Phase",
          "icon": "defensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Auric Runefathers go to battle flanked by the most skilled warriors in the lodge, who are sworn to protect him from harm.",
          "declare": "Pick a friendly non-HERO FYRESLAYERS INFANTRY unit within this unit’s combat range to be the royal retinue.",
          "effect": "For the rest of the battle, while the royal retinue is wholly within 6\" of this unit, add 1 to hit rolls for attacks made by the royal retinue and this unit has WARD (4+)."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "requiredKeywords": ["Grimnir’s Chosen"],
          "linkedWarscroll": null
        },
        {
          "points": null,
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "de5f22df-e728-5ae3-8471-92780e81cdb1",
      "name": "Auric Runefather on Magmadroth",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "FYRESLAYERS",
      "factions": ["Fyreslayers"],
      "keywords": [
        "Monster",
        "Vulcatrix’s Chosen",
        "Magmadroth",
        "Duardin",
        "Ward (6+)",
        "Warmaster",
        "Hero"
      ],
      "factionKeywords": [
        "Grand Alliance Order",
        "Fyreslayers",
        "Lofnir Drothkeepers"
      ],
      "fluff": "Glorious lodge leaders and warriors both, the Auric Runefathers take to battle with the fury of Grimnir burning in their very veins. So fearsome are these grizzled and venerable kings that enemies have been known to flee rather than trade blows with a Runefather’s greataxe. Each one carries a mountain of responsibility upon their broad shoulders, ensuring their lodge receives a steady flow of ur-gold through which it can release the essence of their dead god. A Runefather’s rule is measured by foes they have defeated and ur gold gathered during their reign. Many of the riches and artefacts they accrue are sealed in vaults to which they alone bear the key.\n\nParticularly storied Runefathers sometimes ride to battle on the backs of fire-breathing Magmadroths. These great salamanders are the descendants of Vulcatrix, the beast that died in battle with Grimnir centuries before. It is said only those who possess exceptional will and prowess can tame these creatures. Those that ride to war atop a Magmadroth command all attention on the battlefield and can single-handedly break apart enemy flanks with sheets of flame and arcing blows – even the superheated blood of the Magmadroth is a volatile threat should the enemy’s blades cut deep.",
      "referenceKeywords": "Warmaster, Hero, Monster, Ward (6+), Order, Fyreslayers, Duardin, Magmadroth",
      "stats": {
        "move": "10\"",
        "save": "4+",
        "control": "5",
        "health": "14",
        "ward": "6+"
      },
      "points": 320,
      "modelCount": 1,
      "baseSize": "120 x 92mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Roaring Fyrestream",
            "type": "ranged",
            "range": "10\"",
            "attacks": "4",
            "hit": "3+",
            "wound": "3+",
            "rend": "1",
            "damage": "D3",
            "abilities": ["Anti-INFANTRY (+1 Rend)", "Companion"]
          }
        ],
        "melee": [
          {
            "name": "Magmadroth’s Blazing Maw",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "4+",
            "wound": "2+",
            "rend": "2",
            "damage": "3",
            "abilities": ["Companion"]
          },
          {
            "name": "Latchkey Grandaxe",
            "type": "melee",
            "range": null,
            "attacks": "4",
            "hit": "3+",
            "wound": "3+",
            "rend": "2",
            "damage": "3",
            "abilities": []
          },
          {
            "name": "Magmadroth’s Claws and Horns",
            "type": "melee",
            "range": null,
            "attacks": "6",
            "hit": "4+",
            "wound": "2+",
            "rend": "1",
            "damage": "2",
            "abilities": ["Companion"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Battle Damaged",
          "phase": "startOfTurn",
          "phaseDetails": "Passive",
          "icon": "battleDamaged",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": null,
          "declare": null,
          "effect": "While this unit has 10 or more damage points, the Attacks characteristic of its Magmadroth’s Claws and Horns is 4."
        },
        {
          "name": "Raging Inferno",
          "phase": "combatPhase",
          "phaseDetails": "Once Per Turn (Army), Any Combat Phase",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Throwing back its head, a Magmadroth can spew a wave of flaming bile that scorches through enemy armour.",
          "declare": "Pick an enemy unit in combat with this unit to be the target.",
          "effect": "Roll a dice. On a 3+, subtract 1 from save rolls for the target for the rest of the turn.",
          "keywords": ["Rampage"]
        },
        {
          "name": "Warrior-Kings",
          "phase": "combatPhase",
          "phaseDetails": "Once Per Battle (Army), Your Combat Phase",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "With discipline and zeal in equal measure, the Runefather inspires his warriors to bring down the wrath of Grimnir upon any who oppose them.",
          "declare": null,
          "effect": "For the rest of the turn, add 1 to the Attacks characteristic of melee weapons used by friendly FYRESLAYERS units while they are wholly within 12\" of this unit."
        },
        {
          "name": "Volcanic Blood",
          "phase": "combatPhase",
          "phaseDetails": "Passive",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Born of fire and flame, Magmadroths pulse with the throbbing heat of the volcanic caverns in which they make their fyrenests.",
          "declare": null,
          "effect": "If you make an unmodified save roll of 1 for a combat attack that targets this unit, inflict 1 mortal damage on the attacking unit after the FIGHT ability has been resolved."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "requiredKeywords": ["Grimnir’s Chosen"],
          "linkedWarscroll": null
        },
        {
          "points": null,
          "requiredKeywords": ["Vulcatrix’s Chosen"],
          "linkedWarscroll": null
        },
        {
          "points": null,
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        },
        {
          "points": null,
          "linkedWarscroll": null
        },
        {
          "points": null,
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "f66714c6-24ab-5c3f-a992-5372070e1630",
      "name": "Auric Runemaster",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "FYRESLAYERS",
      "factions": ["Fyreslayers"],
      "keywords": ["Priest", "Duardin", "Infantry", "Ward (6+)", "Hero"],
      "factionKeywords": [
        "Grand Alliance Order",
        "Fyreslayers",
        "Lofnir Drothkeepers"
      ],
      "fluff": "Auric Runemasters are revered high priests of a lodge’s Zharrgrim. It is they who craft the ur-gold runes that are hammered into Fyreslayer flesh, granting the bearer a sliver of the power of Grimnir. Auric Runemasters are attuned to their deity like no other and their ability to detect deposits of ur-gold is unmatched.\n\nUnlike a Runesmiter, a Runemaster has tempered their fiery nature and draws upon their connection to Grimnir’s divine power to offer invaluable counsel to their Runefather. Not even the most rash of lodge leaders would make decisions on matters of ur-gold or war without first consulting their Runemaster. The role of spiritual advisor, however, does not mean that a Runemaster is a peaceful individual. Rather, they are able to think with a rational head while channelling emotions into manifestations of blazing magmic energy.\n\nEach Runemaster carries a brazier-staff lit by the flames of his magmahold’s master forge. By slamming the base of their staff upon the ground, the battlefield cracks asunder and magma surges up to consume the foe. The Runemaster can also conjure walls of white-hot incandescence from the molten depths to block the advance of invaders.",
      "referenceKeywords": "Hero, Priest (2), Infantry, Ward (6+), Order, Fyreslayers, Duardin",
      "stats": {
        "move": "4\"",
        "save": "5+",
        "control": "2",
        "health": "5",
        "ward": "6+"
      },
      "points": 180,
      "modelCount": 1,
      "baseSize": "32mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Brazier Staff",
            "type": "melee",
            "range": null,
            "attacks": "3",
            "hit": "3+",
            "wound": "3+",
            "rend": "1",
            "damage": "2",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "High Priest of the Zharrgrim",
          "phase": "heroPhase",
          "phaseDetails": "Passive",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The Zharrgrim order of every Fyreslayer lodge is led by an Auric Runemaster, a revered individual attuned to their deity like no other.",
          "declare": null,
          "effect": "Each time a PRAYER chanted by this unit is answered, this unit gains a magmic power token."
        },
        {
          "name": "Master of the Runes",
          "phase": "startOfTurn",
          "phaseDetails": "Reaction: You declared an UR-GOLD RUNE ability",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": true,
          "lore": "Drawing upon the divine power released by sacred battle, Runemasters are able to awaken the full potential of their ur-gold runes.",
          "declare": null,
          "effect": "Remove 3 of this unit’s magmic power tokens. If you do so, apply the effect below that corresponds to the UR‑GOLD RUNE ability that was used:\n\nRune of Fury: For the rest of the battle round, add 1 to wound rolls for combat attacks made by friendly FYRESLAYERS units while they have STRIKE-FIRST.\n\nRune of Fiery Determination: Add 1 to save rolls for friendly FYRESLAYERS units for the rest of the battle round.\n\nRune of Relentless Zeal: Add 1 to run rolls and charge rolls for friendly FYRESLAYERS units for the rest of the battle round.\n\nRune of Searing Heat: Add 1 to the Rend characteristic of melee weapons used by friendly FYRESLAYERS units for the rest of the battle round.\n\nRune of Farsight: Increase the range of the ‘Rune of Farsight’ ability to 16\"."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        },
        {
          "points": null,
          "requiredKeywords": ["Grimnir’s Chosen"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "05c37a8c-7e2a-5373-b831-bffe0d08cabc",
      "name": "Auric Runesmiter",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "FYRESLAYERS",
      "factions": ["Fyreslayers"],
      "keywords": ["Priest", "Duardin", "Infantry", "Ward (6+)", "Hero"],
      "factionKeywords": [
        "Grand Alliance Order",
        "Fyreslayers",
        "Lofnir Drothkeepers"
      ],
      "fluff": "The prayers of an Auric Runesmiter are a war cry and their blessings are blazing coronas of flame. Within the thick of the fighting, their chants become burning energy made manifest, for battle is the domain of their ancestral god Grimnir. These members of the Zharrgrim priesthood are responsible for accruing ur-gold, and will take to the fore of battle to deliver their sermons to the warriors fighting to retrieve it. With shouted tales of ancestral heroics, their own battle-joy swells until divine energy sparks out from them in waves. Any warriors around the Runesmiters are inspired by their rumbling chants, filling them with vigour and righteous fury. This causes their ur-gold runes to blaze and sparkle as Grimnir’s essence responds in kind, filling their bearers with fell-handed power.\n\nThe Runesmiters have a deep knowledge of metal and rock thanks to their affinity with their holy fires. As a result, many have developed other, more elemental powers. They can control magmic forces, summon cinderstorms, and even cloak the claws of Magmadroths in flame. Most crucially, they can command the tide of battle by melting through solid rock and boring temporary tunnels for their Fyreslayer kin to charge through, allowing them to strike from an unexpected quarter.",
      "referenceKeywords": "Hero, Priest (1), Infantry, Ward (6+), Order, Fyreslayers, Duardin",
      "stats": {
        "move": "4\"",
        "save": "5+",
        "control": "2",
        "health": "5",
        "ward": "6+"
      },
      "points": 120,
      "modelCount": 1,
      "baseSize": "32mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Latch-axe",
            "type": "melee",
            "range": null,
            "attacks": "4",
            "hit": "3+",
            "wound": "3+",
            "rend": "1",
            "damage": "2",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Emergence",
          "phase": "heroPhase",
          "phaseDetails": "Your Hero Phase",
          "icon": "movement",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The ground opens up to reveal the Runesmiter and their entourage.",
          "declare": "Pick this unit if it is underground.",
          "effect": "Set up this unit anywhere on the battlefield more than 9\" from all enemy units. Then, set up the other unit that was set up underground with it (if any) wholly within 6\" of this unit and more than 9\" from all enemy units."
        },
        {
          "name": "Magmic Tunnelling",
          "phase": "startOfTurn",
          "phaseDetails": "Deployment Phase",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "A Runesmiter standing upon stone can command the rock to allow them passage.",
          "declare": "Pick this unit and up to 1 unit in its regiment if neither unit has been deployed.",
          "effect": "Set up those units in reserve underground. They have now been deployed.",
          "keywords": ["Deploy"]
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "49d0ccf2-e7d2-59db-b744-a9c9cd50f268",
      "name": "Auric Runesmiter on Magmadroth",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "FYRESLAYERS",
      "factions": ["Fyreslayers"],
      "keywords": [
        "Priest",
        "Monster",
        "Magmadroth",
        "Duardin",
        "Ward (6+)",
        "Hero"
      ],
      "factionKeywords": [
        "Grand Alliance Order",
        "Fyreslayers",
        "Lofnir Drothkeepers"
      ],
      "fluff": "The prayers of an Auric Runesmiter are a war cry and their blessings are blazing coronas of flame. Within the thick of the fighting, their chants become burning energy made manifest, for battle is the domain of their ancestral god Grimnir. These members of the Zharrgrim priesthood are responsible for accruing ur-gold, and will take to the fore of battle to deliver their sermons to the warriors fighting to retrieve it. With shouted tales of ancestral heroics, their own battle-joy swells until divine energy sparks out from them in waves. Any warriors around the Runesmiters are inspired by their rumbling chants, filling them with vigour and righteous fury. This causes their ur-gold runes to blaze and sparkle as Grimnir’s essence responds in kind, filling their bearers with fell-handed power.\n\nThe most powerful Runesmiters of the Zarrgrim Priesthood will ride to battle upon the backs of Magmadroths. These great salamanders are the descendants of Vulcatrix, the beast that died in battle with Grimnir centuries before. It is said only those who possess exceptional will and prowess can tame these creatures. Those that ride to war atop a Magmadroth command all attention on the battlefield and can single-handedly break apart enemy flanks with sheets of flame and arcing blows – even the superheated blood of the Magmadroth is a volatile threat should the enemy’s blades cut deep.",
      "referenceKeywords": "Hero, Monster, Priest (1), Ward (6+), Order, Fyreslayers, Duardin, Magmadroth",
      "stats": {
        "move": "10\"",
        "save": "4+",
        "control": "5",
        "health": "14",
        "ward": "6+"
      },
      "points": 280,
      "modelCount": 1,
      "baseSize": "120 x 92mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Roaring Fyrestream",
            "type": "ranged",
            "range": "10\"",
            "attacks": "4",
            "hit": "3+",
            "wound": "3+",
            "rend": "1",
            "damage": "D3",
            "abilities": ["Anti-INFANTRY (+1 Rend)", "Companion"]
          }
        ],
        "melee": [
          {
            "name": "Magmadroth’s Blazing Maw",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "4+",
            "wound": "2+",
            "rend": "2",
            "damage": "3",
            "abilities": ["Companion"]
          },
          {
            "name": "Latch-axe",
            "type": "melee",
            "range": null,
            "attacks": "4",
            "hit": "3+",
            "wound": "3+",
            "rend": "1",
            "damage": "2",
            "abilities": []
          },
          {
            "name": "Magmadroth’s Claws and Horns",
            "type": "melee",
            "range": null,
            "attacks": "6",
            "hit": "4+",
            "wound": "2+",
            "rend": "1",
            "damage": "2",
            "abilities": ["Companion"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Battle Damaged",
          "phase": "startOfTurn",
          "phaseDetails": "Passive",
          "icon": "battleDamaged",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": null,
          "declare": null,
          "effect": "While this unit has 10 or more damage points, the Attacks characteristic of its Magmadroth’s Claws and Horns is 4."
        },
        {
          "name": "Runic Empowerment",
          "phase": "heroPhase",
          "phaseDetails": "Your Hero Phase",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "With a sonorous chant, the Runesmiter draws forth the power of the ur-gold runes set into the flesh of their Fyreslayer kin.",
          "declare": "Pick a friendly FYRESLAYERS unit wholly within 12\" of this unit to be the target.",
          "effect": "Roll a dice. On a 3+, add 1 to wound rolls for the target’s attacks for the rest of the turn."
        },
        {
          "name": "Lashing Tail",
          "phase": "combatPhase",
          "phaseDetails": "Once Per Turn (Army), Any Combat Phase",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Magmadroths can use their muscular spiked tails to pulverise lesser prey with a single swipe.",
          "declare": "Pick an enemy unit in combat with this unit to be the target.",
          "effect": "Roll 2D6. If the roll is equal to or less than the number of models in the target unit, inflict D3+3 mortal damage on the target.",
          "keywords": ["Rampage"]
        },
        {
          "name": "Volcanic Blood",
          "phase": "combatPhase",
          "phaseDetails": "Passive",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Born of fire and flame, Magmadroths pulse with the throbbing heat of the volcanic caverns in which they make their fyrenests.",
          "declare": null,
          "effect": "If you make an unmodified save roll of 1 for a combat attack that targets this unit, inflict 1 mortal damage on the attacking unit after the FIGHT ability has been resolved."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "66b981c8-6187-5ed0-b147-0c0915075041",
      "name": "Auric Runeson",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "FYRESLAYERS",
      "factions": ["Fyreslayers"],
      "keywords": [
        "Duardin",
        "Infantry",
        "Ward (6+)",
        "Grimnir’s Chosen",
        "Hero"
      ],
      "factionKeywords": [
        "Grand Alliance Order",
        "Fyreslayers",
        "Lofnir Drothkeepers"
      ],
      "fluff": "The fury of youth blazes in the blood of the Auric Runesons. Fyreslayer tradition maintains that when a Runefather perishes, the most capable of his offspring will inherit rulership of the lodge. An Auric Runeson must prove their worth constantly if they wish to outshine their many siblings. This ruthless hunger for glory leads them to recklessly seek out the part of the battlefield where the fighting is thickest – and their eagerness for the most challenging fights often leads them to plunge into danger with a fearlessness remarkable even for Fyreslayers.\n\nSeeking to forge their own legend, many Auric Runesons will strike out alone with a band of their closest followers. On their travels they will earn great bounties of ur-gold and hunt down the most ferocious monsters to slay, often returning to their Runefather with severed heads or stripped hides to display as trophies. Each is trained from youth with the artefact weapons of their ancestors, making each a powerhouse in their own right that will only grow more devastating with age and experience. It is an honour to bear these weapons, and Runesons vie to be worthy of their legendary names.",
      "referenceKeywords": "Hero, Infantry, Ward (6+), Order, Fyreslayers, Duardin",
      "stats": {
        "move": "4\"",
        "save": "5+",
        "control": "2",
        "health": "5",
        "ward": "6+"
      },
      "points": 80,
      "modelCount": 1,
      "baseSize": "32mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Ancestral Weapons",
            "type": "melee",
            "range": null,
            "attacks": "5",
            "hit": "3+",
            "wound": "3+",
            "rend": "1",
            "damage": "2",
            "abilities": ["Anti-MONSTER (+1 Rend)"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Fearless Charge",
          "phase": "chargePhase",
          "phaseDetails": "Passive",
          "icon": "movement",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Fearless and bold, Auric Runesons show their devotion to Grimnir with daring assaults and furious charges.",
          "declare": null,
          "effect": "If this unit charged this turn, for the rest of the turn, add 1 to charge rolls for friendly FYRESLAYERS INFANTRY units while they are wholly within 18\" of this unit."
        },
        {
          "name": "Dauntless Assault",
          "phase": "combatPhase",
          "phaseDetails": "Reaction: You declared a FIGHT ability for this unit",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": true,
          "lore": "Eager to prove themselves in battle, Auric Runesons are at their best leading from the front lines alongside their allies.",
          "declare": null,
          "effect": "Pick a friendly non-HERO FYRESLAYERS INFANTRY unit that has not used a FIGHT ability this turn and is within this unit’s combat range to be the target. The target can be picked to use a FIGHT ability immediately after the FIGHT ability used by this unit has been resolved."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "requiredKeywords": ["Grimnir’s Chosen"],
          "linkedWarscroll": null
        },
        {
          "points": null,
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "ee175d4b-27da-52a6-b3ab-5cfc00c85a84",
      "name": "Auric Runeson on Magmadroth",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "FYRESLAYERS",
      "factions": ["Fyreslayers"],
      "keywords": [
        "Monster",
        "Vulcatrix’s Chosen",
        "Magmadroth",
        "Duardin",
        "Ward (6+)",
        "Hero"
      ],
      "factionKeywords": [
        "Grand Alliance Order",
        "Fyreslayers",
        "Lofnir Drothkeepers"
      ],
      "fluff": "The fury of youth blazes in the blood of the Auric Runesons. Fyreslayer tradition maintains that when a Runefather perishes, the most capable of his offspring will inherit rulership of the lodge. An Auric Runeson must prove their worth constantly if they wish to outshine their many siblings. This ruthless hunger for glory leads them to recklessly seek out the part of the battlefield where the fighting is thickest – and their eagerness for the most challenging fights often leads them to plunge into danger with a fearlessness remarkable even for Fyreslayers.\n\nSome Runesons will ride to battle upon the backs of flame spitting Magmadroths. These great salamanders are the descendants of Vulcatrix, the beast that died in battle with Grimnir centuries before. It is said only those who possess exceptional will and prowess can tame these creatures. Many Runesons raise their Magmadroths from infancy, seeing this as another way in which they can prove their worthiness as a potential leader. Those that ride to war atop a Magmadroth command all attention on the battlefield and can single-handedly break apart enemy flanks with sheets of flame and arcing blows – even the superheated blood of the Magmadroth is a volatile threat should the enemy’s blades cut deep.",
      "referenceKeywords": "Hero, Monster, Ward (6+), Order, Fyreslayers, Duardin, Magmadroth",
      "stats": {
        "move": "10\"",
        "save": "4+",
        "control": "5",
        "health": "14",
        "ward": "6+"
      },
      "points": 250,
      "modelCount": 1,
      "baseSize": "120 x 92mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Roaring Fyrestream",
            "type": "ranged",
            "range": "10\"",
            "attacks": "4",
            "hit": "3+",
            "wound": "3+",
            "rend": "1",
            "damage": "D3",
            "abilities": ["Anti-INFANTRY (+1 Rend)", "Companion"]
          }
        ],
        "melee": [
          {
            "name": "Magmadroth’s Blazing Maw",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "4+",
            "wound": "2+",
            "rend": "2",
            "damage": "3",
            "abilities": ["Companion"]
          },
          {
            "name": "Ancestral Weapons",
            "type": "melee",
            "range": null,
            "attacks": "5",
            "hit": "3+",
            "wound": "3+",
            "rend": "1",
            "damage": "2",
            "abilities": ["Anti-MONSTER (+1 Rend)"]
          },
          {
            "name": "Magmadroth’s Claws and Horns",
            "type": "melee",
            "range": null,
            "attacks": "6",
            "hit": "4+",
            "wound": "2+",
            "rend": "1",
            "damage": "2",
            "abilities": ["Companion"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Battle Damaged",
          "phase": "startOfTurn",
          "phaseDetails": "Passive",
          "icon": "battleDamaged",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": null,
          "declare": null,
          "effect": "While this unit has 10 or more damage points, the Attacks characteristic of its Magmadroth’s Claws and Horns is 4."
        },
        {
          "name": "Dominating Roar",
          "phase": "endOfTurn",
          "phaseDetails": "Once Per Turn (Army), End of Any Turn",
          "icon": "control",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The Flame-scale Youngbloods ridden by Auric Runesons are fiercely territorial when faced with a monstrous challenger.",
          "declare": "Pick an enemy MONSTER in combat with this unit to be the target.",
          "effect": "If this unit has fewer damage points than the target, subtract 10 from the target’s control score for the rest of the turn.",
          "keywords": ["Rampage"]
        },
        {
          "name": "Vying for Glory",
          "phase": "combatPhase",
          "phaseDetails": "Passive",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Runesons seek their father’s favour in battle by slaying the most fearsome enemy creatures.",
          "declare": null,
          "effect": "Each time this unit destroys a MONSTER, add 1 to the Attacks characteristic of this unit’s Ancestral Weapons for the rest of the battle. This unit can be affected by this ability multiple times and the effects are cumulative."
        },
        {
          "name": "Volcanic Blood",
          "phase": "combatPhase",
          "phaseDetails": "Passive",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Born of fire and flame, Magmadroths pulse with the throbbing heat of the volcanic caverns in which they make their fyrenests.",
          "declare": null,
          "effect": "If you make an unmodified save roll of 1 for a combat attack that targets this unit, inflict 1 mortal damage on the attacking unit after the FIGHT ability has been resolved."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "requiredKeywords": ["Grimnir’s Chosen"],
          "linkedWarscroll": null
        },
        {
          "points": null,
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "72b358b4-425d-5420-b94b-e9a9c96cc9d5",
      "name": "Battlesmith",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "FYRESLAYERS",
      "factions": ["Fyreslayers"],
      "keywords": [
        "Duardin",
        "Infantry",
        "Ward (6+)",
        "Grimnir’s Chosen",
        "Hero"
      ],
      "factionKeywords": ["Grand Alliance Order", "Fyreslayers"],
      "fluff": "Ancestral reverence is at the centre of duardin culture, and the Fyreslayers are no different. It is the sacred task of the Battlesmith to rouse their kin, both around the fire and in the heat of battle, by chanting the great sagas of their forebears. In turn, the fyrds fight ever harder, forging their own legends for the Battlesmith to observe and record.\n\nOf course, to inspire the front lines in such a way demands incredible fighting prowess of the Battlesmiths. Each is handpicked by a lodge’s Runefather from amidst its finest forge workers, ensuring they possess immense strength and a knack for slicing up foes with a fyresteel axe. They are expected to strike their own icons of Grimnir to hold aloft in battle, and the sight of such fearsome totems stoke the inner flames of all Fyreslayers and rally them around it with renewed strength. Any warriors within earshot of a Battlesmith booming legends of old finds themselves rekindled in spirit, their ur-gold runes blazing with Grimnir’s power.",
      "referenceKeywords": "Hero, Infantry, Ward (6+), Order, Fyreslayers, Duardin",
      "stats": {
        "move": "4\"",
        "save": "5+",
        "control": "5",
        "health": "5",
        "ward": "6+"
      },
      "points": 100,
      "modelCount": 1,
      "baseSize": "32mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Ancestral Battle-axe",
            "type": "melee",
            "range": null,
            "attacks": "5",
            "hit": "3+",
            "wound": "3+",
            "rend": "1",
            "damage": "2",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Icon of Grimnir",
          "phase": "endOfTurn",
          "phaseDetails": "Passive",
          "icon": "control",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The Battlesmith raises their icon of Grimnir and recounts tales of past glories, inspiring their allies and setting their ur-gold runes ablaze so that they might fight until the bitter end.",
          "declare": null,
          "effect": "Ignore negative modifiers to the control scores of friendly FYRESLAYERS units while they are wholly within 12\" of this unit."
        },
        {
          "name": "Bard of the Lodge",
          "phase": "heroPhase",
          "phaseDetails": "Passive",
          "icon": "rallying",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Standing defiant in front of the enemy, a Battlesmith recites tales of the lodge’s glorious history, rallying the warriors around them.",
          "declare": null,
          "effect": "If a friendly unit wholly within 12\" of this unit uses the ‘Rally’ command, you can make 3 additional rally rolls of D6."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "526a879e-1cdb-5927-9d19-92df0b169a9d",
      "name": "Doomseeker",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "FYRESLAYERS",
      "factions": ["Fyreslayers"],
      "keywords": [
        "Duardin",
        "Infantry",
        "Ward (6+)",
        "Grimnir’s Chosen",
        "Hero"
      ],
      "factionKeywords": ["Grand Alliance Order", "Fyreslayers"],
      "fluff": "Hacking through foes in an arc of fire and splattering blood, the Doomseekers fight with no regard for their own safety. These reckless warriors have sworn the barazakdum, or doom-oath in the Azyrite tongue, and have departed in search of a death worthy of legend. Each Doomseeker will make this vow for a different reason. Some will do so to restore their honour after breaking a vow or failing in their duty.\n\nA Doomseeker will take on any foe, no matter how outmatched they might be. Their life no longer holds any value other than to die a meaningful death, so these warriors will slash and maim until their last breath rattles in their lungs.\n\nBefore setting off from their lodge for the last time, a Doomseeker will forge themselves a final weapon using the ever-burning flames of their master forge. This creates a weapon that is eternally wreathed in that flame, allowing one final connection between a Doomseeker and their estranged kin. They also carry a runic war-iron in their off hand that absorbs slivers of their rampant energy as they fight, allowing them to become more powerful even as they sustain wounds that should weaken them. When the war-iron glows white-hot, as if fresh from the forge-fire, a Doomseeker is surely at their most dangerous.",
      "referenceKeywords": "Hero, Infantry, Ward (6+), Order, Fyreslayers, Duardin",
      "stats": {
        "move": "4\"",
        "save": "5+",
        "control": "2",
        "health": "5",
        "ward": "6+"
      },
      "points": 80,
      "modelCount": 1,
      "baseSize": "32mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Doomseeker Weapons",
            "type": "melee",
            "range": null,
            "attacks": "5",
            "hit": "3+",
            "wound": "3+",
            "rend": "1",
            "damage": "2",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Runic Power",
          "phase": "combatPhase",
          "phaseDetails": "Passive",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "As a Doomseeker gets closer to their fate, they call upon the power of their many ur-gold runes, ensuring either their victory or that they go down in a final blaze of glory.",
          "declare": null,
          "effect": "Add 1 to the Damage characteristic of this unit’s melee weapons while this unit has 1 damage point. Add 2 to the Damage characteristic of this unit’s melee weapons instead while this unit has 2 or more damage points."
        },
        {
          "name": "Oathbound",
          "phase": "startOfTurn",
          "phaseDetails": "Deployment Phase",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "A Doomseeker chooses their quarry and shouts a vow to Grimnir that they will either destroy the enemy or die trying.",
          "declare": "Pick an enemy unit to be this unit’s quarry. You can pick a unit that has been deployed in reserve.",
          "effect": "Add 1 to hit rolls and wound rolls for attacks made by this unit that target its quarry.\nIf this unit is destroyed while it is in combat with its quarry, inflict 3 mortal damage on this unit’s quarry immediately after the ability that destroyed this unit has been resolved."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "217b4d18-cbdf-5585-b7b7-41e64cc68ddc",
      "name": "Grimhold Exile",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "FYRESLAYERS",
      "factions": ["Fyreslayers"],
      "keywords": [
        "Duardin",
        "Infantry",
        "Ward (6+)",
        "Grimnir’s Chosen",
        "Hero"
      ],
      "factionKeywords": ["Grand Alliance Order", "Fyreslayers"],
      "fluff": "To be a Grimhold Exile is to become an orphan of war, the last survivor of a magmahold that has fallen to ruin. Whilst many Fyreslayers would break upon the advent of such tragedy, these Exiles are souls of a rarer breed: duardin whose resolve cannot be broken no matter the unthinkable grief they have suffered. They are not deathseekers, but agents of retribution, determined to ensure the legacy of their people survives.\n\nWhen battle is joined, Grimhold Exiles transform into roaring agents of vengeance, with each blow from their hammers carrying Grimnir’s own blazing wrath. An Exile’s hammers are imbued with a portion of the Zharrkhul – the legendary Master Flame, ignited during the ancestor-god’s violent demise, that burns at the heart of each magmahold. Along with the ur-gold runes they stamp into their bodies, the Master Flame is the closest connection Grimnir’s cult have to their fallen deity. Some Grimhold Exiles seek to one day found a new magmahold, using the fragment of the Zharrkhul they carry to light the forge temple at such a stronghold’s heart. All Grimhold Exiles swiftly grow into formidable warriors – their ur-gold runes seem to blaze all the brighter, as if the deepest reserves of power locked within are coaxed out by the glow of the Master Flame.",
      "referenceKeywords": "Hero, Infantry, Ward (6+), Order, Fyreslayers, Duardin",
      "stats": {
        "move": "4\"",
        "save": "5+",
        "control": "2",
        "health": "6",
        "ward": "6+"
      },
      "points": 100,
      "modelCount": 1,
      "baseSize": "32mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Fyre-rune Hammers",
            "type": "melee",
            "range": null,
            "attacks": "5",
            "hit": "3+",
            "wound": "3+",
            "rend": "2",
            "damage": "2",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Honour to Grimnir!",
          "phase": "heroPhase",
          "phaseDetails": "Once Per Battle, Your Hero Phase",
          "icon": "movement",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Grimhold Exiles exhort their fellow duardin to fight with the vigour of their fallen god.",
          "declare": "Pick up to 3 friendly FYRESLAYERS INFANTRY units wholly within 12\" of this unit to be the targets.",
          "effect": "You can re-roll charge rolls for the targets for the rest of the turn."
        },
        {
          "name": "Last of the Lodge-fire",
          "phase": "combatPhase",
          "phaseDetails": "Once Per Battle, Any Combat Phase",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "In desperate need, a Grimhold Exile can draw upon the embers of the Zharrkhul by striking their hammer-faces together, setting a powerful foe ablaze with the flames of Grimnir’s wrath.",
          "declare": "Pick an enemy unit in combat with this unit to be the target.",
          "effect": "Roll a number of dice equal to the target’s Health characteristic. For each 4+, inflict 1 mortal damage on the target.",
          "keywords": ["Core", "Attack", "Fight"]
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "9aa9e69f-abc4-5d35-a3ce-86671fb9ec14",
      "name": "Grimwrath Berzerker",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "FYRESLAYERS",
      "factions": ["Fyreslayers"],
      "keywords": [
        "Duardin",
        "Infantry",
        "Ward (6+)",
        "Grimnir’s Chosen",
        "Hero"
      ],
      "factionKeywords": ["Grand Alliance Order", "Fyreslayers"],
      "fluff": "A Grimwrath Berzerker is the greatest warrior of their lodge, a surly champion touched by the volatile battle-fury of Grimnir. Wielding a two handed fyrestorm greataxe, these grizzled duardin cut a swathe of ruin through their foes, spitting insults and blood-curdling threats all the while.\n\nThese truculent warriors are solitary in nature, eschewing the camaraderie of their kin and refusing to answer to anyone but the lodge’s Runefather. This may be due to the source of their power – dozens of ur-gold runes are embedded into their bodies, imbuing them with the strength of an inferno and the divine rage of Grimnir himself. Most Fyreslayers cannot bear more than a few ur-gold runes at a time, and only the few that survive and overcome the gruelling, often lethal, Tests of Wrath are said to have the soul of a Grimwrath. The only place they truly feel at peace is in the heart of battle, entering a state of such focused fury that their greataxe becomes a fiery blur of motion.",
      "referenceKeywords": "Hero, Infantry, Ward (6+), Order, Fyreslayers, Duardin",
      "stats": {
        "move": "4\"",
        "save": "5+",
        "control": "2",
        "health": "5",
        "ward": "6+"
      },
      "points": 120,
      "modelCount": 1,
      "baseSize": "32mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Fyrestorm Greataxe",
            "type": "melee",
            "range": null,
            "attacks": "5",
            "hit": "3+",
            "wound": "3+",
            "rend": "2",
            "damage": "2",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Battle-fury",
          "phase": "combatPhase",
          "phaseDetails": "Once Per Battle, Any Combat Phase",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Hewing left and right with their greataxe, a Grimwrath Berzerker enters a state of singleminded frenzy.",
          "declare": null,
          "effect": "If this unit is in combat, it can use 2 FIGHT abilities this phase. After the first is used, however, this unit has STRIKE‑LAST for the rest of the phase."
        },
        {
          "name": "Grimwrath Oaths",
          "phase": "startOfTurn",
          "phaseDetails": "Deployment Phase",
          "icon": "special",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Before battle, each Grimwrath Berzerker swears a sacred oath to Grimnir that they will fulfil a certain deed in his honour that day.",
          "declare": null,
          "effect": "Pick 1 of the following oaths for this unit to swear:\n\n‘I will guard them with my life!’: While this unit is wholly within 6\" of another friendly FYRESLAYERS HERO:\n\n• Add 1 to hit rolls for this unit’s attacks.\n• Add 1 to ward rolls for this unit.\n\nIf a friendly FYRESLAYERS HERO  wholly within 6\" of this unit is destroyed, this effect no longer applies.\n\n‘I will not be stopped!’: Add 1 to charge rolls for this unit, and add 1 to save rolls for this unit while it is in combat. If this unit uses the ‘Retreat’ or ‘Rally’ abilities, this effect no longer applies."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "4973a8ea-29f5-56c0-99ab-feb1a8aa2e8d",
      "name": "Hearthguard Berzerkers with Berzerker Broadaxes",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "FYRESLAYERS",
      "factions": ["Fyreslayers"],
      "keywords": ["Champion", "Duardin", "Infantry", "Ward (6+)"],
      "factionKeywords": ["Grand Alliance Order", "Fyreslayers"],
      "fluff": "The most skilled warriors of a magmahold are granted a place within the Hearthguard Berzerkers. These elite warriors are bodyguards to the royal family – the Auric Runefather and his Runesons. Hearthguard Berzerkers wield two-handed weapons, the better to keep the enemy at a distance from their ward. The deadly Berzerker broadaxe is a mighty weapon capable of splitting an ogor in two, while the flamestrike poleaxe features both a cleaving blade and a fiery brazier attached to the haft by a heavy chain.\n\nThose deemed skilled enough warriors to join the Hearthguard Berzerkers are first invited to partake in ceremonial battles. Known as the Trials of Grimfyre, they involve the slaying of a gauntlet of beasts and monsters. Those who survive are allowed to pledge their oath of service, and in return are gifted their fireblessed weapon from the Runefather himself. The trials are a reflection of the challenges that await these warriors, for they must be prepared to lay down their lives unquestioningly for their lieges every time the Fyreslayers march to battle.",
      "referenceKeywords": "Infantry, Champion, Ward (6+), Order, Fyreslayers, Duardin",
      "stats": {
        "move": "4\"",
        "save": "6+",
        "control": "1",
        "health": "2",
        "ward": "6+"
      },
      "points": 120,
      "modelCount": 5,
      "baseSize": "32mm",
      "cannotBeReinforced": false,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Berzerker Broadaxe",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "3+",
            "wound": "3+",
            "rend": "1",
            "damage": "2",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Duty Unto Death",
          "phase": "defensive",
          "phaseDetails": "Passive",
          "icon": "defensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Hearthguard Berzerkers are sworn to protect their lodge and its masters until their dying breath.",
          "declare": null,
          "effect": "While any friendly FYRESLAYERS INFANTRY HEROES are wholly within this unit’s combat range, both this unit and those friendly units have WARD (5+)."
        },
        {
          "name": "Fires of Vengeance",
          "phase": "combatPhase",
          "phaseDetails": "Passive",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Should one of the elders of the lodge be harmed while under the protection of Hearthguard Berzerkers, they are sent into such a vengeful rage that they become nigh unstoppable.",
          "declare": null,
          "effect": "While this unit is within the combat ranges of any damaged friendly FYRESLAYERS HEROES, add 1 to the Attacks characteristic of this unit’s melee weapons."
        }
      ],
      "notes": null
    },
    {
      "id": "a9d594d3-3bde-5dc3-a5ef-95dec79c31b0",
      "name": "Hearthguard Berzerkers with Flamestrike Poleaxes",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "FYRESLAYERS",
      "factions": ["Fyreslayers"],
      "keywords": ["Champion", "Duardin", "Infantry", "Ward (6+)"],
      "factionKeywords": ["Grand Alliance Order", "Fyreslayers"],
      "fluff": "The most skilled warriors of a magmahold are granted a place within the Hearthguard Berzerkers. These elite warriors are bodyguards to the royal family – the Auric Runefather and his Runesons. Hearthguard Berzerkers wield two-handed weapons, the better to keep the enemy at a distance from their ward. The deadly Berzerker broadaxe is a mighty weapon capable of splitting an ogor in two, while the flamestrike poleaxe features both a cleaving blade and a fiery brazier attached to the haft by a heavy chain.\n\nThose deemed skilled enough warriors to join the Hearthguard Berzerkers are first invited to partake in ceremonial battles. Known as the Trials of Grimfyre, they involve the slaying of a gauntlet of beasts and monsters. Those who survive are allowed to pledge their oath of service, and in return are gifted their fireblessed weapon from the Runefather himself. The trials are a reflection of the challenges that await these warriors, for they must be prepared to lay down their lives unquestioningly for their lieges every time the Fyreslayers march to battle.",
      "referenceKeywords": "Infantry, Champion, Ward (6+), Order, Fyreslayers, Duardin",
      "stats": {
        "move": "4\"",
        "save": "6+",
        "control": "1",
        "health": "2",
        "ward": "6+"
      },
      "points": 120,
      "modelCount": 5,
      "baseSize": "32mm",
      "cannotBeReinforced": false,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Flamestrike Poleaxe",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "3+",
            "wound": "3+",
            "rend": "1",
            "damage": "2",
            "abilities": ["Crit (Mortal)"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Duty Unto Death",
          "phase": "defensive",
          "phaseDetails": "Passive",
          "icon": "defensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Hearthguard Berzerkers are sworn to protect their lodge and its masters until their dying breath.",
          "declare": null,
          "effect": "While any friendly FYRESLAYERS INFANTRY HEROES are wholly within this unit’s combat range, both this unit and those friendly units have WARD (5+)."
        },
        {
          "name": "Smouldering Braziers",
          "phase": "endOfTurn",
          "phaseDetails": "End of Any Turn",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "With each swing of a flamestrike poleaxe, the brazier chained to it arcs towards the foe, sparks and fire trailing in its wake.",
          "declare": "Pick an enemy unit in combat with this unit to be the target.",
          "effect": "Roll a D3. On a 2+, inflict an amount of mortal damage on the target equal to the roll."
        }
      ],
      "notes": null
    },
    {
      "id": "40c9af72-e8a0-587f-966e-95a00ffe3bc0",
      "name": "Magmic Battleforge",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "FYRESLAYERS",
      "factions": ["Fyreslayers"],
      "keywords": ["Faction Terrain", "Ward (6+)"],
      "factionKeywords": ["Grand Alliance Order", "Fyreslayers"],
      "fluff": "Totems in Grimnir or Vulcatrix’s image have long been raised during battle to instil courage in warriors and empower the runes embedded in their flesh. The Magmic Battleforge does this on a much larger scale. Formed in moments from molten blood of the land, the Battleforge is a manifestation of Grimnir’s fury fused with the white-hot fires of Vulcatrix. It takes the form of the duardin ancestor-god, burning bright with Aqshian flames, and inspires all Fyreslayers who look upon it. This mystic furnace can be summoned to a battlefield, where its elemental heat can ignite ur-gold runes and stoke the powers of the Zharrgrim.\n\nDrawing upon the powerful elemental energies burning within the Magmic Battleforge, a Zharrgrim priest casts clouds of cinders adrift on the air, imbuing those of their sacred order with power afresh. In times of need, a Zharrgrim priest may expend all of the Battleforge’s power, igniting the ur gold runes of their Fyreslayer kin and infusing the warriors with supernatural strength.",
      "referenceKeywords": "Faction Terrain, Ward (6+), Order, Fyreslayers",
      "stats": {
        "move": "-",
        "save": "3+",
        "control": "-",
        "health": "8",
        "ward": "6+"
      },
      "points": null,
      "modelCount": 1,
      "baseSize": "Use model",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {},
      "abilities": [
        {
          "name": "Molten Blessing",
          "phase": "startOfTurn",
          "phaseDetails": "Start of Any Turn",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Drawing upon the powerful elemental energies of the Magmic Battleforge, a Zharrgrim priest casts clouds of cinders into the air, imbuing those of their sacred order with burning power.",
          "declare": "Pick a friendly FYRESLAYERS PRIEST within this terrain feature’s combat range to be the target.",
          "effect": "Add 1 to chanting rolls for the target for the rest of the turn. In addition, the target can use the ‘Unbind’ ability this turn as if it had WIZARD (1)."
        },
        {
          "name": "Spending the Forge",
          "phase": "heroPhase",
          "phaseDetails": "Once Per Battle (Army), Your Hero Phase",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "In times of need, a Zharrgrim priest may expend all of the Magmic Battleforge’s power, igniting the ur-gold runes of their Fyreslayer kin and infusing the warriors with strength.",
          "declare": "Pick a friendly FYRESLAYERS PRIEST within this terrain feature’s combat range to expend the power of the forge.",
          "effect": "Heal (D3) each friendly FYRESLAYERS unit on the battlefield. Once this ability has been used, this terrain feature cannot use the ‘Molten Blessing’ ability for the rest of the battle."
        }
      ],
      "notes": null
    },
    {
      "id": "e3822a57-8aac-5b50-960e-2a4f6045a116",
      "name": "Molten Infernoth",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "FYRESLAYERS",
      "factions": ["Fyreslayers"],
      "keywords": ["Manifestation", "Invocation", "Ward (6+)", "Fly"],
      "factionKeywords": ["Grand Alliance Order", "Fyreslayers"],
      "fluff": "At the peak of battle, if foes threaten to overwhelm the fyrd and the duardin are severely outnumbered, a Zharrgrim priest will begin a guttural chant with devastating results. This is the summons for a Molten Infernoth, an elemental manifestation that personifies the blazing wrath of Vulcatrix. As the war-chant grows in fury, this fiery avatar will come bursting out of the realm’s crust in a magmic swell of rock and flame.\n\nThis ferocious entity lumbers across the battlefield, wading through solid earth as if it were water and leaving a glowing, igneous wake. It blasts enemies with raging torrents of lava that can immolate front lines in an instant. Its likeness to the ur‑droth godbeast Vulcatrix inspires all Fyreslayers that look upon it, causing them to fight ever harder, not wanting to shame Grimnir’s memory by appearing weak in the face of his killer. This elemental manifestation will stop at nothing to vanquish the Fyreslayer’s foes. As soon as the immediate threats are dealt with, it will melt its way across the battlefield in an unstoppable search for its next prey.",
      "referenceKeywords": "Manifestation, Invocation, Fly, Ward (6+), Order, Fyreslayers",
      "stats": {
        "move": "8\"",
        "save": "5+",
        "control": "7+",
        "health": "10",
        "ward": "6+"
      },
      "points": null,
      "modelCount": 1,
      "baseSize": "120 x 92mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Raging Torrents of Lava",
            "type": "ranged",
            "range": "8\"",
            "attacks": "2",
            "hit": "4+",
            "wound": "3+",
            "rend": "2",
            "damage": "D3",
            "abilities": ["Shoot in Combat"]
          }
        ],
        "melee": [
          {
            "name": "Molten Claws",
            "type": "melee",
            "range": null,
            "attacks": "6",
            "hit": "4+",
            "wound": "2+",
            "rend": "1",
            "damage": "D3",
            "abilities": ["Crit (Mortal)"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Flamescarred",
          "phase": "endOfTurn",
          "phaseDetails": "End of Any Turn",
          "icon": "defensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Those wounded by a Molten Infernoth are left scorched and writhing in pain.",
          "declare": "Pick an enemy unit that had any damage points allocated to it this turn by this MANIFESTATION’s attacks to be the target.",
          "effect": "Subtract 1 from wound rolls for the target’s combat attacks until the end of your next turn."
        }
      ],
      "notes": null
    },
    {
      "id": "5ead4ba5-ad53-5187-adcb-e6541ccbbc35",
      "name": "Runic Fyrewall",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "FYRESLAYERS",
      "factions": ["Fyreslayers"],
      "keywords": ["Manifestation", "Invocation", "Ward (6+)"],
      "factionKeywords": ["Grand Alliance Order", "Fyreslayers"],
      "fluff": "By calling upon the blazing heat of the realms beneath their feet, the Zharrgrim priests manipulate the battlefield in their allies’ favour. At a roared command, a Runic Fyrewall can be raised from the fiery chasms far beneath their soot-stained feet. These walls are formed of magma and gold that permanently lick with flames, suffused with the passionate energy of their summoner’s prayer. Glinting with runes, this scintillating barrier bars the enemy’s path and protects the flanks of the Fyreslayers’ fyrds as they press ever forward.\n\nThe leaping flames of a Runic Fyrewall act as a barrier that only creatures born offire can pass. The advancing fyrd can clamber through them unharmed, a flame of newfound vigour lighting within them as they do so. The Runic Fyrewall’s flames resonate with the ur-gold runes embedded in nearby Fyreslayers as well, causing them to ignite and blaze with power.",
      "referenceKeywords": "Manifestation, Invocation, Ward (6+), Order, Fyreslayers",
      "stats": {
        "move": "-",
        "save": "3+",
        "control": "7+",
        "health": "8",
        "ward": "6+"
      },
      "points": null,
      "modelCount": 1,
      "baseSize": "Use model",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {},
      "abilities": [
        {
          "name": "Roaring Rune-fire",
          "phase": "movementPhase",
          "phaseDetails": "Enemy Movement Phase",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The leaping flames of a Runic Fyrewall act as a barrier that only creatures born of fire can pass.",
          "declare": "Pick up to 3 enemy units within 6\" of this MANIFESTATION to be the targets.",
          "effect": "Roll a D3 for each target. On a 2+:\n\n• Inflict an amount of mortal damage on the target equal to the roll.\n• Subtract 3 from the target’s control score for the rest of the turn."
        }
      ],
      "notes": null
    },
    {
      "id": "a6255cbf-569d-5906-ab1f-8d524b03f0c8",
      "name": "Scourge of Ghyran Auric Runeson on Magmadroth",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "FYRESLAYERS",
      "factions": ["Fyreslayers"],
      "keywords": [
        "Monster",
        "Vulcatrix’s Chosen",
        "Magmadroth",
        "Duardin",
        "Ward (6+)",
        "Hero"
      ],
      "factionKeywords": [
        "Grand Alliance Order",
        "Fyreslayers",
        "Lofnir Drothkeepers"
      ],
      "fluff": "The sweltering jungles of Ghyran often suit the desires of lava-blooded Magmadroths, and these gigantic reptiles provide Auric Runesons with a devastating weapon with which to prove their battle-courage. Rearing up on their hind legs, they come crashing down, unleashing a fiery burst that splits the land and sends foes reeling.",
      "referenceKeywords": "Hero, Monster, Ward (6+), Order, Fyreslayers, Duardin, Magmadroth",
      "stats": {
        "move": "10\"",
        "save": "4+",
        "control": "5",
        "health": "14",
        "ward": "6+"
      },
      "points": 320,
      "modelCount": 1,
      "baseSize": "120 x 92mm",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Roaring Fyrestream",
            "type": "ranged",
            "range": "10\"",
            "attacks": "4",
            "hit": "3+",
            "wound": "3+",
            "rend": "1",
            "damage": "D3",
            "abilities": ["Anti-INFANTRY (+1 Rend)", "Companion"]
          }
        ],
        "melee": [
          {
            "name": "Magmadroth’s Blazing Maw",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "4+",
            "wound": "2+",
            "rend": "2",
            "damage": "3",
            "abilities": ["Companion"]
          },
          {
            "name": "Ancestral Weapons",
            "type": "melee",
            "range": null,
            "attacks": "5",
            "hit": "3+",
            "wound": "3+",
            "rend": "1",
            "damage": "2",
            "abilities": ["Anti-MONSTER (+1 Rend)"]
          },
          {
            "name": "Magmadroth’s Claws and Horns",
            "type": "melee",
            "range": null,
            "attacks": "6",
            "hit": "4+",
            "wound": "2+",
            "rend": "1",
            "damage": "2",
            "abilities": ["Companion"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Battle Damaged",
          "phase": "startOfTurn",
          "phaseDetails": "Passive",
          "icon": "battleDamaged",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": null,
          "declare": null,
          "effect": "While this unit has 10 or more damage points, the Attacks characteristic of its Magmadroth’s Claws and Horns is 4."
        },
        {
          "name": "Fire, Blood and Vengeance",
          "phase": "startOfTurn",
          "phaseDetails": "Once Per Battle, Deployment Phase",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Should their sire be imperilled, an Auric Runeson will fly into a berserk rage. Their mount echoes their fury, for the Magmadroth’s own progenitor is likely to be in just as much danger.",
          "declare": "Pick a friendly Auric Runefather on Magmadroth on the battlefield to be the target.",
          "effect": "Add 1 to the Damage characteristic of this unit’s melee weapons, including Companion weapons, while the target is in combat, damaged or destroyed."
        },
        {
          "name": "Calamitous Crash",
          "phase": "combatPhase",
          "phaseDetails": "Once Per Turn (Army), Any Combat Phase",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The Magmadroth raises its forelegs and brings them smashing down, causing a rippling eruption of earth and flame that sends lesser foes tumbling into magma-filled lacerations in the ground.",
          "declare": "Pick an enemy unit in combat with this unit to be the target.",
          "effect": "Roll a dice. On a 3+, roll a dice for each model in the target unit. For each 5+, inflict 1 mortal damage on the target.",
          "keywords": ["Rampage"]
        },
        {
          "name": "Volcanic Blood",
          "phase": "combatPhase",
          "phaseDetails": "Passive",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Born of fire and flame, Magmadroths pulse with the throbbing heat of the volcanic caverns in which they make their fyrenests.",
          "declare": null,
          "effect": "If you make an unmodified save roll of 1 for a combat attack that targets this unit, inflict 1 mortal damage on the attacking unit after the FIGHT ability has been resolved."
        }
      ],
      "regimentOptions": [
        {
          "points": null,
          "requiredKeywords": ["Grimnir’s Chosen"],
          "linkedWarscroll": null
        },
        {
          "points": null,
          "excludedKeywords": ["Hero"],
          "linkedWarscroll": null
        }
      ],
      "notes": null
    },
    {
      "id": "70f03878-bc68-58ea-8e1d-f4829ee54b60",
      "name": "The Chosen Axes",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "FYRESLAYERS",
      "factions": ["Fyreslayers"],
      "keywords": ["Champion", "Unique", "Duardin", "Infantry", "Ward (6+)"],
      "factionKeywords": ["Grand Alliance Order", "Fyreslayers"],
      "fluff": "The deeds of Fjul-Grimnir are spoken of by generations of Vostarg warriors. For them, he is the epitome of that which the Sons of Grimnir should aspire to, a fearless warrior who has sacrificed his body and soul in pursuit of honour and ur-gold. The Chosen Axes are the hand-picked champions of the mighty Runefather Fjul-Grimnir. Bellowing oaths and trailing sparks, these dauntless warriors launch themselves into battle alongside their beloved leader, smashing aside all in their path.",
      "referenceKeywords": "Unique, Infantry, Champion, Ward (6+), Order, Fyreslayers, Duardin",
      "stats": {
        "move": "4\"",
        "save": "5+",
        "control": "1",
        "health": "3",
        "ward": "6+"
      },
      "points": 120,
      "modelCount": 4,
      "baseSize": "32mm [4]",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Fyresteel Weapons",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "1",
            "abilities": []
          },
          {
            "name": "Latchkey Grandaxe",
            "type": "melee",
            "range": null,
            "attacks": "4",
            "hit": "3+",
            "wound": "3+",
            "rend": "2",
            "damage": "3",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Fjul's Retinue",
          "phase": "defensive",
          "phaseDetails": "Passive",
          "icon": "defensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "The bravest of warriors are hand-picked by Fjul-Grimnir to serve as his bodyguard in battle.",
          "declare": null,
          "effect": "While this unit’s Fjul-Grimnir is on the battlefield, ignore the first damage point that would be allocated to this unit each phase."
        },
        {
          "name": "Berserk Fury",
          "phase": "combatPhase",
          "phaseDetails": "Passive",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "No Fyreslayer will easily accept death’s embrace while their kin are still fighting.",
          "declare": null,
          "effect": "Each time a model in this unit is slain by a combat attack and that model was in combat with the attacking unit, roll a dice. On a 5+, inflict 1 mortal damage on the attacking unit after the FIGHT ability has been resolved."
        }
      ],
      "notes": null
    },
    {
      "id": "2b692cc2-1e12-5c80-86fe-0429a11a0140",
      "name": "Vulkite Berzerkers with Bladed Slingshields",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "FYRESLAYERS",
      "factions": ["Fyreslayers"],
      "keywords": ["Champion", "Musician", "Duardin", "Infantry", "Ward (6+)"],
      "factionKeywords": ["Grand Alliance Order", "Fyreslayers"],
      "fluff": "At the fore of the Fyreslayer fyrds come the Vulkite Berzerkers, doughty warriors that form the heart of their army. Wielding fyresteel axes and war-picks, they hurl themselves into the thick of combat, roaring and laughing as they hew their enemies apart. Even when they are riddled with arrows and bleeding from half a dozen grievous wounds, the Vulkite Berzerkers will fight on, the light of Grimnir in their eyes and wide smiles upon their blood-spattered faces.\n\nThe secret to these warriors’ terrifying resilience and battle-rage comes from the ur-gold runes that are ritually embedded in their flesh. These allow each Berzerker to channel the fury of Grimnir himself, augmenting the duardin’s physical prowess and resolve. When the latent power within these runes is fuelled by the rites of the Zharrgrim priests, the bearer’s martial skill reaches near supernatural levels.\n\nMany Vulkite Berzerkers wield weapons in each hand, the better to overwhelm their foes with a flurry of attacks. Others choose to bear war picks and bladed slingshields, the latter of which can be hurled as deadly missiles to catch unwary foes off guard.",
      "referenceKeywords": "Infantry, Champion, Musician (1/10), Ward (6+), Order, Fyreslayers, Duardin",
      "stats": {
        "move": "4\"",
        "save": "5+",
        "control": "1",
        "health": "2",
        "ward": "6+"
      },
      "points": 140,
      "modelCount": 10,
      "baseSize": "32mm",
      "cannotBeReinforced": false,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Fyresteel Weapons",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "1",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Berserk Fury",
          "phase": "combatPhase",
          "phaseDetails": "Passive",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "No Fyreslayer will easily accept death’s embrace while their kin are still fighting.",
          "declare": null,
          "effect": "Each time a model in this unit is slain by a combat attack and that model was in combat with the attacking unit, roll a dice. On a 5+, inflict 1 mortal damage on the attacking unit after the FIGHT ability has been resolved."
        }
      ],
      "notes": null
    },
    {
      "id": "9156934f-6eec-51a4-a2d3-2e995acac80c",
      "name": "Vulkite Berzerkers with Fyresteel Weapons",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "FYRESLAYERS",
      "factions": ["Fyreslayers"],
      "keywords": ["Champion", "Musician", "Duardin", "Infantry", "Ward (6+)"],
      "factionKeywords": ["Grand Alliance Order", "Fyreslayers"],
      "fluff": "At the fore of the Fyreslayer fyrds come the Vulkite Berzerkers, doughty warriors that form the heart of their army. Wielding fyresteel axes and war-picks, they hurl themselves into the thick of combat, roaring and laughing as they hew their enemies apart. Even when they are riddled with arrows and bleeding from half a dozen grievous wounds, the Vulkite Berzerkers will fight on, the light of Grimnir in their eyes and wide smiles upon their blood-spattered faces.\n\nThe secret to these warriors’ terrifying resilience and battle-rage comes from the ur-gold runes that are ritually embedded in their flesh. These allow each Berzerker to channel the fury of Grimnir himself, augmenting a duardin’s physical prowess and resolve. When the latent power within these runes is fuelled by the rites of the Zharrgrim priests, the bearer’s martial skill reaches near supernatural levels.\n\nMany Vulkite Berzerkers wield weapons in each hand, the better to overwhelm their foes with a flurry of attacks. When they plunge deep into the fray, these warriors become a whirlwind of blades, arcing, spinning and hacking to send the limbs of their foes flying left and right.",
      "referenceKeywords": "Infantry, Champion, Musician (1/10), Ward (6+), Order, Fyreslayers, Duardin",
      "stats": {
        "move": "4\"",
        "save": "6+",
        "control": "1",
        "health": "2",
        "ward": "6+"
      },
      "points": 120,
      "modelCount": 10,
      "baseSize": "32mm",
      "cannotBeReinforced": false,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Fyresteel Weapons",
            "type": "melee",
            "range": null,
            "attacks": "2",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "1",
            "abilities": []
          }
        ]
      },
      "abilities": [
        {
          "name": "Whirlwind of Destruction",
          "phase": "combatPhase",
          "phaseDetails": "Passive",
          "icon": "offensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "With the light of Grimnir burning in their eyes, these impetuous warriors hurl themselves into the fray, leaving a trail of death in their wake.",
          "declare": null,
          "effect": "Add 1 to the Attacks characteristic of this unit’s melee weapons if this unit charged this turn."
        }
      ],
      "notes": null
    },
    {
      "id": "31d924df-1bb1-59f6-87de-e22962425870",
      "name": "Vulkyn Flameseekers",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "FYRESLAYERS",
      "factions": ["Fyreslayers"],
      "keywords": ["Champion", "Duardin", "Infantry", "Ward (6+)"],
      "factionKeywords": [
        "Grand Alliance Order",
        "Fyreslayers",
        "Lofnir Drothkeepers"
      ],
      "fluff": "The monster-taming duardin known as Vulkyn Flameseekers will go to great lengths to acquire the progeny of Vulcatrix, the Ur-Salamander that died in battle with Grimnir. They consider Magmadroth eggs of equal importance to ur-gold. According to their creed, parts of Vulcatrix’s spirit exploded across the realms to combine with seven sacred flames known as the vulkazharr. In recovering the vulkazharr and bathing their Magmadroth eggs in this godly essence, the Flameseekers believe they can create creatures infused with Vulcatrix’s power.\n\nIt is little surprise that the first practitioners of the Vulkyn creed were duardin of the Lofnir lodge. As denizens of the Realm of Beasts, they understand well the role these behemoths play on the battlefield. They spend more time than any other lodge rearing Magmadroths, often all the way from birth, creating unbreakable bonds between beast and duardin.\n\nVulkyn Flameseekers seek their prizes with single-minded tenacity. They are marked out by drothscale armour that they believe will imbue them with a portion of the Magmadroths’ power. They are formidable warriors all, hardened from a harsh life in the wilderness, and they carry wicked, shovel-like ‘bokaz’ that serve as both weapons and tools of excavation.",
      "referenceKeywords": "Infantry, Champion (1/9), Ward (6+), Order, Fyreslayers, Duardin",
      "stats": {
        "move": "4\"",
        "save": "5+",
        "control": "1",
        "health": "2",
        "ward": "6+"
      },
      "points": 160,
      "modelCount": 9,
      "baseSize": "32mm [4], 28.5mm [5]",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "melee": [
          {
            "name": "Emberteeth",
            "type": "melee",
            "range": null,
            "attacks": "1",
            "hit": "3+",
            "wound": "3+",
            "rend": "-",
            "damage": "2",
            "abilities": ["Crit (Mortal)", "Companion"]
          },
          {
            "name": "Vulkyn Weapons",
            "type": "melee",
            "range": null,
            "attacks": "3",
            "hit": "3+",
            "wound": "3+",
            "rend": "1",
            "damage": "1",
            "abilities": ["Anti-MONSTER (+1 Rend)"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Drothmasters",
          "phase": "combatPhase",
          "phaseDetails": "Any Combat Phase",
          "icon": "defensive",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "Vulkyn Flameseekers are skilled at dominating monstrous wild beasts.",
          "declare": "Pick an enemy MONSTER in combat with this unit to be the target.",
          "effect": "Roll a dice. On a 3+, subtract D3 from the Damage characteristic of the target’s COMPANION melee weapons for the rest of the turn."
        }
      ],
      "notes": null
    },
    {
      "id": "ffce412f-6a99-5d65-bf89-146acc97fb39",
      "name": "Zharrgron Flame-spitter",
      "subname": null,
      "cardType": "Warscroll",
      "source": "aos-4e",
      "faction_id": "FYRESLAYERS",
      "factions": ["Fyreslayers"],
      "keywords": ["Manifestation", "Invocation", "Ward (6+)"],
      "factionKeywords": ["Grand Alliance Order", "Fyreslayers"],
      "fluff": "By concentrating their magmic powers, a Zharrgrim priest can summon forth fiery heat from the bowels of the realm. As energy bubbles up to the surface, the battlefield cracks like an eggshell. From its depths shoots an angry geyser of flame, punching its way forth into the sky. As earthquakes rock the battlefield, the foe quickly finds themselves bombarded with molten death. Once the smoke clears, ash and melted corpses of the enemy flanks are all that remain. The fyrds are then free to cut into their foes’ main forces, rushing them from multiple angles and hacking them down with blazing fyresteel weapons.\n\nIn Aqshy, where fire churns under the surface of even the coldest tundras, the earth-wounds caused by Zharrgron Flame-spitters do not always close. More lava rushes forth, forming new hotspots of volcanic activity that can continue to bubble away for years. The greatest Aqshian battlefields are often pocked with magmic wounds that evidence the Fyreslayers’ past conquests.",
      "referenceKeywords": "Manifestation, Invocation, Ward (6+), Order, Fyreslayers",
      "stats": {
        "move": "-",
        "save": "6+",
        "control": "7+",
        "health": "5",
        "ward": "6+"
      },
      "points": null,
      "modelCount": 1,
      "baseSize": "Use model",
      "cannotBeReinforced": true,
      "isSpearhead": false,
      "isLegends": false,
      "weapons": {
        "ranged": [
          {
            "name": "Magma Blast",
            "type": "ranged",
            "range": "18\"",
            "attacks": "8",
            "hit": "4+",
            "wound": "3+",
            "rend": "1",
            "damage": "1",
            "abilities": ["Crit (2 Hits)"]
          }
        ]
      },
      "abilities": [
        {
          "name": "Magma Blast",
          "phase": "shootingPhase",
          "phaseDetails": "Passive",
          "icon": "shooting",
          "castingValue": null,
          "chantValue": null,
          "cpCost": null,
          "isReaction": false,
          "lore": "At the beck of a Zharrgrim Priest, the Zharrgron Flamespitter hurls forth a fiery orb that arcs across the sky before detonating in an explosion of flame amidst the enemy lines.",
          "declare": null,
          "effect": "Add 1 to hit rolls for this MANIFESTATION’s shooting attacks if the target unit has 10 or more models. Add 1 to hit rolls and wound rolls instead if the target unit has 15 or more models."
        }
      ],
      "notes": null
    }
  ],
  "battleFormations": [
    {
      "id": "b3c8b66e-5e40-56c2-b0c3-a9cd9c8f66d2",
      "name": "Scales of Vulcatrix",
      "cardType": "BattleFormation",
      "source": "aos-4e",
      "faction_id": "FYRESLAYERS",
      "factionTerrainLimit": 1,
      "isLegends": false,
      "points": 10,
      "rules": [
        {
          "name": "Ancient Bloodlines",
          "phase": "defensive",
          "phaseDetails": "Passive",
          "icon": "defensive",
          "lore": "Among the most elite formations of the Fyreslayers are the mighty Scales of Vulcatrix. The proud and majestic Magmadroths in this formation are as venerated as those of their lodge’s royal family.",
          "declare": null,
          "effect": "Add 2 to the Health characteristic of friendly MAGMADROTH units.",
          "cpCost": null,
          "isReaction": false
        }
      ]
    },
    {
      "id": "76624e44-eaf7-54ca-9b45-a65663dbc262",
      "name": "Warrior Kinband",
      "cardType": "BattleFormation",
      "source": "aos-4e",
      "faction_id": "FYRESLAYERS",
      "factionTerrainLimit": 1,
      "isLegends": false,
      "points": null,
      "rules": [
        {
          "name": "Berserk Kindred",
          "phase": "combatPhase",
          "phaseDetails": "Passive",
          "icon": "offensive",
          "lore": "Filled with the fierce fighting spirit of Grimnir, the Warrior Kinband hurls itself at the foe. In their fury, they wield their glinting fyresteel axes so quickly that they appear as a blazing blur.",
          "declare": null,
          "effect": "Add 1 to wound rolls for combat attacks made by friendly FYRESLAYERS INFANTRY units that charged in the same turn.",
          "cpCost": null,
          "isReaction": false
        }
      ]
    },
    {
      "id": "3716c094-c251-5862-831e-3ddc9c6a97ff",
      "name": "Forge Brethren",
      "cardType": "BattleFormation",
      "source": "aos-4e",
      "faction_id": "FYRESLAYERS",
      "factionTerrainLimit": 1,
      "isLegends": false,
      "points": null,
      "rules": [
        {
          "name": "Bulwark of Molten Stone",
          "phase": "defensive",
          "phaseDetails": "Passive",
          "icon": "defensive",
          "lore": "Shrouded in the shimmering heat of the forge-temple, the Forge Brethren direct their magmapikes to form blazing  barricades of lava with sustained volleys of fire, before returning to blasting their enemies to ash.",
          "declare": null,
          "effect": "Add 1 to save rolls for friendly FYRESLAYERS INFANTRY units while they are wholly within friendly territory.",
          "cpCost": null,
          "isReaction": false
        }
      ]
    },
    {
      "id": "5a22c9d6-45d0-5101-a661-4b6c4c9827ab",
      "name": "Lords of the Lodge",
      "cardType": "BattleFormation",
      "source": "aos-4e",
      "faction_id": "FYRESLAYERS",
      "factionTerrainLimit": 1,
      "isLegends": false,
      "points": null,
      "rules": [
        {
          "name": "Martial Pride and Stubborn Will",
          "phase": "endOfTurn",
          "phaseDetails": "Passive",
          "icon": "control",
          "lore": "The Lords of the Lodge burn with a rage tempered by sacred oaths of war.",
          "declare": null,
          "effect": "Add 3 to the control scores of friendly FYRESLAYERS HEROES. In addition, the control scores of FYRESLAYERS HEROES cannot be modified by enemy abilities.",
          "cpCost": null,
          "isReaction": false
        }
      ]
    }
  ],
  "lores": [],
  "enhancements": {
    "artefacts": [
      {
        "id": "1f1e9ba8-9bc7-5dd8-8c21-fae15999db8f",
        "name": "Mastery Over Monsters",
        "cardType": "Enhancement",
        "enhancementType": "artefactsOfPower",
        "source": "aos-4e",
        "points": null,
        "phase": "endOfTurn",
        "phaseDetails": "Passive",
        "icon": "control",
        "lore": "This ur-gold icon identifies the bearer as an authority on behemoths and an expert at breaking their will.",
        "declare": null,
        "effect": "While this unit is contesting an objective, enemy MONSTERS contesting that objective each have a maximum control score of 2.",
        "cpCost": null
      },
      {
        "id": "6577cce0-631f-50e7-81a6-cb02eaeb4c0e",
        "name": "Droth-helm",
        "cardType": "Enhancement",
        "enhancementType": "artefactsOfPower",
        "source": "aos-4e",
        "points": 10,
        "phase": "combatPhase",
        "phaseDetails": "Passive",
        "icon": "offensive",
        "lore": "This ancient helm is said to have been worn by the first Zharrgrim priest to tame a Magmadroth.",
        "declare": null,
        "effect": "Add 1 to hit rolls for Companion weapons used by friendly FYRESLAYERS units while they are wholly within 12\" of this unit.",
        "cpCost": null
      },
      {
        "id": "7f5f9c38-46b9-516a-8ad4-1a3bc6633139",
        "name": "Draught of the Finest Magmalt",
        "cardType": "Enhancement",
        "enhancementType": "artefactsOfPower",
        "source": "aos-4e",
        "points": null,
        "phase": "combatPhase",
        "phaseDetails": "Once Per Battle, Any Combat Phase",
        "icon": "offensive",
        "lore": "A single draught of this fiery beverage sends shivers of energy surging through a Fyreslayer from toes to crest.",
        "declare": null,
        "effect": "Add 3 to the Attacks characteristic of this unit’s melee weapons for the rest of the turn.",
        "cpCost": null
      },
      {
        "id": "b0589592-0496-5659-9b66-98c76b02c817",
        "name": "Ash-cloud Rune",
        "cardType": "Enhancement",
        "enhancementType": "artefactsOfPower",
        "source": "aos-4e",
        "points": 20,
        "phase": "heroPhase",
        "phaseDetails": "Once Per Battle, Enemy Hero Phase",
        "icon": "shooting",
        "lore": "The bearer of this rune can call down a column of soot that blankets the battlefield.",
        "declare": null,
        "effect": "Until the start of your next turn, friendly INFANTRY units cannot be targeted by shooting attacks while they are wholly within 12\" of this unit.",
        "cpCost": null
      }
    ],
    "heroicTraits": [
      {
        "id": "1d97c0fc-dd1e-5d46-8b7a-5365456d543b",
        "name": "Raised Around Beasts",
        "cardType": "Enhancement",
        "enhancementType": "heroicTraits",
        "source": "aos-4e",
        "points": null,
        "phase": "combatPhase",
        "phaseDetails": "Passive",
        "icon": "offensive",
        "lore": "This general knows the precise weak points of the mightiest creatures of the Mortal Realms.",
        "declare": null,
        "effect": "The melee weapons of friendly non-MONSTER units have Anti-MONSTER (+1 Rend) while they are wholly within 9\" of this unit.",
        "cpCost": null
      },
      {
        "id": "def697f7-bbd5-5168-87aa-00f3c9e8e987",
        "name": "Blood of the Berzerker",
        "cardType": "Enhancement",
        "enhancementType": "heroicTraits",
        "source": "aos-4e",
        "points": null,
        "phase": "chargePhase",
        "phaseDetails": "Passive",
        "icon": "movement",
        "lore": "In this noble duardin is fiery aggression given form.",
        "declare": null,
        "effect": "Add 1 to charge rolls for friendly FYRESLAYERS units while they are wholly within 12\" of this unit.",
        "cpCost": null
      },
      {
        "id": "3df01b0c-4ae7-58f4-bd0b-f429e5684009",
        "name": "Fiercely Competitive",
        "cardType": "Enhancement",
        "enhancementType": "heroicTraits",
        "source": "aos-4e",
        "points": null,
        "phase": "combatPhase",
        "phaseDetails": "Passive",
        "icon": "offensive",
        "lore": "This leader is incredibly stubborn and won’t back down from even the boldest of challenges.",
        "declare": null,
        "effect": "If this unit is in combat with an enemy unit that has STRIKE-FIRST, this unit has STRIKE-FIRST. If this unit is in combat with an enemy unit that uses the ‘All-out Attack’ command, add 1 to hit rolls for this unit’s attacks for the rest of the turn.",
        "cpCost": null
      },
      {
        "id": "56bd908f-1109-584f-8c3d-02d9a3ea1be7",
        "name": "Ash-beard",
        "cardType": "Enhancement",
        "enhancementType": "heroicTraits",
        "source": "aos-4e",
        "points": 20,
        "phase": "heroPhase",
        "phaseDetails": "Passive",
        "icon": "special",
        "lore": "So great is this priest’s mastery of magmic energies that they smoulder eternally with Grimnir’s power.",
        "declare": null,
        "effect": "If this unit is not a PRIEST, they have PRIEST (1). If this unit was already a PRIEST, add 1 to this unit’s chanting rolls.",
        "cpCost": null
      }
    ],
    "other": [
      {
        "id": "98924d5e-d13f-56f0-b467-f3add950e2bf",
        "name": "Thickened Scales",
        "cardType": "Enhancement",
        "enhancementType": "otherEnhancements",
        "source": "aos-4e",
        "points": null,
        "phase": "defensive",
        "phaseDetails": "Passive",
        "icon": "defensive",
        "lore": "This beast’s hide is so tough that blades bend upon contact and conventional missiles simply bounce off it.",
        "declare": null,
        "effect": "Subtract 1 from the Rend characteristic of weapons used for attacks that target this unit.",
        "cpCost": null
      },
      {
        "id": "f7a4be37-5f2f-5a94-94da-172bb957f5d8",
        "name": "Incandescent Blaze",
        "cardType": "Enhancement",
        "enhancementType": "otherEnhancements",
        "source": "aos-4e",
        "points": null,
        "phase": "shootingPhase",
        "phaseDetails": "Once Per Battle, Your Shooting Phase",
        "icon": "shooting",
        "lore": "As the rune branded into the side of this Magmadroth ignites, the beast vomits forth a tide of flames hot enough to melt reinforced steel.",
        "declare": null,
        "effect": "For the rest of the turn:\n\n• Double the Attacks characteristic of this unit’s Roaring Fyrestream.\n• This unit’s Roaring Fyrestream has a Damage characteristic of 3.",
        "cpCost": null
      },
      {
        "id": "23bac99f-5552-504d-8d40-70c743472c65",
        "name": "Peerless Lineage",
        "cardType": "Enhancement",
        "enhancementType": "otherEnhancements",
        "source": "aos-4e",
        "points": null,
        "phase": "startOfTurn",
        "phaseDetails": "Reaction: You declared a RAMPAGE ability for this unit",
        "icon": "special",
        "lore": "This beast is of a mighty pedigree, even more regal and powerful than its potent kin.",
        "declare": null,
        "effect": "You can pick another eligible unit to be a second target of that RAMPAGE ability. If the ability requires a roll, you must roll for each target.",
        "cpCost": null
      },
      {
        "id": "b2a8a6b1-13f1-56c9-9d22-a6465ebf641a",
        "name": "Toe to Toe",
        "cardType": "Enhancement",
        "enhancementType": "regimentOfRenown",
        "source": "aos-4e",
        "points": null,
        "phase": "endOfTurn",
        "phaseDetails": "Passive",
        "icon": "control",
        "lore": "The duardin who follow Fjori into battle do not back down from any foe, no matter the size.",
        "declare": null,
        "effect": "Subtract 10 from the control scores of enemy MONSTERS while they are in combat with any units in this Regiment of Renown.",
        "cpCost": null
      },
      {
        "id": "2be57ea8-01db-5405-af77-a881cd19ec23",
        "name": "Grimnir's Defiance",
        "cardType": "Enhancement",
        "enhancementType": "regimentOfRenown",
        "source": "aos-4e",
        "points": null,
        "phase": "defensive",
        "phaseDetails": "Passive",
        "icon": "defensive",
        "lore": "For these vengeful Fyreslayers, the bigger the enemy, the better.",
        "declare": null,
        "effect": "Units in this Regiment of Renown cannot be picked to be the target of RAMPAGE abilities used by enemy units.",
        "cpCost": null
      }
    ]
  },
  "terrain": [
    {
      "id": "6e082c76-f8ea-5ef2-a1e9-72ebc52e4deb",
      "name": "Magmic Battleforge",
      "cardType": "FactionTerrain",
      "source": "aos-4e",
      "abilities": []
    }
  ],
  "rules": {
    "battleTraits": [
      {
        "name": "Daring Tamers",
        "phase": "defensive",
        "phaseDetails": "Passive",
        "icon": "defensive",
        "lore": "Vulkyn Flameseekers are professional corrallers of huge, wild creatures.",
        "declare": null,
        "effect": "Enemy MONSTERS have STRIKE-LAST while they are in combat with 2 or more friendly DROTHKEEPERS Vulkyn Flameseekers units."
      },
      {
        "name": "Skilled Drothwranglers",
        "phase": "movementPhase",
        "phaseDetails": "Reaction: You declared a non-CHARGE MOVE ability for a friendly MAGMADROTH",
        "icon": "movement",
        "lore": "Only Lofnir Drothkeepers are bold enough to grab a charging Magmadroth’s saddle straps and be carried  into battle.",
        "declare": null,
        "effect": "Pick a friendly Vulkyn Flameseekers unit and/or a friendly DROTHKEEPERS INFANTRY HERO that are not in combat and are wholly within 6\" of the MAGMADROTH to be the targets. Units that have hitched a lift this turn (see below) cannot be targets.\n\nRemove the targets from the battlefield. After the MAGMADROTH ends its move, you must set up each target on the battlefield, wholly within 6\" of the MAGMADROTH and not in combat. The targets have hitched a lift. Units that hitched a lift cannot use CHARGE abilities in the same turn."
      },
      {
        "name": "Rearing Strike",
        "phase": "combatPhase",
        "phaseDetails": "Once Per Turn (Army), Any Combat Phase",
        "icon": "offensive",
        "lore": "The Magmadroth raises itself up and comes crashing down on its prey, itsclaws lacerating flesh and its sheer weight cruising bones and metal.",
        "declare": "Pick a friendly DROTHKEEPERS MONSTER that has not used a RAMPAGE ability this turn to use this ability, then pick an enemy unit in combat with it to be the target.",
        "effect": "Roll 2 dice. Add 2 to each roll if the target is a MONSTER. For each 5+, inflict D3 mortal damage on the target."
      },
      {
        "name": "Searing Claws",
        "phase": "combatPhase",
        "phaseDetails": "Once Per Turn (Army), Any Combat Phase",
        "icon": "offensive",
        "lore": "A Magmadroth’s claws radiate such intense heat that they can melt steel. Even if an enemy is not slain by a raking blow, their armour will be left pitted and useless.",
        "declare": "Pick a friendly DROTHKEEPERS MONSTER that has not used a RAMPAGE ability this turn to use this ability, then pick an enemy unit in combat with it to be the target.",
        "effect": "Roll a dice. On a 3+, for the rest of the turn, add 1 to the Rend characteristic of melee weapons used for attacks that target that enemy unit."
      },
      {
        "name": "Ferocious Heat",
        "phase": "combatPhase",
        "phaseDetails": "Once Per Turn (Army), Any Combat Phase",
        "icon": "offensive",
        "lore": "The hero stirs the rage of their Magmadroth, stoking its smouldering aura to such heights that it burns through arcane wards and enchantments.",
        "declare": "Pick a friendly DROTHKEEPERS MONSTER that has not used a RAMPAGE ability this turn to use this ability, then pick an enemy unit in combat with it to be the target.",
        "effect": "Roll a dice. On a 3+, ward rolls cannot be made for the target for the rest of the turn."
      },
      {
        "name": "Rune of Fiery Determination",
        "phase": "heroPhase",
        "phaseDetails": "Once Per Battle (Army), Any Hero Phase",
        "icon": "defensive",
        "lore": "A sliver of Grimnir’s awesome resolve courses through the Fyreslayers.",
        "declare": null,
        "effect": "You can only use this ability if you have not used any UR-GOLD RUNE abilities this battle round.\n\nFriendly FYRESLAYERS units have WARD (5+) for the rest of the battle round."
      },
      {
        "name": "Rune of Relentless Zeal",
        "phase": "movementPhase",
        "phaseDetails": "Once Per Battle (Army), Your Movement Phase",
        "icon": "movement",
        "lore": "The hearts of the Fyreslayers swell with a fiery conviction that sees them bear down upon the foe with surprising swiftness.",
        "declare": null,
        "effect": "You can only use this ability if you have not used any UR-GOLD RUNE Abilities this battle round.\n\nFor the rest of the battle round, friendly FYRESLAYERS units can use CHARGE abilities even if they used a RUN ability in the same turn."
      },
      {
        "name": "Rune of Fury",
        "phase": "startOfTurn",
        "phaseDetails": "Once Per Battle (Army), Start of Any Turn",
        "icon": "offensive",
        "lore": "The rune of fury grants the Fyreslayers a portion of their god’s battle rage.",
        "declare": null,
        "effect": "You can only use this ability if you have not used any UR-GOLD RUNE Abilities this battle round.\n\nFor the rest of the battle round, friendly FYRESLAYERS units have STRIKE-FIRST while they are in combat with an enemy unit that charged in the same turn."
      },
      {
        "name": "Rune of Searing Heat",
        "phase": "combatPhase",
        "phaseDetails": "Once Per Battle (Army), Any Combat Phase",
        "icon": "offensive",
        "lore": "The edges of the Fyreslayers’ weapons glow with the heat of the forge.",
        "declare": null,
        "effect": "You can only use this ability if you have not used any UR-GOLD RUNE abilities this battle round.\n\nMelee weapons used by friendly FYRESLAYERS units have Crit (Mortal) for the rest of the battle round."
      },
      {
        "name": "Rune of Farsight",
        "phase": "shootingPhase",
        "phaseDetails": "Once Per Battle (Army), Your Shooting Phase",
        "icon": "shooting",
        "lore": "Empowered by this rune, the Fyreslayers hurl their throwing axes into the enemy with devastating accuracy.",
        "declare": "You can only use this ability if you have not used any UR-GOLD RUNE abilities this battle round.\n\nPick any number of enemy units within 10\" of any visible friendly FYRESLAYERS units to be targets.",
        "effect": "Roll a D3 for each target. On a 2+, inflict an amount of mortal damage on the target equal to the roll."
      }
    ]
  }
}
