{
  "id": "basic",
  "link": "https://game-datacards.eu",
  "name": "Basic",
  "is_subfaction": false,
  "parent_id": "",
  "battle_rules": [
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "ea416edc-3611-4314-820b-009f5a6efa01",
      "main_desc": "",
      "callouts": [
        {
          "type": "gambit",
          "callout_text": "DETERMINE DISTRACTION TARGET:",
          "detail": "Your Distraction target will be equal to half the number of enemy units that are within Engagement Range of one or more units from your army (rounding up) at the end of your fifth turn. If your Distraction target is less than 4, it is increased to 4."
        },
        {
          "type": "gambit",
          "callout_text": "DISTRACT ENEMY UNITS:",
          "detail": "At the end of your fifth turn, roll one D6 for each enemy unit that is within Engagement Range of one or more units from your army. Add 1 to the result if that enemy unit is Battle-shocked and subtract 1 if one or more of the units from your army that are within Engagement Range of it are Battle-shocked. Ona 4+, that enemy unit has been successfully delayed."
        },
        {
          "type": "gambit",
          "callout_text": "DETERMINE GAMBIT SUCCESS:",
          "detail": "If the number of enemy units that have been successfully delayed is greater or equal to your Distraction target, this Gambit is successfully completed and you score 30VP."
        }
      ],
      "rule_type": "GAMBIT",
      "rule_subtype": "ATTACKER",
      "name": "DELAYING TACTICS",
      "flavor_text": "The whole battle was a ruse to buy our covert kill teams the time they need to successfully complete a mission that could turn the tide of the entire war."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "2c913226-e60f-459b-8579-f4e59c04215a",
      "main_desc": "",
      "callouts": [
        {
          "type": "gambit",
          "callout_text": "DETERMINE EVACUATION TARGET:",
          "detail": "Your Evacuation target will be equal to half the number of units from your army that are on the battlefield at the end of the battle (rounding up), including units embarked within TRANSPORT models that are on the battlefield. If your Evacuation oreo is less than 4, it is increased to 4."
        },
        {
          "type": "gambit",
          "callout_text": "EVACUATE UNITS:",
          "detail": "At the end of your fifth turn, roll one D6 for each unit from your army that is wholly within 6\" of the centre of the battlefield, subtracting 1 from the result if that unit is Battle-shocked.  On a 4+, that unit (and any units embarked within it) are marked for evacuation."
        },
        {
          "type": "gambit",
          "callout_text": "DETERMINE GAMBIT SUCCESS:",
          "detail": "If the number of your units that are marked for evacuation is greater than or equal to your Evacuation target, this Gambit is successfully completed and you score 30VP."
        }
      ],
      "rule_type": "GAMBIT",
      "rule_subtype": "ATTACKER",
      "name": "EMERGENCY EVACUATION",
      "flavor_text": "Remaining in this battlezone is folly. Teleportariums are being sanctified and orbital transports are inbound to exfiltrate what forces remain. Prepare for immediate extraction."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "47fe604c-f824-48b9-b3de-4e8d300458db",
      "main_desc": "At the end of your fifth turn, if one or more units from your army that are not Battle-shocked are wholly within 9\" of a corner of the battlefield, and those units are not within your own deployment zone, roll 2D6.\\\n\\\nAdd 1 to the result for every other corner of the battlefield that has one or more units from your army wholly within 9\" of it (excluding units that are Battle-shocked or within Engagement Range of any enemy units).\\\n\\\nIf the final result is 12 or more, this Gambit is successfully completed and you score 30VP.",
      "callouts": [],
      "rule_type": "GAMBIT",
      "rule_subtype": "ATTACKER",
      "name": "ORBITAL STRIKE COORDINATES",
      "flavor_text": "The battlefield is lost. Triangulate coordinates and transmit them to our orbital assets so that they can unleash their fury and deny the enemy their prize."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "10516963-c571-46f9-9229-4d87ce00b98a",
      "main_desc": "If you select this Gambit card, you have chosen not to attempt a gambit.\\\n\\\nUntil the end of the battle, you continue to score VP from your Primary Mission.",
      "callouts": [],
      "rule_type": "GAMBIT",
      "rule_subtype": "ATTACKER",
      "name": "PROCEED AS PLANNED",
      "flavor_text": "Your battle plan is unfolding as you had foreseen, and the time to:strike the fatal blow is almost at hand. Stay the course, and victory is all but assured."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "64f17acf-e451-4084-8bbf-9f1701815b99",
      "main_desc": "In this mission, no additional mission rules apply.",
      "callouts": [],
      "rule_type": "MISSION RULE",
      "rule_subtype": "",
      "name": "CHILLING RAIN",
      "flavor_text": "Intense winds gust across the battlefield, whipping through the shattered remains of bombed ruins and heavy with the stench of death. Icy rain drenches and chills the warriors, only adding to their misery and discomfort."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "6d12421c-8268-46f3-846e-53cf5d65ad0b",
      "main_desc": "In this mission, objective markers are not placed as shown on the Deployment card drawn. Instead, players roll off at the start of the Place Objective Markers step, then alternate setting up objective markers, one at a time, starting with the winner of the roll off.\\\n\\\nOne objective marker must be placed wholly within each deployment zone, and the remaining objective markers must be placed wholly within No Man's Land, as shown on the Deployment card drawn. Objective markers must be placed more than 6\" away from any battlefield edge and more than 9\" away from all other objective markers.\\\n\\\nIf for whatever reason it is not possible to set up an objective marker as described above, it is not placed on the battlefield.\\\n\\\nIf any rules require players to set up additional objective markers (e.g. Hidden Supplies) during the Place Objective Markers step, players set them up as described on this Mission Rule card.\\\n\\\nIf any rules instruct players to remove one or more objective markers, do so after setting them all up.",
      "callouts": [],
      "rule_type": "MISSION RULE",
      "rule_subtype": "",
      "name": "CHOSEN BATTLEFIELD",
      "flavor_text": "Both sides have scouted the area extensively, pinpointing the exact location of vital sites."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "4fdcd263-5b2a-4bf4-8af4-dd6a47d9d24f",
      "main_desc": "In this mission, until the start of the third battle round, each time a Reserves or Strategic Reserves unit wishes to arrive on the battlefield, the controlling player must make a Reserves roll for it. To do so, that player rolls one D6: on a 3+, that unit arrives on the wise, the Reserves roll fails and that unit does not arrive this turn.",
      "callouts": [],
      "rule_type": "MISSION RULE",
      "rule_subtype": "",
      "name": "DELAYED RESERVES",
      "flavor_text": "Enemy interceptors roam the skies, strafing and bombing any of our reinforcement units they discover. Our forces will inevitably be delayed as they attempt to dodge these vicious aerial patrols."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "65c1e2dc-5abb-4fd7-86d7-f9419f0abc03",
      "main_desc": "In this mission, players must set up one additional objective marker in No Man's Land.\\\n\\\nUnless the Chosen Battlefield mission rule is also in effect, before setting up this new objective marker, players must first move the objective marker in the centre of the battlefield 6\" directly towards one of the corners of the battlefield (if No Man's Land touches any of the corners of the battlefield, you must move the objective marker towards, one of those corners). Players then set up the new objective marker 6\" from the centre of the battlefield towards the diagonally opposite corner of the battlefield to the previously moved objective marker.",
      "callouts": [],
      "rule_type": "MISSION RULE",
      "rule_subtype": "",
      "name": "HIDDEN SUPPLIES",
      "flavor_text": "Reconnaissance units have uncovered a hidden cache of ammunition, fuel and rations in this war zone."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "3544ea6c-0024-4f98-9065-5db57d478236",
      "main_desc": "In this mission, shuffle the remaining Mission Rule cards together before drawing 2 new Mission Rule cards.\\\n\\\nIf either of these new Mission Rule cards is Chilling Rain, discard that Mission Rule card and draw 2 additional new Mission Rule cards (for a total of 3 new Mission Rule cards).\\\n\\\nApply all the drawn Mission Rule cards to the battle.",
      "callouts": [],
      "rule_type": "MISSION RULE",
      "rule_subtype": "",
      "name": "MAELSTROM OF BATTLE",
      "flavor_text": "Little respite or sanctuary is available across the battlefields of the 41st Millennium."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "16896d5e-d39f-44ad-aaa5-40a837ba44da",
      "main_desc": "In this mission, each time an Advance roll of 6 is made for a unit, that unit suffers 1 mortal wound.",
      "callouts": [],
      "rule_type": "MISSION RULE",
      "rule_subtype": "",
      "name": "MINEFIELDS",
      "flavor_text": "Buried ordnance and hidden boody traps litter this battlefield, posing a threat to all units that advance recklessly and without due care."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "b49d31ac-7107-4446-8978-e7ca52c31d07",
      "main_desc": "In this mission:\n- Players' units with the Infiltrators ability cannot be set up within range of an objective marker that is either in No Man's Land or their opponent's deployment zone.\n- Players' units with the Scouts ability that make a move before the first turn begins cannot end that move within range of an objective marker that is either in No Man's Land or their opponent's deployment zone.\n- If any rule is used to redeploy a unit, that rule cannot be used to set up that unit within range of an objective marker in No Man's Land.\n- When a player's Reserves and Strategic Reserves units are set up on the battlefield, they cannot be set up within range of an objective marker that is either in No Man's Land or their opponent's deployment zone.",
      "callouts": [],
      "rule_type": "MISSION RULE",
      "rule_subtype": "",
      "name": "SCRAMBLER FIELDS",
      "flavor_text": "Scrambler fields and more esoteric devices have been activated in this area, restricting the use of advanced stealth and teleportation technologies."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "0d2f08ba-01d8-4444-9d71-a8466d303dd8",
      "main_desc": "In this mission, in each player's Command phase, the first time that player draws Secondary Mission cards that phase, that player can draw one additional Mission card, and then discard one of their active Secondary Mission cards.",
      "callouts": [],
      "rule_type": "MISSION RULE",
      "rule_subtype": "",
      "name": "SECRET INTEL",
      "flavor_text": "Our spies and recon teams have reported back with secret intelligence, allowing us to better coordinate our next tactical move."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "1b4b5fff-bd81-4726-9839-846083227f8a",
      "main_desc": "In this mission, if a player controls the objective marker in their own deployment zone at the start of their Command phase, they roll one D6: on a 4+, that player gains 1CP.",
      "callouts": [],
      "rule_type": "MISSION RULE",
      "rule_subtype": "",
      "name": "SUPPLY LINES",
      "flavor_text": "Enemy infiltrators are attempting to sabotage and disrupt your supply lines. Maintain vigilance to secure lines of communication and safeguard vital strategic resources."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "a72131e2-50e6-45e4-9ed9-8f35ecb1bace",
      "main_desc": "In this mission, if a player controls an objective marker at the end of their Command phase, that objective marker remains under their control, even if they have no models within range of it, unless their Opponent controls it at the end of any subsequent Command phase.",
      "callouts": [],
      "rule_type": "MISSION RULE",
      "rule_subtype": "",
      "name": "SWEEP AND CLEAR",
      "flavor_text": "Forces have been ordered to perform a firesweep of this battlefield, methodically cleansing strategic sites of enemies one at a time before moving on."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "167d2125-cdef-4611-877b-50a969a36662",
      "main_desc": "In this mission, if a player is using Tactical Missions, then each time that player determines which Secondary Mission cards are active for them, if they have fewer than 3 active Secondary Mission cards, that player draws from their Secondary Mission deck until they have 3 Secondary Mission cards.\\\n\\\nIn this mission, if a player is using Fixed Missions, then in addition to the 2 Fixed Mission cards, that player will also draw cards from their Secondary Mission deck during the battle. At the end of the Select Secondary Missions step, that player should retrieve their Secondary Mission deck, remove all the Fixed Mission cards that they did not select at the start of that step, then shuffle the remaining cards. Then, at the Start of each of that player's Command phases, if that player has fewer than 3 active Secondary Mission cards (including their Fixed Mission cards), they draw from their Secondary Mission deck until they have 3 Secondary Mission cards. That player has access to the New Orders Stratagem, and can spend CP to use it after drawing their Secondary Mission cards if they wish (remember that Fixed Mission cards cannot be discarded for any reason).",
      "callouts": [],
      "rule_type": "MISSION RULE",
      "rule_subtype": "",
      "name": "TARGETS OF OPPORTUNITY",
      "flavor_text": "This battle zone is replete with tactical targets of opportunity, ideal for warlords who are eager for glory."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "f41afae7-41d1-4d2d-a05a-33dde7526f27",
      "main_desc": "In this mission, the Command Re-roll Stratagem and New Orders Stratagem both cost 2CP to use.",
      "callouts": [],
      "rule_type": "MISSION RULE",
      "rule_subtype": "",
      "name": "VOX STATIC",
      "flavor_text": "Stellar flares, malicious scrapcode and electromagnetic energy restrict communications."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "40k-10e",
      "id": "e2462e4b-b3f8-4b04-9aab-bf0e7a580559",
      "main_desc": "The objective markers that start the battle in No Man's Land are servo-skulls. At the end of each turn, each of these objective markers can be moved up to 6 in any direction by the player that controls it. When moving objective markers, they cannot end that move on top of any other objective marker or model, or inside impassable parts of terrain features (such as the walls of a ruin).",
      "callouts": [
        {
          "type": "primary",
          "callout_text": "In the second, third, fourth and fifth battle rouns:",
          "detail": "At the end of each turn, the player whose turn it is scores VP as follows:\n- 2VP for each servo-skull that is wholly within 12\" of their opponent's deployment zone.\n- 5VP for each servo-skull that is wholly within 6\" of their opponent's deployment zone.\n- 8VP for each servo-skull that is wholly within thelr opponent's deployment zone.",
         },
        {
          "type": "primary",
          "callout_text": "",
          "detail": "Note that these are cumulative, so if a servo-skull is wholly within your opponent' s deployment zone, you would score 15VP from that servo-skull at the end of your turn."
        }
      ],
      "rule_type": "PRIMARY MISSION",
      "rule_subtype": "",
      "name": "DEPLOY SERVO-SKULLS",
      "flavor_text": "This area contains mobile surveillance devices. Redepioy these to scout behind the enemys lines",
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "f43db241-f06b-489e-83e9-5651cbecba45",
      "main_desc": "",
      "callouts": [
        {
          "type": "primary",
          "callout_text": "In the second, third, fourth and fifth battle rounds:",
          "detail": "At the end of each Command phase, the player whose turn it is scores SVP for each objective marker they control (up to 10VP per turn)."
        },
        {
          "type": "primary",
          "callout_text": "At the end of the battle:",
          "detail": "Each player scores SVP for each objective marker they control (up to 15VP per player)."
        }
      ],
      "rule_type": "PRIMARY MISSION",
      "rule_subtype": "",
      "name": "PRIORITY TARGETS",
      "flavor_text": "The objectives in this area are vital to our war effort and securing them is your highest priority. Spare nothing in ensuring that they do not fall into enemy hands."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "6964f185-7736-43fb-b31f-ddc760e8ff8e",
      "main_desc": "",
      "callouts": [
        {
          "type": "primary",
          "callout_text": "In the second, third and fourth battle rounds:",
          "detail": "At the end of each Command phase, the player whose turn it is scores 4VP if they control one or more objective markers, and an extra 4VP if they control more objective markers than their opponent lets"
        },
        {
          "type": "primary",
          "callout_text": "In the fifth battle round:",
          "detail": "- The player who has the first turn scores VP as described above. - The player who has the second turn scores VP as described above, but does so at the end of their turn instead of at the end of their Command phase."
        },
        {
          "type": "primary",
          "callout_text": "In every battle round:",
          "detail": "At the end of the battle round, each player scores 4VP if one or more enemy units were destroyed that battle round, and an extra 4VP if more enemy units than friendly units were destroyed that battle round."
        },
        {
          "type": "primary",
          "callout_text": "In every battle round:",
          "detail": "Note that a unit can, if it is returned to the battlefield for any reason, potentially contribute to this Primary Mission several times (assuming it is returned and subsequently destroyed several times over)."
        }
      ],
      "rule_type": "PRIMARY MISSION",
      "rule_subtype": "",
      "name": "PURGE THE FOE",
      "flavor_text": "Exterminate the enemy. Show them no mercy."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "cd6a55ae-255c-4215-8ed0-c70ea90b286e",
      "main_desc": "From the second battle round, in each player's shooting phase, the player whose turn it is can select one unit from their army that is not Battle-shocked and is eligible to shoot. Until the end of that turn, that unit is not eligible to shoot or declare a charge. At the start of its controlling player's next Command phase, if that unit is within 1\" of an objective marker that the player whose turn it is controls, that objective marker is burned and removed from the battlefield.\\\n\\\n",
      "callouts": [
        {
          "type": "primary",
          "callout_text": "In the second, third and fourth battle rounds:",
          "detail": "At the end of each Command phase, the player whose turn it is scores 5VP for each objective marker they control (up to 1OVP per turn)."
        },
        {
          "type": "primary",
          "callout_text": "In the fifth battle round:",
          "detail": "- The player who has the first turn scores VP as described above. - The player who has the second turn scores VP as described above, but does so at the end of their turn instead of at the end of their Command phase."
        },
        {
          "type": "primary",
          "callout_text": "At the end of the battle:",
          "detail": "Each player scores 5VP if one or more objective markers in No Man's Land were burned by a unit from their army, and 10VP if the objective marker in their opponent's deployment zone was burned."
        }
      ],
      "rule_type": "PRIMARY MISSION",
      "rule_subtype": "",
      "name": "SCORCHED EARTH",
      "flavor_text": "What cannot be secured must be burned to ash."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "240bc13a-be7f-418e-9424-0ed7ee2ee982",
      "main_desc": "The objective markers in No Man's Land are sites of power. At the end of each Command phase, the player whose turn it is empowers all sites of power that they control that have one or more CHARACTER models from their army within range; each site of power remains empowered by that player while one or more of their CHARACTER models remains within range of it.",
      "callouts": [
        {
          "type": "primary",
          "callout_text": "In the second, third and fourth battle rounds:",
          "detail": "At the end of each player's Command phase, the player whose turn it is scores 3 VP as follows (up to 1SVP per turn): - 3VP for each objective marker they control. - 3VP for each site of power that they have empowered."
        },
        {
          "type": "primary",
          "callout_text": "In the second, third and fourth battle rounds:",
          "detail": "Note that these are cumulative, so a player that controls one objective marker they have also empowered will score 6VP that turn."
        },
        {
          "type": "primary",
          "callout_text": "In the fifth battle round:",
          "detail": "- The player who has the first turn scores VP as described above. - The player who has the second turn scores VP as described above, but does so at the end of their turn instead of at the end of their Command phase."
        }
      ],
      "rule_type": "PRIMARY MISSION",
      "rule_subtype": "",
      "name": "SITES OF POWER",
      "flavor_text": "There is great power for those bold enough to claim it."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "10d2826c-a3a0-451a-a523-9b3fef6b6037",
      "main_desc": "At the start of the battle, players randomly select two different objective markers in No Man's Land: the first selected is the Alpha objective, the second selected is the Omega objective. At the start of the fourth battle round, the Alpha objective is removed from the battlefield. At the start of the fifth battle round, all objective markers in No Man's Land apart from the Omega objective are also removed.",
      "callouts": [
        {
          "type": "primary",
          "callout_text": "In the second, third battle rounds:",
          "detail": "At the end of each Command phase, the player whose turn it is scores 5VP for each objective marker they control in No Man's Land."
        },
        {
          "type": "primary",
          "callout_text": "In the fourth battle round:",
          "detail": "At the end af each Commend phase, the player whose turn it is scores 8VP for each objective marker they control in No Man's Land."
        },
        {
          "type": "primary",
          "callout_text": "In the fifth battle round:",
          "detail": "- The playery who has the first turn scores 15VP at the end of their Command phase if they control the objective marker in No Man's Land. - The player who has the second turn scores 15VP at the end of their turn if they control the objective marker in No Man's Land."
        }
      ],
      "rule_type": "PRIMARY MISSION",
      "rule_subtype": "",
      "name": "SUPPLY DROP",
      "flavor_text": "Supplies are inbound. Secure the drop coordinates"
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "7d03955e-471d-42b3-bdb7-76e3aebda928",
      "main_desc": "",
      "callouts": [
        {
          "type": "primary",
          "callout_text": "In the second, third and fourth battle rounds:",
          "detail": "At the end of each Command phase, the player whose turn it is scores 5VP for each objective marker they control (up to 15VP per turn)."
        },
        {
          "type": "primary",
          "callout_text": "In the fifth battle round:",
          "detail": "- The player who has the first turn scores VP as described above. - The player who has the second turn scores VP as described above, but does so at the end of their turn instead of at the end of their Command phase."
        }
      ],
      "rule_type": "PRIMARY MISSION",
      "rule_subtype": "",
      "name": "TAKE AND HOLD",
      "flavor_text": "Several strategic locations have been identified in your vicinity. You are ordered to assault these positions, secure a them and hold them at any cost."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "b35b3f26-4e78-4b54-80e1-a3c36ef46839",
      "main_desc": "When setting up the battlefield, remove all objective markers in No Man's Land except the one closest to the centre of the battlefield.\\\n\\\nIn each player's Shooting phase, the player whose turn it is can select one unit from their army that is not Battle-shocked and is eligible to shoot. Until the end of that turn, that unit is not eligible to shoot or declare a charge. At the end of that turn, the player whose turn it is can set up one objective marker wholly within No Man's Land and within 1\" of that unit provided it can be setup exactly 9° from one other objective marker and not within 6\" of any other objective marker.",
      "callouts": [
        {
          "type": "primary",
          "callout_text": "In the second, third and fourth battle rounds:",
          "detail": "At the end of each Command phase, the player whose turn it it is scores 5VP for each objective marker in No Man's Land they control (up to 15VP perturn)."
        },
        {
          "type": "primary",
          "callout_text": "In the fifth battle round:",
          "detail": "- the player who has the first turn scores VP as described above. - The player who has the second turn scores VP as described above, but does so at the end of their turn instead of at the end of their command phase."
        }
      ],
      "rule_type": "PRIMARY MISSION",
      "rule_subtype": "",
      "name": "THE RITUAL",
      "flavor_text": "Bitter foes clash in a race to finish a ritual to either sanctify or corrupt the battlefield."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "1832e5db-fefb-4db1-a972-32bdaac9ec16",
      "main_desc": "If you draw this and the Hidden Supplies Mission Rule card, discard this card and draw a new Primary Mission card.\\\n\\\nAfter setting up the battlefield, remove the objective marker in No Man's Land that is closest to the centre of the battlefield.",
      "callouts": [
        {
          "type": "primary",
          "callout_text": "In the second, third and fourth battle rounds:",
          "detail": "At the end of each Command phase, the player whose turn it is scores VP as follows: - If they control the objective marker in their own deployment zone, they score 2VP. - For each objective marker in No Man's Land that they control, they score 5VP - If they control the objective marker in their opponent's deployment zone, they score 6VP."
        },
        {
          "type": "primary",
          "callout_text": "In the fifth battle round:",
          "detail": "- The player who has the first turn scores Ss VP as described above. - The player who has the second turn scores VP as described above, but does so at the end of their turn instead of at the end of their Command phase."
        }
      ],
      "rule_type": "PRIMARY MISSION",
      "rule_subtype": "",
      "name": "VITAL GROUND",
      "flavor_text": "The most vital ground in the region is in enemy hands."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "6d54e211-66c6-445d-8523-fcb1cf1b2ad9",
      "main_desc": "At the end of your turn, if one or more units from your army (excluding Battle-shocked units) are wholly within 6\" of the centre of the battlefield, and there are no enemy units wholly within 6\" of the centre of the battlefield, this Secondary Mission is achieved and you score 5VP\\\n\\\nIf, at the end of your turn,  there are one or more enemy units wholly within 6\" of the centre of the battlefield, but there are no enemy units within 3\" of the centre of the battlefield, then this Secondary Mission is still achieved but in this instance you score 3VP instead of 5VP.",
      "callouts": [],
      "rule_type": "SECONDARY MISSION",
      "rule_subtype": "ATTACKER",
      "name": "AREA DENIAL",
      "flavor_text": "It is critical that this area is dominated. No enemy vanguard or guerrilla units can be allowed to disrupt our plans."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "095843cb-7bdb-47a9-a932-4b529a8f2537",
      "main_desc": "If you are using Fixed Missions, then while this Secondary Mission is active, each time an enemy CHARACTER model is destroyed, you score 4VP.\\\n\\\nIf you are using Tactical Missions, then at the end of the turn, if either of the conditions below are satisfied, this Secondary Mission is achieved and you score 5VP: - One or more enemy CHARACTER units were destroyed this turn - All CHARACTER units from your opponent's Army Roster have been destroyed during the battle.\\\n\\\nNote that if you are using Tactical Missions, this Secondary Mission is achieved even if such a unit was destroyed and then subsequently resurrected for any reason.",
      "callouts": [],
      "rule_type": "SECONDARY MISSION",
      "rule_subtype": "ATTACKER",
      "name": "ASSASINATION",
      "flavor_text": "The enemy look to their champions for courage. Identify and eliminate them with extreme prejudice."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "ec379ebd-32b5-49e1-b983-e23174a396b0",
      "main_desc": "When this Secondary Mission card is drawn, your opponent must select one objective marker in No Man's Land.\\\n\\\nAt the end of your turn, if you control that selected objective marker, this Secondary Mission is achieved and you score 5VP.",
      "callouts": [],
      "rule_type": "SECONDARY MISSION",
      "rule_subtype": "ATTACKER",
      "name": "A TEMPTING TARGET",
      "flavor_text": "An opportunity to seize a valuable asset has been identified, but the enemy are likely to use it as bait in a trap. Move to secure the site, but be wary of enemy ambushes."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "a5d53a77-2b1f-4639-b8c1-4c705478b51d",
      "main_desc": "At the end of your turn, if two or more units from your army (excluding AIRCRAFT) are wholly within your opponent's deployment zone, this Secondary Mission is achieved and you score 4VP.\\\n\\\nIf, at the end of your turn, only one unit from your army (excluding AIRCRAFT) is wholly within your opponent's deployment zone, then this Secondary Mission is still achieved, but in this instance you score 2VP instead of 4VP.\\\n\\\nIf you are using Tactical Missions, then when this Secondary Mission is achieved you score an extra 1VP (for a maximum of 5VP).",
      "callouts": [],
      "rule_type": "SECONDARY MISSION",
      "rule_subtype": "ATTACKER",
      "name": "BEHIND ENEMY LINES",
      "flavor_text": "Break through the foe's army and cut off their lines of escape."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "a1d9f743-52bf-4b98-9e1d-b88a369315a0",
      "main_desc": "While this Secondary Mission is active, each time an enemy MONSTER or VEHICLE model is destroyed, you score 2VP and an extra 1VP for each of the conditions below that are satisfied (all are cumulative): - The destroyed model had a Wounds characteristic of 10+. - The destroyed model had a Wounds characteristic of 15+. - The destroyed model had a Wounds characteristic of 20+.\\\n\\\nNote that VP are scored even if such a model is destroyed and then subsequently resurrected for any reason. If you score any VP from this Secondary Mission during a turn, then at the end of that turn this Secondary Mission is achieved.\\\n\\\nIf you are using Tactical Missions, then when this Secondary Mission is achieved you score an extra 1VP. However, if you are using Tactical Missions, you cannot score more than 8VP in total from this Secondary Mission.",
      "callouts": [],
      "rule_type": "SECONDARY MISSION",
      "rule_subtype": "ATTACKER",
      "name": "BRING IT DOWN",
      "flavor_text": "The opposing army contains numerous heavily armoured units. Take any opportunity to bring them down."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "0f8cc472-ec8b-445e-8afe-52cbaf10f263",
      "main_desc": "At the end of your turn, if you control one or more objective markers in your opponent's deployment zone, this Secondary Mission is achieved and you score 8VP.",
      "callouts": [],
      "rule_type": "SECONDARY MISSION",
      "rule_subtype": "ATTACKER",
      "name": "CAPTURE ENEMY OUTPOST",
      "flavor_text": "A vital objective has been identified in your vicinity, but it is currently held by the enemy. You are ordered to capture it at any cost."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "ccee45ce-31d5-4190-acba-1b63281a9e36",
      "main_desc": "At the end of your turn, each objective marker that is not within your deployment zone that you control that has one or more of these selected units within range is cleansed by your army.\\\n\\\nIf one or more at markers are cleansed by your army this turn, this Secondary Mission is achieved and you score a number of VP depending on the number of objective markers cleansed by your army this turn, as follows: - 1 objective marker cleansed = 2VP if you are using Fixed Missions, or 3VP if you are using Tactical Missions. - 2 or more objective markers cleansed = 4VP if you are using Fixed Missions, or 5VP if you are using Tactical Missions.",
      "callouts": [],
      "rule_type": "SECONDARY MISSION",
      "rule_subtype": "ATTACKER",
      "name": "CLEANSE",
      "flavor_text": "In your Shooting phase, you can select one or more units from your army that are not Battle-shocked and are eligible to shoot. Until the end of your turn, the units you selected are not eligible to shoot or declare a charge."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "76590a72-3f34-4d89-9065-d4039960e346",
      "main_desc": "At the end of your opponent's turn, or at the end of the battle (whichever comes first), if you control one or more objective markers in your own deployment zone, this Secondary Mission is achieved and you score 3VP.\\\n\\\nThis Secondary Mission cannot be achieved during the first battle round; if you draw this Secondary Mission card during the first battle round, draw a new Secondary Mission card and shuffle this Secondary Mission card back into your Secondary Mission deck.",
      "callouts": [],
      "rule_type": "SECONDARY MISSION",
      "rule_subtype": "ATTACKER",
      "name": "DEFEND STRONGHOLD",
      "flavor_text": "You are charged with the defence of a key objective. It must not be permitted to fall into enemy hands."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "dedc9209-89bb-4968-a208-05380e27e76c",
      "main_desc": "In your Shooting phasem you can select one unit from your army that is not Battle-shocked and is eligible to shoot.  Unitl the end of your turn, that unit is not eligible to shoot or declare a charge.\\\n\\\nAt the end of your turn, if that unit is within your opponent's deployment zone, or within 6\" of the centre of the battlefield, it deploys a teleport homer at that location, this Secondary mission is achieved and you score a number of VP depending on where the teleport homer was deployed, as follows: - Centre of battlefield = 2VP if you are using Fixed Missions, or 3VP if you are using Tactical Missions. - Opponent's deployment zone = 4VP if you are using Fixed Missions, or 5VP if you are using Tactical Missions.",
      "callouts": [],
      "rule_type": "SECONDARY MISSION",
      "rule_subtype": "ATTACKER",
      "name": "DEPLOY TELEPORT HOMER",
      "flavor_text": "An allied fleet approaches ready to launch a full-scale invasion of this planet.  If our vanguard forces deploy a series of teleport homers and landing beavons deep within enemy territory, troops aboard our ships will be able to launch a deadly surprise assault from orbit."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "29330e88-1705-4df0-94b8-ec2fe5b26376",
      "main_desc": "At the end of your turn, if you have one or more qualifying units (see below) from your army wholly within three or more different table quarters, and those units are all more than 3\" away from any other table quarter, this Secondary Mission is achieved and you score 4VP if you have qualifying units in four different table quarters, or 2VP if you have qualifying units in three different table quarters.\\\n\\\nWhile a unit is s Battle-shocked, it is not a qualifying unit.\\\n\\\nIf, when you draw this Secondary Mission card, you only have onr or two qualifying units remaining in your army, you can discard this Secondary Mission card and draw a new Secondary Mission card.\\\n\\\nIf you are using Tactical Missions, then when this Secondary Mission is achieved you score an extra 1VP (for a maximum of 5VP).",
      "callouts": [],
      "rule_type": "SECONDARY MISSION",
      "rule_subtype": "ATTACKER",
      "name": "ENGAGE ON ALL FRONTS",
      "flavor_text": "This area is of extreme importance. You are to lead an immediate all-out assault to capture it and deny It to our enemy for good."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "1b8f7577-ce5e-4a2e-8b7d-0f36a6adb1d6",
      "main_desc": "At the end of your turn, if you control one or more objective markers in your own deployment zone and you also control one or more objective markers in No Man's Land, this Secondary Mission is achieved and you score 5VP.\\\n\\\nIf you only have one unit remaining in your army, then this Secondary Mission is instead achieved at the end of your turn if that unit controls one objective marker in No Man's Land, but in this instance you score 2VP instead of 5VP.",
      "callouts": [],
      "rule_type": "SECONDARY MISSION",
      "rule_subtype": "ATTACKER",
      "name": "EXTEND BATTLE LINES",
      "flavor_text": "The battleground is won one yard at a time. Continue to establish a strong military presence in the area."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "562e4f4b-5791-4987-a006-af24882ed4bc",
      "main_desc": "In your Shooting phase, you can select one or more units from your army that are not Battle-shocked and are eligible to shoot. Until the end of your turn, the units you selected are not eligible to shoot or declare a charge.\\\n\\\nAt the end of your turn, each corner of the battlefield that has one or more of these selected units wholly within 9\" of it is scanned by your army.\\\n\\\nIf one or more corners are scanned by your army, this Secondary Mission is achieved and you score 2VP for each corner scanned by your army this turn.",
      "callouts": [],
      "rule_type": "SECONDARY MISSION",
      "rule_subtype": "ATTACKER",
      "name": "INVESTIGATE SIGNALS",
      "flavor_text": "Our fleet has received a mysterious signal in this war zone, and its source has been identified as originating somewhere in the vicinity of this battlefield. Locate and secure it without delay."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "fd18cf6e-2098-4d25-b028-4ce8588b84a0",
      "main_desc": "While this Secondary Mission is active, each time an enemy unit is destroyed, you score 2VP (to a maximum of 5VP).\\\n\\\nNote that VP are scored even if such a unit is destroyed and then subsequently resurrected for any reason.  If you score any VP from this Secondary Mission during a turn, then at the end of that turn this Secondary Mission is achieved.",
      "callouts": [],
      "rule_type": "SECONDARY MISSION",
      "rule_subtype": "ATTACKER",
      "name": "NO PRISONERS",
      "flavor_text": "Exterminate your enemies."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "22187f55-cfe9-480e-ac5e-592b025b0f49",
      "main_desc": "While this Secondary Mission is active, each time an enemy unit that started the turn within range of an objecttive marker is destroyed, you score 3VP (to a maximum of 5VP).\\\n\\\nNote that VP are scored even if such a unit is destroyed and then subsequently resurrected for any reason. If you score any VP from this Secondary Mission during a turn, then at the end of that turn this Secondary Mission is achieved.",
      "callouts": [],
      "rule_type": "SECONDARY MISSION",
      "rule_subtype": "ATTACKER",
      "name": "OVERWHELMING FORCE",
      "flavor_text": "Scour the enemy frm the face of the battlefield."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "69d7eb6d-07d5-48de-ad19-7c771961cee1",
      "main_desc": "At the end of your turn, if you control two or more objective markers in No Man's Land, this Secondary Mission is achieved and you score 5VP.\\\n\\\nIf, at the end of your turn, you only control one objective marker in No Man's Land, this Secondar Mission is still achieved, but in this instance you score 2VP instead of 5VP.",
      "callouts": [],
      "rule_type": "SECONDARY MISSION",
      "rule_subtype": "ATTACKER",
      "name": "SECURE NO MAN'S LAND",
      "flavor_text": "You must advance swiftly into no man's land and seize it before the enemy can, lest they take control of the entire battlefield."
    },
    {
      "faction_id": "basic",
      "faction_name": "basic",
      "faction_type": "basic",
      "source": "leviathan",
      "id": "a651aef6-6e69-4404-835e-f02d9aefb1f6",
      "main_desc": "At the end of your turn, if either of the below conditions are satisfied, this Secondary Mission is achieved and you score 4VP if you are using Fixed Missions, or 5VP if you are using Tactical Missions: - You control one or more objective markers that were controlled by your opponent at the start of your turn. - Your opponent did not control any objective markers at the start of your turn and you control one or more objective markers that you did not control at the start of your turn.\\\n\\\nThis Secondary Mission cannot be achieved during the first battle round; if you randomly drew this Secondary Mission card during the first battle round, draw a new Secondary Mission card and shuffle this Secondary Mission card back into your Secondary Mission deck.",
      "callouts": [],
      "rule_type": "SECONDARY MISSION",
      "rule_subtype": "ATTACKER",
      "name": "STORM HOSTILE OBJECTIVE",
      "flavor_text": "Dominate the field of battle. Storm every site of tactical import and leave the foe with no place to hide."
    }
  ],
  "stratagems": [
    {
      "name": "COMMAND RE-ROLL",
      "cost": 1,
      "type": "Battle Tactic",
      "detachment": "core",
      "turn": "either",
      "phase": ["any"],
      "fluff": "A great commander can bend even the vagaries of fate and fortune to their will, the better to ensure victory",
      "when": "In any phase, just after you have made a Hit',\nroll, a Wound roll, a Damage roll, a saving throw, an\nAdvance roll, a Charge roll, a Desperate Escape test,\na Hazardous test, or just after you have rolled the\ndice to determine the number of attacks made with a\nweapon, for an attack, model or unit from your army.",
      "target": "",
      "effect": "You re-roll that roll, test or saving throw.",
      "restrictions": "",
      "id": "2ee52865-5268-522f-b045-740a81572d57"
    },
    {
      "name": "COUNTER-OFFENSIVE",
      "cost": 2,
      "type": "Strategic Ploy",
      "detachment": "core",
      "turn": "either",
      "phase": ["fight"],
      "fluff": "In close-quarters combat, the slightest hesitation\ncan leave an opening for a swift foe to exploit. ",
      "when": "Fight phase, just after an enemy unit\nhas fought.",
      "target": "One unit from your army that is within\nEngagement Range of one or more enemy units\nand that has not already been selected to fight\nthis phase.",
      "effect": "Your unit fights next.",
      "restrictions": "",
      "id": "f5908f27-4d5b-5c64-8299-5880069e8018"
    },
    {
      "name": "EPIC CHALLENGE",
      "cost": 1,
      "type": "Epic Deed",
      "detachment": "core",
      "turn": "either",
      "phase": ["fight"],
      "fluff": "The legends of the 41st Millennium are replete with\ndeadly duels between mighty champions.",
      "when": "Fight phase, when a Character unit from\nyour army that is within Engagement Range of one or\nmore Attached units is selected to fight.",
      "target": "One Character model in your unit.",
      "effect": "Until the end of the phase, all melee\nattacks made by that model have the [PRECISION]\nability (pg 26).",
      "restrictions": "",
      "id": "e7d19f46-b075-55de-9874-74b8d1593cea"
    },
    {
      "name": "INSANE BRAVERY",
      "cost": 1,
      "type": "Battle Tactic",
      "detachment": "core",
      "turn": "your",
      "phase": ["command"],
      "fluff": "Indifferent to their own survival, these warriors hold\ntheir ground against seemingly impossible odds.",
      "when": "Battle-shock step of your Command\nphase, just before you take a Battle-shock test\nfor a unit from your army (pg 11).",
      "target": " A unit from your army that must take a\nBattle-shock test.",
      "effect": "Your unit automatically passes that\nBattle-shock test.",
      "restrictions": "You cannot use this Stratagem\nmore than once per battle.",
      "id": "230c3f96-8581-5d41-97be-8d55496b13e7"
    },
    {
      "name": "GRENADE",
      "cost": 1,
      "type": "Wargear",
      "detachment": "core",
      "turn": "your",
      "phase": ["shooting"],
      "fluff": "Priming their hand-held projectiles, these warriors\ndraw back and hurl death into the enemy’s midst.",
      "when": "Your Shooting phase.",
      "target": "One Grenades unit from your army that is\nnot within Engagement Range of any enemy units\nand has not been selected to shoot this phase.",
      "effect": "Select one enemy unit that is not within\nEngagement Range of any units from your army and\nis within 8\" of and visible to your Grenades unit.\nRoll six D6: for each 4+, that enemy unit suffers 1\nmortal wound.",
      "restrictions": "",
      "id": "e3af3923-1385-59b8-adc2-a912d3120de6"
    },
    {
      "name": "TANK SHOCK",
      "cost": 1,
      "type": "Strategic Ploy",
      "detachment": "core",
      "turn": "your",
      "phase": ["charge"],
      "fluff": "Ramming the foe with a speeding vehicle may be an\nunsubtle tactic, but it is a murderously effective one.",
      "when": "Your Charge phase.",
      "target": "One Vehicle unit from your army.",
      "effect": "Until the end of the phase, after your unit\nends a Charge move, select one enemy unit within\nEngagement Range of it, then select one melee\nweapon your unit is equipped with. Roll a number of\nD6 equal to that weapon’s Strength characteristic.\nIf that Strength characteristic is greater than that\nenemy unit’s Toughness characteristic, roll two\nadditional D6. For each 5+, that enemy unit suffers 1\nmortal wound (to a maximum of 6 mortal wounds).",
      "restrictions": "",
      "id": "2de99851-208c-5581-8574-a0cec6c5d903"
    },
    {
      "name": "RAPID INGRESS",
      "cost": 1,
      "type": "Strategic Ploy",
      "detachment": "core",
      "turn": "opponents",
      "phase": ["movement"],
      "fluff": "Be it cunning strategy, potent technology or\nsupernatural ritual, there are many means by which a\ncommander may hasten their warriors’ onset.",
      "when": "End of your opponent’s Movement phase.",
      "target": "One unit from your army that is in Reserves.",
      "effect": "Your unit can arrive on the battlefield\nas if it were the Reinforcements step of your\nMovement phase.",
      "restrictions": "You cannot use this Stratagem to\nenable a unit to arrive on the battlefield during a\nbattle round it would not normally be able to do so in.",
      "id": "61b330a3-1826-5bfc-b9af-d4e8e47a4256"
    },
    {
      "name": "FIRE OVERWATCH",
      "cost": 1,
      "type": "Strategic Ploy",
      "detachment": "core",
      "turn": "opponents",
      "phase": ["movement", "charge"],
      "fluff": "A hail of wildfire can drive back advancing foes.",
      "when": "Your opponent’s Movement or Charge phase,\njust after an enemy unit is set up or when an enemy\nunit starts or ends a Normal, Advance, Fall Back or\nCharge move.",
      "target": "One unit from your army that is within 24\" of\nthat enemy unit and that would be eligible to shoot if\nit were your Shooting phase.",
      "effect": "If that enemy unit is visible to your unit, your unit can shoot that enemy unit as if it were your Shooting phase.",
      "restrictions": "You cannot target a Titanic unit\nwith this Stratagem. Until the end of the phase,\neach time a model in your unit makes a ranged\nattack, an unmodified Hit roll of 6 is required\nto score a hit, irrespective of the attacking\nweapon’s Ballistic Skill or any modifiers. You can\nonly use this Stratagem once per turn.",
      "id": "beb8e7a5-9739-5a79-bc57-09712b9a605d"
    },
    {
      "name": "GO TO GROUND",
      "cost": 1,
      "type": "Battle Tactic",
      "detachment": "core",
      "turn": "opponents",
      "phase": ["shooting"],
      "fluff": "Seeking salvation from incoming fire, warriors hurl\nthemselves into whatever cover they can find.",
      "when": "Your opponent’s Shooting phase, just after an\nenemy unit has selected its targets.",
      "target": "One Infantry unit from your army that was\nselected as the target of one or more of the attacking\nunit’s attacks.",
      "effect": "Until the end of the phase, all models in\nyour unit have a 6+ invulnerable save and have the\nBenefit of Cover (pg 44).",
      "restrictions": "",
      "id": "e6b63d61-a863-5f08-a125-e12964aa704f"
    },
    {
      "name": "SMOKESCREEN",
      "cost": 1,
      "type": "Wargear",
      "detachment": "core",
      "turn": "opponents",
      "phase": ["shooting"],
      "fluff": "Even the most skilled marksmen struggle to hit targets\nveiled by billowing screens of smoke.",
      "when": "Your opponent’s Shooting phase, just after an\nenemy unit has selected its targets.",
      "target": "One Smoke unit from your army that was\nselected as the target of one or more of the attacking\nunit’s attacks.",
      "effect": "Until the end of the phase, all models in your\nunit have the Benefit of Cover (pg 44) and the Stealth\nability (pg 20).",
      "restrictions": "",
      "id": "29208c5c-5b26-5a74-9f4e-accc555f1a8a"
    },
    {
      "name": "HEROIC INTERVENTION",
      "cost": 2,
      "type": "Strategic Ploy",
      "detachment": "core",
      "turn": "opponents",
      "phase": ["charge"],
      "fluff": "Voices raised in furious war cries, your warriors surge\nforth to meet the enemy’s onslaught head-on.",
      "when": "Your opponent’s Charge phase, just after an\nenemy unit ends a Charge move.",
      "target": "One unit from your army that is within 6\"\nof that enemy unit and would be eligible to declare\na charge against that enemy unit if it were your\nCharge phase.",
      "effect": "Your unit now declares a charge that targets\nonly that enemy unit, and you resolve that charge as\nif it were your Charge phase.",
      "restrictions": "You can only select a Vehicle unit\nfrom your army if it is a Walker. Note that even if\nthis charge is successful, your unit does not receive\nany Charge bonus this turn (pg 29).",
      "id": "bbb0819c-de45-5c1e-b4d0-aec9eb891e2c"
    }
  ]
}
