[
  {
    "faction_id": "CHBT",
    "enhancements": [
      {
        "name": "PERDITION’S EDGE",
        "description": "■ Improve the Strength and Armour Penetration characteristics of the bearer’s melee weapons by 1. ■ If the Suffer Not the Unclean to Live vow is active for your army, add 1 to the Attacks characteristic of the bearer’s melee weapons as well.",
        "keywords": ["Adeptus Astartes"],
        "cost": "15"
      },
      {
        "name": "SIGISMUND’S SEAL",
        "description": "■ Improve the Attacks characteristic of the bearer’s melee weapons by 1. ■ While the bearer is leading a unit, if the Accept Any Challenge, No Matter the Odds vow is active for your army, each time a model in that unit makes a melee attack, a successful unmodified Hit roll of 5+ scores a Critical Hit.",
        "keywords": ["Adeptus Astartes"],
        "cost": "20"
      },
      {
        "name": "TÄNNHAUSER’S BONES",
        "description": "■ Each time an attack is allocated to the bearer, halve the Damage characteristic of that attack. ■ While the bearer is leading a unit, if the Uphold the Honour of the Emperor vow is active for your army, models in that unit have the Feel No Pain 5+ ability.",
        "keywords": ["Adeptus Astartes"],
        "cost": "35"
      },
      {
        "name": "WITCHSEEKER BOLTS",
        "description": "■ The bearer’s ranged weapons have the [PRECISION], [ANTI-PSYKER 4+] and [DEVASTATING WOUNDS] abilities. ■ If the Abhor the Witch, Destroy the Witch vow is active for your army, each time the bearer makes a ranged attack that targets a Psyker unit, you can re-roll the Hit roll and you can re-roll the Wound roll.",
        "keywords": ["Adeptus Astartes"],
        "cost": "10"
      }
    ]
  },
  {
    "faction_id": "WE",
    "enhancements": [
      {
        "name": "Battle-lust",
        "description": " World Eaters model only. You can select the bearer’s unit for the Heroic Intervention Stratagem for  0CP, and can do so even if you have already targeted a different unit with that Stratagem this phase.",
        "keywords": ["World Eaters"],
        "excludes": [],
        "cost": "15"
      },
      {
        "name": "Berzerker Glaive",
        "description": "World Eaters model only. Add 1 to the Attacks and Damage characteristics of melee weapons equipped by the bearer. Each time the bearer ends a Charge move, roll one D3; until the end of the turn, add the result of that roll to the Attacks and Damage characteristics of those melee weapons instead.",
        "keywords": ["World Eaters"],
        "excludes": [],
        "cost": "25"
      },
      {
        "name": "Favoured of Khorne",
        "description": "World Eaters model only. Each time you make a Blessings of Khorne roll, before doing anything else, the bearer can use this Enhancement. If it does, discard all of the dice from that roll and make a new Blessings of Khorne roll. This new roll does not count as a re-roll, so any rules that enable you to re-roll or manipulate individual dice (e.g. Icon of Khorne) can still be used.",
        "keywords": ["World Eaters"],
        "excludes": [],
        "cost": "30"
      },
      {
        "name": "Helm of Brazen Ire",
        "description": "World Eaters model only. Each time an attack  is allocated to the bearer, halve the Damage characteristic of that attack.",
        "keywords": ["World Eaters"],
        "excludes": [],
        "cost": "25"
      }
    ]
  },
  {
    "faction_id": "TS",
    "enhancements": [
      {
        "name": "Arcane Vortex",
        "description": "Thousand Sons model only. Add 1 to the Strength and Damage characteristics of Psychic weapons equipped by the bearer.",
        "keywords": ["Thousand Sons"],
        "excludes": [],
        "cost": "15"
      },
      {
        "name": "Athenaean Scrolls",
        "description": "Thousand Sons Psyker model only. In your Command phase, if the bearer is on the battlefield and is not Battle-shocked, it generates you 1 additional Cabal point this phase.",
        "keywords": ["Thousand Sons", "Psyker"],
        "excludes": [],
        "cost": "20"
      },
      {
        "name": "Lord of Forbidden Lore",
        "description": "Thousand Sons Psyker model only. The bearer can be selected to use a Ritual even if another Psyker from your army has already been selected to use that Ritual this phase.",
        "keywords": ["Thousand Sons", "Psyker"],
        "excludes": [],
        "cost": "25"
      },
      {
        "name": "Umbralefic Crystal",
        "description": "Thousand Sons model only. Once per battle, in your Command phase, you can remove the bearer’s unit from the battlefield. If you do, in the Reinforcements step of your next Movement phase, set that unit back up anywhere on the battlefield that is more than 9\" horizontally away from all enemy models.",
        "keywords": ["Thousand Sons"],
        "excludes": [],
        "cost": "20"
      }
    ]
  },
  {
    "faction_id": "TYR",
    "enhancements": [
      {
        "name": "Adaptive Biology",
        "description": "Tyranids model only. The bearer has the Feel No Pain 5+ ability. At the start of any turn, if the bearer has fewer than its starting number of wounds remaining, until the end of the battle, it has the Feel No Pain 4+ ability instead.",
        "keywords": ["Tyranids"],
        "excludes": [],
        "cost": "25"
      },
      {
        "name": "Alien Cunning",
        "description": "Tyranids model only. After both players have deployed their armies, select up to three Tyranids units from your army and redeploy them. When doing so, you can set those units up in Strategic Reserves if you wish, regardless of how many units are already in Strategic Reserves.",
        "keywords": ["Tyranids"],
        "excludes": [],
        "cost": "30"
      },
      {
        "name": "Perfectly Adapted",
        "description": "Tyranids model only. Once per turn, you can re-roll one Hit roll, one Wound roll, one Damage roll, one Advance roll, one Charge roll or one saving throw made for the bearer.",
        "keywords": ["Tyranids"],
        "excludes": [],
        "cost": "15"
      },
      {
        "name": "Synaptic Linchpin",
        "description": "Tyranids model only. While a friendly Tyranids unit is within 9\" of the bearer, that unit is within Synapse Range of your army.",
        "keywords": ["Tyranids"],
        "excludes": [],
        "cost": "10"
      }
    ]
  },
  {
    "faction_id": "TAU",
    "enhancements": [
      {
        "name": "Exemplar of the Kauyon",
        "description": "T’au Empire model only (excluding Kroot Shaper models). While the bearer is leading a unit, that unit’s Kauyon Detachment rule takes effect from the second battle round onwards instead of the third.",
        "keywords": ["T’au Empire"],
        "excludes": ["Kroot Shaper"],
        "cost": "15"
      },
      {
        "name": "Precision of the Patient Hunter",
        "description": "T’au Empire model only. Each time the bearer makes a ranged attack, add 1 to the Hit roll. From the third battle round onwards, add 1 to the Wound roll as well.",
        "keywords": ["T’au Empire"],
        "excludes": [],
        "cost": "20"
      },
      {
        "name": "Puretide Engram Neurochip",
        "description": "T’au Empire model only (excluding Kroot Shaper models). Once per turn, you can use a Stratagem on the bearer’s unit, even if you have already used that Stratagem on a different unit this phase.",
        "keywords": ["T’au Empire"],
        "excludes": ["Kroot Shaper"],
        "cost": "25"
      },
      {
        "name": "Through Unity, Devastation",
        "description": "T’au Empire model only (excluding Kroot Shaper models). While this model is leading a unit, each time that unit is an Observer unit, until the end of the phase, ranged weapons equipped by models in their Guided unit have the [LETHAL HITS] ability while targeting their Spotted unit.",
        "keywords": ["T’au Empire"],
        "excludes": ["Kroot Shaper"],
        "cost": "20"
      }
    ]
  },
  {
    "faction_id": "CHSW",
    "enhancements": [
      {
        "name": "BLACK DEATH",
        "description": "Adeptus Astartes model only. The bearer’s melee weapons have the [ANTI-MONSTER 4+] and [ANTI-VEHICLE 4+] abilities.",
        "keywords": ["Adeptus Astartes"],
        "excludes": [],
        "cost": "25"
      },
      {
        "name": "FROST WEAPON",
        "description": "Adeptus Astartes model only. The bearer’s melee weapons have the [PRECISION] ability, and the Strength and Armour Penetration characteristics of those weapons are improved by 1.",
        "keywords": ["Adeptus Astartes"],
        "excludes": [],
        "cost": "15"
      },
      {
        "name": "THE PELT OF BALEWOLF",
        "description": "Adeptus Astartes model only. At the start of the Fight phase, each enemy unit within Engagement Range of the bearer must take a Battle-shock test.",
        "keywords": ["Adeptus Astartes"],
        "excludes": [],
        "cost": "10"
      },
      {
        "name": "WOLF TAIL TALISMAN",
        "description": "Adeptus Astartes model only. Each time an attack is allocated to the bearer, subtract 1 from the Damage characteristic of that attack.",
        "keywords": ["Adeptus Astartes"],
        "excludes": [],
        "cost": "20"
      }
    ]
  },
  {
    "faction_id": "SM",
    "enhancements": [
      {
        "name": "ADEPT OF THE CODEX",
        "description": "Captain model only. At the start of your Command phase, if the bearer is on the battlefield, instead of selecting a Combat Doctrine to be active for your army, you can select the Tactical Doctrine. If you do, until the start of your next Command phase, that doctrine is active for the bearer’s unit only, even if you have already selected that doctrine to be active for your army this battle.",
        "keywords": ["Captain"],
        "excludes": [],
        "cost": "20"
      },
      {
        "name": "ARTIFICER ARMOUR",
        "description": "Adeptus Astartes model only. The bearer has a Save characteristic of 2+ and the Feel No Pain 5+ ability.",
        "keywords": ["Adeptus Astartes"],
        "excludes": [],
        "cost": "10"
      },
      {
        "name": "BOLTER DISCIPLINE",
        "description": "Adeptus Astartes model only. While the bearer is leading a unit, ranged weapons equipped by models in that unit have the [SUSTAINED HITS 1] ability. In addition, while the bearer’s unit is under the effects of the Devastator Doctrine, each time a model in that unit makes a ranged attack, a successful unmodified Hit roll of 5+ scores a Critical Hit.",
        "keywords": ["Adeptus Astartes"],
        "excludes": [],
        "cost": "25"
      },
      {
        "name": "THE HONOUR VEHEMENT",
        "description": "Adeptus Astartes model only. Add 1 to the Attacks and Strength characteristics of the bearer’s melee weapons. While the bearer is under the effects of the Assault Doctrine, add 2 to the Attacks and Strength characteristics of the bearer’s melee weapons instead.",
        "keywords": ["Adeptus Astartes"],
        "excludes": [],
        "cost": "15"
      }
    ]
  },
  {
    "faction_id": "ORK",
    "enhancements": [
      {
        "name": "FOLLOW ME LADZ",
        "description": "Orks model only. While the bearer is leading a unit, add 2\" to the Move characteristic of models in that unit.",
        "keywords": ["Orks"],
        "excludes": [],
        "cost": "25"
      },
      {
        "name": "HEADWOPPA’S KILLCHOPPA",
        "description": "Orks model only. Melee weapons equipped by the bearer that do not have the [EXTRA ATTACKS] ability have the [DEVASTATING WOUNDS] ability.",
        "keywords": ["Orks"],
        "excludes": [],
        "cost": "20"
      },
      {
        "name": "KUNNIN’ BUT BRUTAL",
        "description": "Orks model only. While the bearer is leading a unit, that unit is eligible to shoot and declare a charge in a turn in which it Fell Back.",
        "keywords": ["Orks"],
        "excludes": [],
        "cost": "15"
      },
      {
        "name": "SUPA-CYBORK BODY",
        "description": "Orks model only. The bearer has the Feel No Pain 4+ ability.",
        "keywords": ["Orks"],
        "excludes": [],
        "cost": "15"
      }
    ]
  },
  {
    "faction_id": "NEC",
    "enhancements": [
      {
        "name": "VEIL OF DARKNESS",
        "description": "Necrons model only. Once per battle, at the end of your opponent’s turn, if the bearer’s unit is not within Engagement Range of any enemy units, the bearer can use this Enhancement. If it does, remove that unit from the battlefield. Then, in the Reinforcements step of your next Movement phase, set up that unit anywhere on the battlefield that is more than 9\" horizontally away from all enemy models.",
        "keywords": ["Necrons"],
        "excludes": [],
        "cost": "20"
      },
      {
        "name": "HYPERMATERIAL ABLATOR",
        "description": "Necrons model only. While the bearer is leading a unit, models in that unit have the Stealth ability. In addition, each time a ranged attack targets the bearer’s unit, if the attacker is not within 12\", models in that unit have the Benefit of Cover.",
        "keywords": ["Necrons"],
        "excludes": [],
        "cost": "25"
      },
      {
        "name": "THE SOVEREIGN CORONAL (AURA)",
        "description": "Necrons model only. While a friendly Necrons unit is within 6\" of the bearer, that unit counts as being led by a Necrons Character model.\n\nDesigner’s Note: This means that units within range of this Aura ability will benefit from the Command Protocols ability and will count as containing a Character for the purposes of any Awakened Dynasty Stratagems.",
        "keywords": ["Necrons"],
        "excludes": [],
        "cost": "30"
      },
      {
        "name": "SEMPITERNAL WEAVE",
        "description": "Necrons model only. The bearer has the Feel No Pain 4+ ability.",
        "keywords": ["Necrons"],
        "excludes": [],
        "cost": "10"
      }
    ]
  },
  {
    "faction_id": "LoV",
    "enhancements": [
      {
        "name": "APPRAISING GLARE",
        "description": "Leagues of Votann model only. In your Command phase, you can select one objective marker your opponent controls. Until the end of the phase, while an enemy unit is within range of that objective marker, it counts as having one more Judgement token than it actually has (to a maximum of 2).",
        "keywords": ["Leagues of Votann"],
        "excludes": [],
        "cost": "20"
      },
      {
        "name": "A LONG LIST",
        "description": "Leagues of Votann model only. Each time the bearer’s unit destroys an enemy unit, if that enemy unit has one or more Judgement tokens, you can select one other enemy unit that is visible to the bearer. That other unit gains one Judgement token.",
        "keywords": ["Leagues of Votann"],
        "excludes": [],
        "cost": "15"
      },
      {
        "name": "GRIM DEMEANOUR",
        "description": "Leagues of Votann model only. You can re-roll Battle-shock tests taken for the bearer’s unit, and models in that unit can ignore any or all modifiers to their characteristics and/or to any rolls or tests made for them (excluding modifiers to saving throws).",
        "keywords": ["Leagues of Votann"],
        "excludes": [],
        "cost": "20"
      },
      {
        "name": "WAYFARER’S GRACE",
        "description": "Leagues of Votann model only. The first time the bearer is destroyed, after placing a Judgement token next to the unit that destroyed it, roll one D6 at the end of the phase. On a 2+, set the bearer back up on the battlefield as close as possible to where it was destroyed and not within Engagement Range of any enemy units, with its full wounds remaining.",
        "keywords": ["Leagues of Votann"],
        "excludes": [],
        "cost": "25"
      }
    ]
  },
  {
    "faction_id": "GK",
    "enhancements": [
      {
        "name": "First to the Fray",
        "description": "Grey Knights model with the Deep Strike ability only. The bearer’s unit must start the battle in Reserves, but neither it, nor any Transport it is embarked within, is counted towards any limits the mission places on the number of Strategic Reserves units you can have. That unit can be set up using its Deep Strike ability in the Reinforcements step of your first, second or third Movement phase, regardless of any mission rules.",
        "keywords": ["Grey Knights", "Deep Strike"],
        "excludes": [],
        "cost": "35"
      },
      {
        "name": "Domina Liber Daemonica",
        "description": "Grey Knights model only. Each time the bearer makes a melee attack add 1 to the Wound roll and, if that attack targets a Daemon unit, add 1 to the Damage characteristic of that attack as well.",
        "keywords": ["Grey Knights"],
        "excludes": [],
        "cost": "20"
      },
      {
        "name": "Sigil of Exigence",
        "description": "Grey Knights model only. Once per battle, in your opponent’s Shooting phase, when the bearer’s unit is selected as the target of a ranged attack, you can remove the bearer’s unit from the battlefield and then set it back up again anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If the bearer is no longer an eligible target, your opponent can then select new targets for any attacks that had targeted the bearer’s unit.",
        "keywords": ["Grey Knights"],
        "excludes": [],
        "cost": "30"
      },
      {
        "name": "Inescapable Wrath",
        "description": "Grey Knights model only. Add 1 to Charge rolls made for the bearer’s unit.",
        "keywords": ["Grey Knights"],
        "excludes": [],
        "cost": "15"
      }
    ]
  },
  {
    "faction_id": "GSC",
    "enhancements": [
      {
        "name": "Prowling Agitant",
        "description": "Genestealer Cults model only. Once per turn, when an enemy unit ends a Normal, Advance or Fall Back move within 9\" of the bearer’s unit, if the bearer’s unit is not within Engagement Range of any enemy units, it can make a Normal move of up to D6\".",
        "keywords": ["Genestealer Cults"],
        "excludes": [],
        "cost": "15"
      },
      {
        "name": "Inscrutable Cunning",
        "description": "Genestealer Cults model only. While the bearer is leading a unit, models in that unit have the Infiltrators ability and each time you select that unit as the target of a Stratagem, roll one D6: on a 4+, you gain 1CP.",
        "keywords": ["Genestealer Cults"],
        "excludes": [],
        "cost": "30"
      },
      {
        "name": "Meticulous Planner",
        "description": "Genestealer Cults model only. Once per battle, just after your opponent uses a Stratagem, if the bearer is on the battlefield, it can use this ability. If it does, until the end of the battle, the CP cost your opponent must pay to use that Stratagem again is increased by 1CP.",
        "keywords": ["Genestealer Cults"],
        "excludes": [],
        "cost": "40"
      },
      {
        "name": "Focus of Adoration",
        "description": "Genestealer Cults model only. While the bearer is leading a unit, you can target that unit with the Heroic Intervention Stratagem for 0CP, and can do so even if you have already targeted a different unit with that Stratagem this phase.",
        "keywords": ["Genestealer Cults"],
        "excludes": [],
        "cost": "10"
      }
    ]
  },
  {
    "faction_id": "DRU",
    "enhancements": [
      {
        "name": "Crucible of Malediction",
        "description": "Haemonculus model only. Once per battle, at the start of any Shooting phase, the bearer can use this Enhancement. When it does, every enemy unit within 12\" must take a Battle-shock test, subtracting 1 from that test if the bearer’s unit is currently Empowered. Each time a Psyker unit fails this test, it suffers D3 mortal wounds.",
        "keywords": ["Haemonculus"],
        "excludes": [],
        "cost": "10"
      },
      {
        "name": "Labyrinthine Cunning",
        "description": "Archon model only. Each time you select the bearer’s unit as the target of a Stratagem, roll one D6, adding 3 to the result if the Stratagem being used is Alliance of Agony. On a 4+, you gain 1 Command Point.",
        "keywords": ["Archon"],
        "excludes": [],
        "cost": "30"
      },
      {
        "name": "Blood Dancer",
        "description": "Succubus model only. Improve the Attacks and Armour Penetration characteristics of the bearer’s melee weapons by 1. While the bearer is Empowered, improve the Attacks and Armour Penetration characteristics of the bearer’s melee weapons by 2 instead.",
        "keywords": ["Succubus"],
        "excludes": [],
        "cost": "20"
      },
      {
        "name": "The Art of Pain",
        "description": "Drukhari model only. In your Command phase, if the bearer is on the battlefield, you gain 1 Pain token.",
        "keywords": ["Drukhari"],
        "excludes": [],
        "cost": "25"
      }
    ]
  },
  {
    "faction_id": "CHDW",
    "enhancements": [
      {
        "name": "Thief of Secrets",
        "description": "Adeptus Astartes model only. Improve the Strength, Damage, and Armour Penetration characteristics of the bearer’s melee weapons by 1. If an enemy model is destroyed as the result of a melee attack made by the bearer, at the end of that phase, until the end of the battle, improve the Strength, Damage, and Armour Penetration characteristics of the bearer’s melee weapons by 2 instead.",
        "keywords": ["Adeptus Astartes"],
        "excludes": [],
        "cost": "15"
      },
      {
        "name": "Osseus Key",
        "description": "Watch Master or Techmarine model only. At the start of your opponent’s Shooting phase, select one enemy Vehicle unit (excluding Titanic units) within 12\" of and visible to the bearer. That model must take a Leadership test. If that test is passed, until the end of the phase, each time a model in that unit makes an attack, subtract 1 from the Hit roll; if that test is failed, that unit is not eligible to shoot this phase.",
        "keywords": ["Watch Master", "Techmarine"],
        "excludes": [],
        "cost": "20"
      },
      {
        "name": "Beacon Angelis",
        "description": "Adeptus Astartes model only. Models in the bearer’s unit have the Deep Strike ability. In addition, you can target the bearer’s unit with the Rapid Ingress Stratagem for 0CP.",
        "keywords": ["Adeptus Astartes"],
        "excludes": [],
        "cost": "30"
      },
      {
        "name": "The Tome of Ectoclades",
        "description": "Watch Master or Captain model only. Once per battle, after you have selected an enemy unit using the Oath of Moment ability in your Command phase, the bearer can use this Enhancement if they are on the battlefield. When they do, select a second enemy unit – until the start of your next Command phase, each time an Adeptus Astartes model from your army makes an attack that targets either of those enemy units, you can re-roll the Hit roll and you can re-roll the Wound roll.",
        "keywords": ["Watch Master", "Captain"],
        "excludes": [],
        "cost": "40"
      }
    ]
  },
  {
    "faction_id": "DG",
    "enhancements": [
      {
        "name": "Living Plague",
        "description": "Death Guard model only. Add 3\" to the range of the bearer’s Aura abilities (including Nurgle’s Gift).",
        "keywords": ["Death Guard"],
        "excludes": [],
        "cost": "20"
      },
      {
        "name": "The Droning (Aura)",
        "description": "Death Guard model only. While an enemy unit is within Contagion Range of the bearer, each time that unit fails a Battle-shock test, roll one D6: on a 2-5, that unit suffers 1 mortal wound; on a 6, that unit suffers D3 mortal wounds.",
        "keywords": ["Death Guard"],
        "excludes": [],
        "cost": "10"
      },
      {
        "name": "Deadly Pathogen",
        "description": "Death Guard model only. Add 1 to the Strength and Attacks characteristics of the bearer’s melee weapons. While the bearer is within range of an Infected objective marker you control, add 2 to the Strength and Attacks characteristics of the bearer’s melee weapons instead.",
        "keywords": ["Death Guard"],
        "excludes": [],
        "cost": "15"
      },
      {
        "name": "Shamblerot",
        "description": "Death Guard model only. Each time the bearer’s unit is selected as a target of an enemy unit’s charge, until the end of the phase, subtract 2 from Charge rolls made for that enemy unit.",
        "keywords": ["Death Guard"],
        "excludes": [],
        "cost": "25"
      }
    ]
  },
  {
    "faction_id": "CHDA",
    "enhancements": [
      {
        "name": "Shroud of Heroes",
        "description": "Adeptus Astartes model only. The first time the bearer is destroyed, roll one D6 at the end of the phase. On a 2+, set the bearer back up on the battlefield as close as possible to where it was destroyed and not within Engagement Range of any enemy units, with 3 wounds remaining (if the bearer was Battle-shocked when it was destroyed, it is instead returned with its full wounds remaining).",
        "keywords": ["Adeptus Astartes"],
        "excludes": [],
        "cost": "25"
      },
      {
        "name": "Stubborn Tenacity",
        "description": "Adeptus Astartes model only. While the bearer is leading a unit, each time a model in that unit makes an attack, add 1 to the Hit roll if the bearer’s unit is below its Starting Strength, and add 1 to the Wound roll as well if the bearer’s unit is Battle-shocked.",
        "keywords": ["Adeptus Astartes"],
        "excludes": [],
        "cost": "15"
      },
      {
        "name": "Heavenfall Blade",
        "description": "Adeptus Astartes model only. Add 1 to the Attacks, Strength, and Damage characteristics of the bearer’s melee weapons. While the bearer is Battle-shocked, add 2 to the Attacks, Strength, and Damage characteristics of the bearer’s melee weapons instead.",
        "keywords": ["Adeptus Astartes"],
        "excludes": [],
        "cost": "20"
      },
      {
        "name": "Pennant of Remembrance",
        "description": "Bladeguard Ancient, Primaris Ancient, or Terminator Ancient model only. While the bearer is leading a unit, models in that unit have the Feel No Pain 6+ ability. While that unit is Battle-shocked, models in that unit have the Feel No Pain 4+ ability instead.",
        "keywords": ["Bladeguard Ancient", "Primaris Ancient", "Terminator Ancient model"],
        "excludes": [],
        "cost": "10"
      }
    ]
  },
  {
    "faction_id": "CSM",
    "enhancements": [
      {
        "name": "Eye of Tzeentch",
        "description": "Heretic Astartes Tzeentch model only. Each time the bearer’s unit makes a Dark Pact, take a Leadership test for the bearer: if that test is passed, you gain 1CP.",
        "keywords": ["Heretic Astartes", "Tzeentch"],
        "excludes": [],
        "cost": "30"
      },
      {
        "name": "Intoxicating Elixir",
        "description": "Heretic Astartes Slaanesh model only. The bearer has the Feel No Pain 5+ ability. Each time the bearer shoots or fights, if the bearer’s unit made a Dark Pact this phase, after the bearer has resolved those attacks, select one enemy unit that was hit by one or more of those attacks; that enemy unit must take a Battle-shock test.",
        "keywords": ["Heretic Astartes", "Slaanesh"],
        "excludes": [],
        "cost": "15"
      },
      {
        "name": "Liber Hereticus",
        "description": "Heretic Astartes Chaos Undivided model only. Each time the bearer’s unit makes a Dark Pact, that unit’s weapons gain the [LETHAL HITS] and [SUSTAINED HITS 1] ability until the end of the phase, instead of just gaining one of those abilities.",
        "keywords": ["Heretic Astartes", "Chaos Undivided"],
        "excludes": [],
        "cost": "40"
      },
      {
        "name": "Orbs of Unlife",
        "description": "Heretic Astartes Nurgle model only. At the end of the Fight phase, roll one D6 for every enemy unit within 6\" of the bearer, adding 1 to the result if the bearer’s unit made a Dark Pact that phase: on a 4+, that enemy unit suffers D3 mortal wounds.",
        "keywords": ["Heretic Astartes", "Nurgle"],
        "excludes": [],
        "cost": "25"
      },
      {
        "name": "Talisman of Burning Blood",
        "description": "Heretic Astartes Khorne model only. Add 1 to the Attacks and Strength characteristics of the bearer’s melee weapons. Each time the bearer’s unit makes a Dark Pact, until the end of the phase, add D3 to the Attacks and Strength characteristics of the bearer’s melee weapons instead.",
        "keywords": ["Heretic Astartes", "Khorne"],
        "excludes": [],
        "cost": "20"
      }
    ]
  },
  {
    "faction_id": "QT",
    "enhancements": [
      {
        "name": "Lord of Dread",
        "description": "Chaos Knights model only. At the start of the Fight phase, you can select one enemy unit within Engagement Range of the bearer; that enemy unit must take a Battle-shock test.",
        "keywords": ["Chaos Knights"],
        "excludes": [],
        "cost": "35"
      },
      {
        "name": "Aura of Terror",
        "description": "Chaos Knights model only. If you control an objective marker at the end of your Command phase, and the bearer is within range of that objective marker, that objective marker is said to be Tainted and remains under your control even if you have no models within range of it, until your opponent controls it at the start or end of any turn. In addition, while an objective marker is Tainted and under your control and the Despair Dread ability is active for your army, that objective marker has the Despair Dread ability as if it was a Chaos Knights model from your army (so subtract 1 from Battle-shock and Leadership tests taken for enemy units within 12\" of it).",
        "keywords": ["Chaos Knights"],
        "excludes": [],
        "cost": "25"
      },
      {
        "name": "The Traitor's Mark",
        "description": "Chaos Knights model only. The Doom and Darkness ability is active for the bearer from the first battle round onwards, instead of from the third.",
        "keywords": ["Chaos Knights"],
        "excludes": [],
        "cost": "30"
      },
      {
        "name": "Panoply of the Cursed Knights",
        "description": "Chaos Knights model only. Each time an attack is made against the bearer, subtract 1 from the Armour Penetration characteristic of that attack.",
        "keywords": ["Chaos Knights"],
        "excludes": [],
        "cost": "40"
      }
    ]
  },
  {
    "faction_id": "CD",
    "enhancements": [
      {
        "name": "A’rgath, the King of Blades",
        "description": "Khorne Legiones Daemonica model only. Add 1 to the Attacks and Strength characteristics of the bearer’s melee weapons. While the bearer is within your army’s Shadow of Chaos, add 2 to the Attacks and Strength characteristics of the bearer’s melee weapons instead.",
        "keywords": ["Khorne", "Legiones Daemonica"],
        "excludes": [],
        "cost": "20"
      },
      {
        "name": "Soulstealer",
        "description": "Slaanesh Legiones Daemonica model only. Each time the bearer destroys an enemy model with a melee attack, roll one D6, adding 1 to the result if the bearer is within your army’s Shadow of Chaos. On a 4+, the bearer regains 1 lost wound.",
        "keywords": ["Slaanesh", "Legiones Daemonica"],
        "excludes": [],
        "cost": "15"
      },
      {
        "name": "The Endless Gift",
        "description": "Nurgle Legiones Daemonica model only. The bearer has the Feel No Pain 5+ ability. While the bearer is within your army’s Shadow of Chaos, the bearer has the Feel No Pain 4+ ability instead.",
        "keywords": ["Nurgle", "Legiones Daemonica"],
        "excludes": [],
        "cost": "30"
      },
      {
        "name": "The Everstave",
        "description": "Tzeentch Legiones Daemonica model only. Add 1 to the Strength characteristic of the bearer’s ranged weapons and increase the Range characteristic of such weapons by 3\". While the bearer is within your army’s Shadow of Chaos, add 2 to the Strength characteristic of the bearer’s ranged weapons and increase the Range characteristic of such weapons by 6\" instead.",
        "keywords": ["Tzeentch", "Legiones Daemonica"],
        "excludes": [],
        "cost": "25"
      }
    ]
  },
  {
    "faction_id": "CHBA",
    "enhancements": [
      {
        "name": "Archangel’s Shard",
        "description": "Adeptus Astartes model only. The bearer’s melee weapons have the [ANTI-CHAOS 5+] and [LANCE] abilities.",
        "keywords": ["Adeptus Astartes"],
        "excludes": [],
        "cost": "25"
      },
      {
        "name": "Artisan of War",
        "description": "Adeptus Astartes model only. Improve the Armour Penetration characteristic of the bearer’s weapons by 1, and the bearer has a Save characteristic of 2+.",
        "keywords": ["Adeptus Astartes"],
        "excludes": [],
        "cost": "20"
      },
      {
        "name": "Icon of the Angel",
        "description": "Adeptus Astartes model only. Each time an enemy unit (excluding Monsters and Vehicles) within Engagement Range of the bearer’s unit is selected to Fall Back, models in that enemy unit must take Desperate Escape tests as if their unit was Battle-shocked. When doing so, if that enemy unit is also Battle-shocked by other means, subtract 1 from each of those Desperate Escape tests.",
        "keywords": ["Adeptus Astartes"],
        "excludes": [],
        "cost": "10"
      },
      {
        "name": "Visage of Death",
        "description": "Adeptus Astartes model only. While an enemy unit (excluding Monsters and Vehicles) is within Engagement Range of the bearer’s unit, halve the Objective Control characteristic of models in that unit.",
        "keywords": ["Adeptus Astartes"],
        "excludes": [],
        "cost": "15"
      }
    ]
  },
  {
    "faction_id": "AM",
    "enhancements": [
      {
        "name": "Death Mask of Ollanius",
        "description": "Officer model only. While the bearer’s unit is Battle-shocked, subtract 1 from the Objective Control characteristic of models in that unit, instead of changing it to 0.",
        "keywords": ["Officer"],
        "excludes": [],
        "cost": "10"
      },
      {
        "name": "Drill Commander",
        "description": "Officer model only. While the bearer is leading a unit, each time a model in that unit makes a ranged attack, if that unit Remained Stationary this turn, a Critical Hit is scored on a successful unmodified Hit roll of 5+.",
        "keywords": ["Officer"],
        "excludes": [],
        "cost": "20"
      },
      {
        "name": "Grand Strategist",
        "description": "Officer model only. In your Command phase, the bearer can issue one additional Order.",
        "keywords": ["Officer"],
        "excludes": [],
        "cost": "15"
      },
      {
        "name": "Kurov’s Aquila",
        "description": "Officer model only. Once per battle, just after your opponent has used a Stratagem, the bearer can use this Enhancement. If it does, until the end of the battle, the CP cost your opponent must pay to use that Stratagem again is increased by 1CP.",
        "keywords": ["Officer"],
        "excludes": [],
        "cost": "40"
      }
    ]
  },
  {
    "faction_id": "QI",
    "enhancements": [
      {
        "name": "REVERED KNIGHT",
        "description": "Imperial Knights model only. While a friendly Imperial Knights model is within 6\" of the bearer, improve that model’s Leadership characteristic by 1. If your army is Honoured, increase the range of this Aura ability to 12\".",
        "keywords": ["Imperial Knights"],
        "cost": "20"
      },
      {
        "name": "MYSTERIOUS GUARDIAN",
        "description": "Imperial Knights model only. The bearer has the Deep Strike ability. Once per battle, at the end of your opponent’s turn, if the bearer is not within Engagement Range of any enemy units, it can fade away. If it does, remove it from the battlefield then, in the Reinforcements step of your subsequent Movement phase, set it up anywhere on the battlefield that is more than 9\" horizontally away from all enemy models. If the battle ends and the bearer is not on the battlefield, it is destroyed",
        "keywords": ["Imperial Knights"],
        "cost": "35"
      },
      {
        "name": "MYTHIC HERO",
        "description": "Questoris model with a Bondsman ability only. Each time the bearer uses its Bondsman ability, you can select one additional friendly Armiger model within 12\" of the bearer that is not already being affected by a Bondsman ability. Until the start of your next Command phase, that model is also affected by that Bondsman ability.",
        "keywords": ["Questoris"],
        "cost": "25"
      },
      {
        "name": "BANNER OF MACHARIUS TRIUMPHANT",
        "description": "Imperial Knights model only. If you control an objective marker at the end of your Command phase and the bearer is within range of that objective marker, that objective marker remains under your control even if you have no models within range of it, until your opponent controls it at the start or end of any turn.",
        "keywords": ["Imperial Knights"],
        "cost": "30"
      },
      {
        "name": "UNYIELDING PARAGON",
        "description": "Questoris model only. Each time an attack is allocated to the bearer, worsen the Armour Penetration characteristic of that attack by 1.",
        "keywords": ["Questoris"],
        "cost": "40"
      }
    ]
  },
  {
    "faction_id": "AC",
    "enhancements": [
      {
        "name": "UNSTOPPABLE DESTROYER",
        "description": "■ Adeptus Custodes model only (excluding Anathema Psykana models). Each time the bearer ends a Charge move, select one enemy unit within Engagement Range of the bearer and roll one D6: on a 2-5, that enemy unit suffers D3 mortal wounds; on a 6, that enemy unit suffers 3 mortal wounds. ■ Once per battle, after the bearer’s unit ends a Charge move, all enemy units within 6\" of the bearer must take a Battle-shock test.",
        "keywords": ["Adeptus Custodes"],
        "exclusions": ["Anathema Psykana"],
        "cost": "25"
      },
      {
        "name": "INSPIRATIONAL EXEMPLAR",
        "description": "■ Adeptus Custodes model only (excluding Anathema Psykana models). The bearer has a Leadership characteristic of 5+. ■ Once per battle, at the start of any phase, you can select one friendly Adeptus Custodes unit that is Battle-shocked and within 12\" of the bearer; that unit is no longer Battle-shocked.",
        "keywords": ["Adeptus Custodes"],
        "exclusions": ["Anathema Psykana"],
        "cost": "10"
      },
      {
        "name": "VEILED BLADE",
        "description": "■ Adeptus Custodes model only (excluding Anathema Psykana models). Add 2 to the Attacks characteristic of the bearer’s melee weapons. ■ Once per battle, at the start of any Command phase, triple the bearer’s Objective Control characteristic until the end of the turn.",
        "keywords": ["Adeptus Custodes"],
        "exclusions": ["Anathema Psykana"],
        "cost": "25"
      },
      {
        "name": "CEASELESS HUNTER",
        "description": "■ Adeptus Custodes model only (excluding Anathema Psykana models). The bearer’s unit is eligible to shoot and declare a charge in a turn in which it Fell Back. ■ Once per battle, when an enemy unit ends a Normal,Advance or Fall Back move within 9\" of the bearer, if the bearer’s unit is not within Engagement Range of one or more enemy units, it can make a Normal move of up to 6\".",
        "keywords": ["Adeptus Custodes"],
        "exclusions": ["Anathema Psykana"],
        "cost": "30"
      }
    ]
  },
  {
    "faction_id": "AdM",
    "enhancements": [
      {
        "name": "Archived Purge Protocols",
        "description": "Skitarii Marshal model only. At the start of the battle round, you can select one friendly Skitarii unit within 12\" of the bearer. Until the start of the next battle round, if the Protector Imperative is active for your army, the Conqueror Imperative is active for that unit instead, and if the Conqueror Imperative is active for your army, the Protector Imperative is active for that unit instead.",
        "keywords": ["Skitarii Marshal"],
        "excludes": [],
        "cost": "10"
      },
      {
        "name": "Excoriating Emanation",
        "description": "Adeptus Mechanicus model only. While the bearer is leading a unit, models in that unit have the Stealth ability.",
        "keywords": ["Adeptus Mechanicus"],
        "excludes": [],
        "cost": "25"
      },
      {
        "name": "Master Annihilator",
        "description": "Adeptus Mechanicus model only. While the bearer is leading a unit, ranged weapons equipped by models in that unit have the [SUSTAINED HITS 1] ability.",
        "keywords": ["Adeptus Mechanicus"],
        "excludes": [],
        "cost": "35"
      },
      {
        "name": "Omni-steriliser",
        "description": "Adeptus Mechanicus model only. Add 3 to the Attacks characteristic of the bearer's ranged weapons. In addition, the bearer's ranged weapons have the [ANTI-INFANTRY 2+] and [ANTI-MONSTER 4+] abilities.",
        "keywords": ["Adeptus Mechanicus"],
        "excludes": [],
        "cost": "20"
      }
    ]
  },
  {
    "faction_id": "AE",
    "enhancements": [
      {
        "name": "Fate’s Messenger",
        "description": "Aeldari model only. Once per turn, just after making a Hit roll, a Wound roll, or a saving throw for a model in the bearer’s unit, you can treat the result as an unmodified roll of 6 instead.",
        "keywords": ["Aeldari"],
        "excludes": [],
        "cost": "15"
      },
      {
        "name": "Reader of the Runes",
        "description": "Aeldari Psyker model only. In your Command phase, you can select one dice in your Fate dice pool, re-roll it, then add it back to your Fate dice pool displaying the result you just rolled.",
        "keywords": ["Aeldari", "Psyker"],
        "excludes": [],
        "cost": "20"
      },
      {
        "name": "The Phoenix Gem",
        "description": "Aeldari model only. The first time the bearer is destroyed, roll one D6: on a 2+, keep it to one side. At the end of the phase, set the bearer back up again, as close as possible to its previous position and not within Engagement Range of any enemy models, with its full wounds remaining.",
        "keywords": ["Aeldari"],
        "excludes": [],
        "cost": "25"
      },
      {
        "name": "The Weeping Stones",
        "description": "Aeldari model only. Each time the bearer’s unit destroys an enemy unit, roll one D6 and add it to your Fate dice pool displaying the result you just rolled.",
        "keywords": ["Aeldari"],
        "excludes": [],
        "cost": "15"
      }
    ]
  },
  {
    "faction_id": "AdM",
    "enhancements": [
      {
        "name": "Archived Purge Protocols",
        "description": "Skitarii Marshal model only. At the start of the battle round, you can select one friendly Skitarii unit within 12\" of the bearer. Until the start of the next battle round, if the Protector Imperative is active for your army, the Conqueror Imperative is active for that unit instead, and if the Conqueror Imperative is active for your army, the Protector Imperative is active for that unit instead.",
        "keywords": ["Marshal"],
        "excludes": [],
        "cost": "10"
      },
      {
        "name": "Excoriating Emanation",
        "description": "Adeptus Mechanicus model only. While the bearer is leading a unit, models in that unit have the Stealth ability.",
        "keywords": ["Adeptus Mechanicus"],
        "excludes": [],
        "cost": "25"
      },
      {
        "name": "Master Annihilator",
        "description": "Adeptus Mechanicus model only. While the bearer is leading a unit, ranged weapons equipped by models in that unit have the [SUSTAINED HITS 1] ability.",
        "keywords": ["Adeptus Mechanicus"],
        "excludes": [],
        "cost": "35"
      },
      {
        "name": "Omni-steriliser",
        "description": "Adeptus Mechanicus model only. Add 3 to the Attacks characteristic of the bearer's ranged weapons. In addition, the bearer's ranged weapons have the [ANTI-INFANTRY 2+] and [ANTI-MONSTER 4+] abilities.",
        "keywords": ["Adeptus Mechanicus"],
        "excludes": [],
        "cost": "20"
      }
    ]
  },
  {
    "faction_id": "AS",
    "enhancements": [
      {
        "name": "SAINTLY EXAMPLE",
        "description": "Adepta Sororitas model only. When the bearer is destroyed, you gain an additional D3 Miracle dice.",
        "keywords": ["Adepta Sororitas"],
        "cost": "10"
      },
      {
        "name": "BLADE OF SAINT ELLYNOR",
        "description": "Adepta Sororitas model only. Add 1 to the Attacks, Strength and Damage characteristics of the bearer’s  melee weapons. If the bearer has lost one or more wounds, add 2 to the Attacks, Strength and Damage characteristics of the bearer’s melee weapons instead.",
        "keywords": ["Adepta Sororitas"],
        "cost": "15"
      },
      {
        "name": "LITANIES OF FAITH",
        "description": "Adepta Sororitas model only. At the end of your Command phase, if the bearer is on the battlefield, you can re-roll one Miracle dice from your Miracle dice pool and return it to your Miracle dice pool with the new result you rolled. When doing so, if the bearer has lost one or more wounds or is leading a unit that is Below Half-strength, you can re-roll up to three Miracle dice in this way instead.",
        "keywords": ["Adepta Sororitas"],
        "cost": "25"
      },
      {
        "name": "MANTLE OF OPHELIA",
        "description": "Canoness or Palatine model only. Each time an attack is allocated to the bearer, change the Damage characteristic of that attack to 1.",
        "keywords": ["Canoness", "Palatine"],
        "cost": "20"
      }
    ]
  }
]
